"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def math_series(n):
    return [1, 1] if n == 1 else [math_series(n - 1)[0] + 1, (math_series(n - 1)[1] + math_series(n - 1)[0] + 1)]

def short_summ(n):
    return n*(n+1)/2

def math_series_input():
    try:
        user_number = int(input('Введите число: '))
    except:
        print('Вы ввели не числовое значение')
        return
    left_side = math_series(user_number)[1]
    right_side = short_summ(user_number)
    return print(f'Значения сошлись: {left_side} = {right_side}') if left_side == right_side else print(f'Значения не сошлись: {left_side} != {right_side}')

math_series_input()