"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
#В одну строчку

def math_series(n):
    return [1, 1] if n == 1 else [math_series(n - 1)[0] * -0.5, (math_series(n - 1)[1] + math_series(n - 1)[0] * -0.5)]


def math_series_input():
    try:
        user_number = int(input('Введите число: '))
    except:
        print('Вы ввели не числовое значение')
        return
    return print(f'Сумма ряда: {math_series(user_number)[1]}')


math_series_input()
