"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""
#Сделал как понял. Не совсем удачный пример для рекурсии или я чего-то не понимаю.
def calculator():
    operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operator in ['+', '-', '*', '/', '0']:
        if operator == '0':
            return
        try:
            a = float(input('Введите первое число: '))
            b = float(input('Введите второе число: '))
        except:
            print('Вы вместо числа ввели строку. Исправьтесь')
            calculator()
        if operator == '+':
            print(a + b)
        elif operator == '-':
            print(a - b)
        elif operator == '*':
            print(a * b)
        elif operator == '/':
            if b != 0:
                print(a / b)
            else:
                print('Деление на ноль запрещено')
    else:
        print('Нет такой операции')
    calculator()

calculator()
