from random import randint
"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def guess_num(num=randint(1, 100), count=9):
    value = int(input('Введите число - '))
    if count == 0:
        return f'Вы проиграли, было загадано число {num}'
    if value == num:
        return 'Вы победили'
    if value > num:
        print('Вы ввели слишком большое число')
    else:
        print('Вы ввели слишком маленькое число')
    return guess_num(num, count-1)


print(guess_num())


