"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculate(res=1.0):
    operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operator.isdigit() and int(operator) == 0:
        return 'Выход'
    else:
        if operator in ('+', '-', '*', '/'):
            try:
                value_1 = int(input('Введите первое число - '))
                value_2 = int(input('Введите второе число - '))

                if operator == '+':
                    print(value_1+value_2)
                    calculate(value_1+value_2)

                elif operator == '-':
                    print(value_1-value_2)
                    calculate(value_1-value_2)

                elif operator == '*':
                    print(value_1*value_2)
                    calculate(value_1*value_2)

                elif operator == '/':
                    try:
                        print(value_1/value_2)
                    except ZeroDivisionError:
                        print('Делить на ноль нельзя')
                    finally:
                        calculate()

            except ValueError:
                print('Вы вместо числа ввели строку (((. Исправьтесь')
                calculate()
        else:
            print('Введен неверный знак')
            calculate()
    return 'Выход'


print(calculate())
