"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc(sum=0):
    print("Ваш результат: {}".format(sum))

    meth = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if meth == '0':
        return "Выход!"
    elif meth != "+" and meth != "*" and meth != "-" and meth != "/":
        print("Вы ввели {}. Введите операцию (+, -, *, / или 0 для выхода):".format(meth))
        return calc(0)

    try:
        numb_1 = int(input("Введите первое число: "))
        numb_2 = int(input("Введите второе число: "))
    except ValueError:
        print("Вы ввели не число. Исправтесь! ")
        return calc(0)

    if meth == "/":
        if numb_2 == 0:
            print("Деление на ноль не возможно!")
            return calc(0)
        else:
            return calc((numb_1 / numb_2))
    elif meth == "+":
        return calc(numb_1 + numb_2)
    elif meth == "-":
        return calc(numb_1 - numb_2)
    elif meth == "*":
        return calc(numb_1 * numb_2)


print(calc())
