"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def calc(f_mode = False, x = False):
    if not f_mode:
        f_mode = input("Введите знак операции (+,-,*,/) 0-выход: ")
    if f_mode == '0':
        print("Завершение работы.")
    elif f_mode not in ('+','-','*','/'):
        print("Неверный знак операции")
        return calc()
    else:
        if not x:
            x = input("Введите число x = ")
            if not x.isdigit():
                print('Вы ввели не число.')
                return calc(f_mode)
        y = input("Введите число y = ")
        if not y.isdigit():
            print('Вы ввели не число.')
            return calc(f_mode,x)
        x = float(x)
        y = float(y)
        if f_mode == '+':
            print("%.2f" % (x + y))
        elif f_mode == '-':
            print("%.2f" % (x - y))
        elif f_mode == '*':
            print("%.2f" % (x * y))
        elif f_mode == '/' and y != 0:
                print("%.2f" % (x / y))
        else:
            print("Деление на ноль!")
        return calc()

if __name__ == '__main__':
    calc()