"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def calc():
    type_of_operation = input('Введите +, -, *, / или 0 для выхода')

    if type_of_operation == "0":
        return  'Выход'

    else:

        if type_of_operation == "+" or type_of_operation == "-" or type_of_operation == "*" \
        or type_of_operation == "/":

            try:
                first_num = int(input('Введите число:'))
                second_num = int(input('Введите число:'))

                if type_of_operation == '+':
                    print(first_num + second_num)
                    return calc()

                elif type_of_operation == '-':
                    print(first_num - second_num)
                    return calc()

                elif type_of_operation == '*':
                    print(first_num * second_num)
                    return calc()

                elif type_of_operation == '/':
                    try:
                        res = first_num / second_num
                    except ZeroDivisionError:
                        print ('Деление на ноль не предусмотренно')
                    else:
                        print(res)
                    finally:
                        return calc()

            except ValueError:
                print('Вы ввели строку. Введите дургие значения')
                return calc()

        print('Такого знака нет. Повторите')
        return calc()


calc()
