"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc():
    """
    Калькулятор
    """
    operation = input('Введите математическую операцию (+,-,*,/) или 0 для выхода:')
    if operation == '0':
        print ('Программа остановлена')
    elif operation not in ('+', '-', '*', '/', '0'):
        print ('Неверный ввод')
        calc()
    try:
        operant_1 = int(input('Введите первое число:'))
        operant_2 = int(input('Введите второе число:'))
    except ValueError:
        print ('Вы вместо числа ввели строку (((. Исправьтесь')
        calc()
    if operation == '+':
        print (f'Ваш результат {operant_1 + operant_2}')
        calc()
    elif operation == '-':
        print (f'Ваш результат {operant_1 - operant_2}')
        calc()
    elif operation == '*':
        print (f'Ваш результат {operant_1 * operant_2}')
        calc()
    elif operation == '/':
        try:
            print (f'Ваш результат {int(operant_1 / operant_2)}')
            calc()
        except ZeroDivisionError:
            print ('На ноль делить нельзя!')
            calc()


print(calc())