"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def sum_rec(first_n, n, el, result):
    if n == 0:
        return f'Количество элементов: {first_n}, их сумма: {result}'
    else:
        return sum_rec(first_n, n - 1, (el - el / 2) * (-1), result + el)

inp_n = int(input('Введите количество элементов: '))
print(sum_rec(inp_n, inp_n, 1, 0))
