"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_collection(n, number):
    if n != 0:
        try:
            """print(f'Шаг: {n} Число {float(number)} + ({float(number) / (-2)}) = '
                  f'{float(number) + float(number) / (-2)}')"""
            return float(number) + sum_collection(int(n) - 1, float(number) / (-2))
        except ValueError:
            print(f'Ошибка, ввода чисел')
            return sum_collection(input('Введите количество элементов (n): '), input('Введите элемент старта: '))
    else:
        return 0


print(sum_collection(input('Введите количество элементов (n): '), input('Введите элемент старта: ')))
