"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def operation_request():
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    symbol = ('+', '-', '*', '/')

    if operation == '0':
        print('Произведен выход')

    elif operation not in symbol:
        print('Введен некорректный знак!')
        return operation_request()

    else:
        request_for_number_1 = int(input('Введите первое число: '))
        request_for_number_2 = int(input('Введите второе число: '))
        if operation == '+':
            print(f'Результат: {request_for_number_1 + request_for_number_2}')
        elif operation == '-':
            print(f'Результат: {request_for_number_1 - request_for_number_2}')
        elif operation == '*':
            print(f'Результат: {request_for_number_1 * request_for_number_2}')
        elif operation == '/':
            if request_for_number_2 > 0:
                print(f'Результат: {request_for_number_1 / request_for_number_2}')
            elif request_for_number_2 == 0:
                print('На ноль делить нельзя!')


operation_request()
