"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


import random


def guess_number(num, count):
    if count == 0:
        return 'Игра закончилась'
    intended = int(input('введите число: '))
    if num == intended:
        return f'Вы угадали! Загаданное число: {intended}'
    if num < intended:
        print(f'Меньше! Осталось попыток: {count - 1}')
        return guess_number(num, count - 1)
    if num > intended:
        print(f'Больше! Осталось попыток: {count - 1}')
        return guess_number(num, count - 1)


print(guess_number(random.randint(1, 100), 10))











