"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def get_num():
    try:
        num = int(input('Введите число элементов ряда: '))
        return num
    except ValueError:
        print('На число не похоже. Попробуйте еще раз.')


def get_sum(multi, count):
    # if multi < count:
    #     return (-0.5)**multi + get_sum(multi + 1, count)
    # else:
    #     return (-0.5)**multi
    return (-0.5)**multi + get_sum(multi + 1, count) if multi < count else (-0.5)**multi

num = get_num()
if num is not None:
    print(get_sum(0, num-1))
