"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def sum_of_els(n):
    if n == 1:
        return 1
    if n % 2 == 0:
        return (1 / (-2 ** (n-1))) + sum_of_els(n - 1)
    if n % 2 == 1:
        return (1 / (2 ** (n-1))) + sum_of_els(n - 1)




num_of_els = int(input('Введите количество элементов: '))
print(sum_of_els(num_of_els))