"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

from random import randint


def guess_game(step, numb):
    print("попытка: ", step, " из 10")
    answer = int(input("введите число от 0 до 100: "))
    if step == 10 or answer == numb:
        if answer == numb:
            print("вы угадали!\nэто было число ", numb)
        else:
            print("попытки закончились\nэто было число ", numb)
    else:
        if answer > numb:
            print("попробуйте число меньше")
        else:
            print("попробуйте число больше")
        guess_game(step + 1, numb)

guess_game(1, randint(0, 100))
