"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def is_int(datum):
    try:
        return int(datum)
    except ValueError:
        return None


def calc():
    operators = ('+', '-', '*', '/')
    operator = input('Введите операцию (+, -, *, / или 0 для выхода: ')
    if operator == '0':
        print('Программа завершена')
        return
    elif operator in operators:
        num_1 = is_int(input('Введите первое число: '))
        num_2 = is_int(input('Введите второе число: '))
        if num_1 is None or num_2 is None:
            print('Вы вместо числа ввели строку (((. Исправьтесь')
            calc()
        elif operator == '+':
            print(f'Результат сложения: {num_1 + num_2}')
            calc()
        elif operator == '-':
            print(f'Результат вычитания: {num_1 - num_2}')
            calc()
        elif operator == '*':
            print(f'Результат умножения: {num_1 * num_2}')
            calc()
        elif operator == '/':
            if num_2 == 0:
                print('На ноль делить нельзя')
                calc()
            else:
                print(f'Результат деления: {round(num_1 / num_2, 2)}')
                calc()
    else:
        print('Вы ввели неверный знак операции')
        calc()


if __name__ == 'main':
    calc()
