"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    operator = input("Введите операцию (+, -, *, / или 0 для выхода)")
    if operator == "0":
        print("Спасибо, что воспользовались моим калькулятором!")
        return None
    else:
        if operator in "+-/*":
            try:
                number_1 = float(input("Введите первое число:"))
                number_2 = float(input("Введите второе число:"))
                if operator == "+":
                    result = number_1 + number_2
                    print(f"Рузельтат сложения, равняется: {result}")
                    return calculator()
                elif operator == "-":
                    result = number_1 - number_2
                    print(f"Рузельтат вычетания, равняется: {result}")
                    return calculator()
                elif operator == "*":
                    result = number_1 * number_2
                    print(f"Рузельтат умножения, равняется: {result}")
                    return calculator()
                elif operator == "/":
                    try:
                        result = number_1 / number_2
                        print(f"Рузельтат деления, равняется: {result}")
                        return calculator()
                    except ZeroDivisionError:
                        print("На ноль делить нельзя! Повторите ввод!")
                        return calculator()
            except ValueError:
                print("Вы ввели, не число! Повторите ввод!")
                return calculator()
        else:
            print("Вы вели не тот символ оператора! Повторите ввод!")
            return calculator()


if __name__ == "__main__":
    calculator()
