"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def show_ascii(cur: int = 32):
    if cur == 128:
        return
    print(f"{cur:3}: {chr(cur)}", end='\t')
    if cur % 10 == 1:
        print()
    show_ascii(cur+1)


if __name__ == '__main__':
    show_ascii()
