"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def reversive(num, num_reverse=''):
    last_number = str(int(num) % 10)  # Преобразуем последнее число в строку
    # Базовый случай
    if int(num) == 0:
        return print(num_reverse)
    # Шаг рекурсии
    else:
        num_reverse += last_number  # Пользуясь конкатенацией, прибавляем к пустой строке последнюю цифру (LIFO)
        return reversive(int(num) // 10, num_reverse)  # Вызываем функцию без последнего числа


number = input('Введите число, которое требуется перевернуть: ')

reversive(number)
