"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
""" Оставила в файле решение с циклом для себя. """


def reversed_num():
    number = input('Введите целое число: ')
    result = ''
    while number:
        result += str(int(number) % 10)
        number = int(number) // 10
    print(f'Число наоборот: {result}')


def reversed_num_recurs(number, result=''):
    if not number:
        print(f'Число наоборот: {result}')
    else:
        result += str(int(number) % 10)
        number = int(number) // 10
        return reversed_num_recurs(number, result)


# reversed_num()
reversed_num_recurs(input('Введите целое число: '))
