"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_el(num, max):
    if max == 0:
        return 0
    return num + sum_el(num / 2 * -1, max - 1)


max = int(input("Введите количество элементов: "))
if max <= 0:
    print("Число должно быть больше 0")
    exit(1)
print(f'Количество элементов: {max}, их сумма: {sum_el(1, max)}')
