"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_of_row(num, result=1):
    if num < 1:
        return 'некорректное значение'
    elif num == 1:
        return result
    else:
        return result + sum_of_row(num - 1, -(result/2))


if __name__ == '__main__':
    print(sum_of_row(1))
    print(sum_of_row(2))
    print(sum_of_row(3))
    print(sum_of_row(4))