"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    signs = ['+', '-', '*', '/']
    sign = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if sign == '0':
        print('Завершение работы программы')
        return None
    elif sign not in signs:
        print('Вы ввели некорректный знак, попробуйте еще раз')
        return calculator()
    else:
        first_num = input('Введите первое число: ')
        if not first_num.isdigit():
            print('Вы ввели не число, попробуйте еще раз')
            return calculator()
        last_num = input('Введите второе число: ')
        if not last_num.isdigit():
            print('Вы ввели не число, попробуйте еще раз')
            return calculator()
        if sign == '+':
            print(f'Ваш результат {int(first_num) + int(last_num)}')
        elif sign == '-':
            print(f'Ваш результат {int(first_num) - int(last_num)}')
        elif sign == '*':
            print(f'Ваш результат {int(first_num) * int(last_num)}')
        elif sign == '/':
            try:
                print(f'Ваш результат {int(first_num) / int(last_num)}')
            except ZeroDivisionError:
                print(f'Ошибка, делить на ноль нельзя')
        return calculator()


calculator()
