"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
request = int(input('Введите количество элементов: '))


def get_the_sum(number):
    if number == 0:
        return 0
    else:
        sum_of_elements = 1 + get_the_sum(number - 1) / -2
        return sum_of_elements


print(f'Сумма элементов равна: {get_the_sum(request)}')
