"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def add(number1, number2):
    return number1 + number2


def sub(number1, number2):
    return number1 - number2


def mul(number1, number2):
    return number1 * number2


def div(number1, number2):
    return number1 / number2


def func1():
    available_operations = {"+": add, "-": sub, "*": mul, "/": div}
    operation = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if operation == "0":
        return "Завершаем программу"
    if operation in available_operations:
        while True:
            try:
                number1 = int(input("Введите первое число: "))
                number2 = int(input("Введите второе число: "))
                break
            except ValueError:
                print("Вы ввели не число")
        result = available_operations[operation](number1, number2)
        print(f"Ваш результат: {result}")
        return print(func1())
    else:
        print("Вы ввели неверную операцию (((. Исправьтесь")
        return print(func1())


print(func1())
