"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который
даст рекурсивная ф-ция со значением, полученным в правой части (здесь
нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def my_sum_recursion(int_number):
    """
    Возвращает сумму чисел от 1 до n
    :param int_number: целое число
    :return: 1+2+3+...+n
    """
    if not int_number:
        return 0
    return my_sum_recursion(int_number - 1) + int_number


NUMBER = 15
if my_sum_recursion(NUMBER) == NUMBER * (NUMBER + 1) / 2:
    print("Равенство выполняется.")
else:
    print("Равенство не выпоняется")
