"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def calc():
    operation_type = input('Введите операцию между числами: +, -, /, *, или введите 0 для выхода')
    if operation_type == 0:
        return 'Выход'
    else:
        if operation_type in '+-/*':
            try:
                num1 = int(input('Введите первое трехзначное число: '))
                num2 = int(input('Введите второе трехзначное число: '))

                if operation_type == '+':
                    result = num1 + num2
                    print(f"Результат {result}")
                    return calc()

                elif operation_type == '-':
                    result = num1 - num2
                    print(f"Результат {result}")
                    return calc()
                elif operation_type == '/':
                    try:
                        result = num1 / num2
                    except ZeroDivisionError:
                        print('Делить на 0 нельзя!')
                    else:
                        print(f"Результат: {result}")
                    finally:
                        return calc()

            except ValueError:
                print('Вы ввели строку, ай я яй!')
                return calc()
        else:
            print('Введите правильный символ! +, -, /, *, еще раз!')
            return calc()


calc()