"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def another_sum(n):
    if n <= 0:
        return 0
    else:
        return n + another_sum(n - 1)


num = 10
num_sum = another_sum(10)
print(num_sum == num * (num + 1) / 2)
# В одну функцию с рекурсией засунуть и левую, и правую части не вышло, поэтому сделал только так
