"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


# Я так понимаю, из условия задачи следует, что вводимые числа должны быть целыми неотрицательными.

def numbers():
    number = input('Введите целое положительное число, которое требуется перевернуть: ')
    if not number.isdigit():  # После этого остаются натуральные числа и ноль. Он вроде тоже подходит.
        print('Вы должны были ввести целое неотрицательное число. Попробуйте еще раз.')
        return numbers()
    return from_tail_to_head(int(number))


def from_tail_to_head(number):
    if not number // 10:
        return str(number)
    return from_tail_to_head(number % 10) + from_tail_to_head(number // 10)


print('Перевернутое число:', numbers())
