"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random

def rec_game(vol, num):
    answer = int(input('Введите число от 0 до 100:'))
    if  answer == num or vol == 10:
        if answer == num:
            print('Верно')
        print('Загаданное число:', num)

    else:
        if answer > num:
            print('Загаданное число меньше ')

        else:
            print('Загаданное число больше')

        return rec_game(vol + 1, num)

rec_game(1, random.randint(0,100))
