"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def snake_row(user_num_el):
    def calculation(num_el, elementary=1.0):
        if num_el == 1:
            return elementary
        return elementary + calculation(num_el-1, elementary=-(elementary / 2))
    print(f"Количество элементов: {user_num_el}, их сумма: {calculation(user_num_el)}")


snake_row(int(input("Введите количество элементов: ")))
