"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def fun_calc():
    operation = input('Введите операцию: ')
    if operation == 0:
        print('Конец рекурсии!')
    else:
        try:
            val_a = int(input('Введите первое число: '))
            val_b = int(input('Введите второе число: '))
            if operation == '+':
                print(f'Результат: {val_a + val_b}')
            elif operation == '-':
                print(f'Результат: {val_a - val_b}')
            elif operation == '*':
                print(f'Результат: {val_a * val_b}')
            elif operation == '/':
                if val_b > 0:
                    print(f'Результат: {val_a / val_b}')
                elif val_b == 0:
                    print('На ноль делить нельзя.')
            else:
                print(f'Ошибка: вы ввели некорректное значение операции.Повторите сначала!')

            fun_calc()
        except Exception as E:
            print(f'Ошибка: вы ввели некорректное значение. Введите число.')
            fun_calc()


fun_calc()
