"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def recursion(n):
    return '1' if n == 1 else f'{recursion(n - 1)}+{str(n)}'


# В задании не совсем понятно, что должна делать программа. Выводить строку вида: 1+2+...+n = n(n+1)/2?
# Или именно сравнивать выражение? На всякий случай сделал и то и то, хотя равенство и так всегда выполняется.
def summ(n):
    return 1 if n == 1 else summ(n - 1) + n


def digit():
    if summ(n) == n * (n + 1) / 2:
        return '='
    else:
        return '!='


n = int(input('Enter n: '))
print('для n = ', n)
print(f'{recursion(n)} {digit()} {n}({n}+1)/2')
