"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

# def rec(num, new_num=''):
#     d = len(str(num))
#     div = ['0' for i in range(d - 1)]
#     div = int(f'1{"".join(div)}')
#     first_num = num // div
#     new_num += str(first_num)
#     if len(str(num)) == 1:
#         print(new_num[::-1])
#     else:
#         num = num % div
#         return rec(num, new_num)
#
#
# rec(12340)

# аналог
def rec(num):
    first_num, last_num = divmod(num, 10)
    if first_num == 0:
        return str(last_num)
    else:
        str_num = str(last_num)
        return str_num + rec(first_num)


print(rec(102030))

# print(divmod(123, 10))  # (12, 3)
# print(divmod(12, 10))  # (1, 2)
# print(divmod(1, 10))  # (0, 1)
