"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def calc(count,n=None):
    if n is None:
        n = 1
    print(n)
    if count == 0:
        return n
    else:
        count -= 1
        return n+calc(count,n/2*(-1))

count = int(input('Введите количество элементов в последовательности: '))
print(f'Сумма чисел в последовательности составит {calc(count-1)}')