"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def count_number(n):
    if n == 1:
        return n
    else:
        return n + count_number(n-1)


try:
    user_input = int(input('Введите число: '))
    if count_number(user_input) == user_input*(user_input+1)/2:
        print('Утверждение доказано.')
    else:
        print('Утверждение ложно.')
except ValueError:
    print('Вы ввели не число.')
