"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_series(count_el, el=1.00, summ=1):
    if count_el == 1:
        return summ
    else:
        el = el / 2 * -1
        summ += el
        return sum_series(count_el-1, el, summ)


try:
    t_count = int(input('Введите количество элементов: '))
    print(f'Количество элементов: {t_count}, их сумма: {sum_series(t_count)}')
except ValueError:
    print('Вы ввели не корректное число!')
