"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_n(count, elems, num, sum_nums):
    
    if count == elems:
        return sum_nums
    elif count < elems:
        return sum_n(count + 1, elems, num / -2, sum_nums + num)


try:
    elements = int(input('Введите количество элементов: '))
    number = int(input('Введите число: '))
    print(f'Колличество элементов: {elements}')
    print(f'Сумма элементов: {sum_n(0, elements, number, 0)}')
except ValueError:
    print('Вы ввели строку вместо числа!')
