"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def proof(n):  # Создаем функцию, вычисляющую сумму всех значений
    # Базовый случай
    if n == 1:
        return 1
    # Шаг рекурсии
    else:
        return n + proof(n - 1)


n = 100
zum = n * (n + 1) / 2
print(True if proof(n) == zum else False)  # Выводим True, если выполняется равенство суммы чисел и выражения

