"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def guess_number(number, counter=10, g_number=101):
    if g_number == number:
        return f'Поздравляем, Вы выиграли! Загаданное число {number}'
    elif counter == 0:
        return f'К сожалению Вы проиграли: Все 10 попыток не успешны! Загаданное число {number}'
    else:
        print(f'У Вас {counter} попыток/-и')
        try:
            g_number = int(input('Введите число от 0 до 100: '))
            if g_number != number:
                print('Ваше число больше загаданного' if g_number > number else 'Ваше число меньше загаданного')
        except ValueError:
            print("Введено не корректное число")
        counter -= 1
        return guess_number(number, counter, g_number)


num = random.randint(0, 100)
print(guess_number(num))
