"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def set_sum_check(n):
    if n == 1:
        return n
    else:
        return n + set_sum_check(n - 1)


num = int(input('Введите любое натуральное число, для проверки равенства: '))
if set_sum_check(num) == num * (num + 1) / 2:
    print('Равенство верно!', set_sum_check(num))
else:
    print('Это доказательство не работает!')

