"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc(n, step_num, elem):
    """Фунция возвращает результат (elem + elem/-2 + elem/4 + elem/-8 ...)"""
    if step_num == n:
        return elem
    step_num += 1
    return elem + calc(n, step_num, elem / -2)


n = int(input('Enter n: '))
print(calc(n, 1, 1))
