"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


# Дальше не буду проверки валидности ввода делать. Они такие же, как в предыдущих заданиях.


def row_sum(val):
    if val == 1:
        return val
    return (-0.5) ** (val - 1) + row_sum(val - 1)


value = int(input('Введите количество элементов: '))

print(f'Количество элементов: {value}, их сумма: {row_sum(value)}')
