"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    operand = input("Введите операнд или '0' для выхода ")
    if operand == '0':
        return

    else:
        if operand in "+-*/":
            try:
                a = int(input("Первое число для арифметических действий: "))
                b = int(input("Второе число для арифметических действий: "))

                if operand == '+':
                    c = a + b
                    print(c)
                    return calculator()
                elif operand == '-':
                    c = a - b
                    print(c)
                    return calculator()
                elif operand == '*':
                    c = a * b
                    print(c)
                    return calculator()
                elif operand == '/':
                    try:
                        c = a / b
                    except ZeroDivisionError:
                        print("На ноль делить нельзя")
                    else:
                        print(c)
                    finally:
                        return calculator()

            except ValueError:
                print("Введите число")
                return calculator()

        else:
            print("Введите корректный операнд")
            return calculator()


calculator()