"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    """
    Основаня функция - калькулятор
    Так как калькулятор возвращает строку 'До встречи', везде делал через return
    """
    operation = input('Введите операцию (+, -, *, / или 0 для выхода) ')
    if operation not in '+-*/0':
        print('Попробуйте ещё раз')
        return calculator()
    if operation == '0':     # базовый случай
        return 'До встречи!'
    try:
        first_val = float(input('Введите первое число '))
        second_val = float(input('Введите второе число '))
    except:
        print('Какие-то числа не числа. Попробуйте ещё раз')
        return calculator()
    if operation == '+':
        print(first_val + second_val)
    elif operation == '-':
        print(first_val - second_val)
    elif operation == '*':
        print(first_val * second_val)
    else:
        if second_val != 0:
            print(first_val/second_val)
            return calculator()
        else:
            print('На ноль делить неохота. Попробуйте ещё раз')
            return calculator()
    return calculator()


print(calculator())
