"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc_data():
    try:
        a = input("Введите операцию (+, -, *, / или 0 для выхода): \n")
        if a in ['+', '-', '*', '/', '0']:
            if a == '0':
                return None
        else:
            print("опаньки не допустимый символ, попробуй снова")
            return calc_data()

        b = int(input("Введите первое число: \n"))
        c = int(input("Введите второе число: \n"))
        return calculator(a, b, c)

    except ValueError:
        print('Вы вместо трехзначного числа ввели строку (((. Попробуй снова')
        return calc_data()
    except TypeError:
        print("опаньки, что то непредвиденное )")
        return calc_data()


def calculator(a, b, c):
    if a == '+':
        print(f'Ваш результат {b + c}')
    elif a == '-':
        print(f'Ваш результат {b - c}')
    elif a == '*':
        print(f'Ваш результат {b * c}')
    elif a == '/':
        print(f'Ваш результат {b / c}')

    return calc_data()


calc_data()
