"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


from random import randrange

def game(number, count = 9):
    n = int(input("Введите число(0,100): "))
    if n > number:
        print("Число больше")
    if n < number:
        print("Число меньше")
    if number == n:
        return "You win"
    if count == 0:
        return "You lose"
    else:
        print(f'У вас осталось {count} попыток')
        return game(number, count -1)

n = randrange(0, 100)
print(game(n))
