"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    operation = input('Введите операцию: (+, -, *, / или 0 для выхода): ')
    if operation == '0':                                         # базовый случай
        print('Программа завершена')
    elif operation not in ('+', '-', '*', '/', '0'):
        print('Неверный знак!')
        calculator()
    else:
        try:
            num_1 = int(input('Введите первое число: '))
            num_2 = int(input('Введите второе число: '))
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь!')
            calculator()
        else:
            if operation == '+':
                print('результат:', num_1 + num_2)
                calculator()                                    # Шаг рекурсии
            elif operation == '-':
                print('результат:', num_1 - num_2)
                calculator()                                    # Шаг рекурсии
            elif operation == '*':
                print('результат:', num_1 * num_2)
                calculator()                                    # Шаг рекурсии
            else:
                try:
                    print(num_1 / num_2)
                    calculator()                                # Шаг рекурсии
                except ZeroDivisionError:
                    print('На ноль делить нельзя!')
                    calculator()                                # Шаг рекурсии


calculator()