"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


# Хотел реализовать чтобы можно было переворачивать числа типа 0123 на 3210
# но питон при переводе в int отрезает в начале 0 и я не придумал как в теле функции через рекурсию добавить его этот 0
def revers_numb(number):
    result = number % 10

    if number // 10 == 0:
        return result
    else:
        return ''.join(f'{result}{revers_numb(number // 10)}')


a = revers_numb(int(input('Введите целое число: ')))
print(f'Перевернутое число : {a}')
