"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""



def calculator():
    a = input('Ввидите тип операции (+, -, *, / или 0 для выхода): ')
    if a == '0':
        return 'Вы вышли'
    else:
        if a in '+-*/':
            try:
                num_1 = int(input('Видите первое число: '))
                num_2 = int(input('Ввидите второе число: '))
                if a == '+':
                    sum = num_1 + num_2
                    print(f'Ваш результат {sum}')
                    return calculator()
                elif a == '-':
                    sub = num_1 - num_2
                    print(f'Ваш результат {sub}')
                    return calculator()
                elif a == '*':
                    mult = num_1 * num_2
                    print(f'Ваш результат {mult}')
                    return calculator()
                elif a == '/':
                    if a != 0:
                        div = num_1 / num_2
                        print(f'Ваш результат {div}')
                    else:
                        print('Делени на 0 невозможно')
                    return calculator()

            except ValueError:
                print('Вы ввели строку вместо числа')

        else:
                print('Вы ввели неверный символ, попробуйте еще раз.')

calculator()