"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def cnt_chet(val, cnt_ch, cnt_nch):
    if val == 0:
        print(f"Количество четных и нечетных цифр в числе равно: {cnt_ch}, {cnt_nch}")
    else:
        ost = val % 10
        if ost % 2 == 0:
            cnt_ch += 1
        else:
            cnt_nch += 1
        cnt_chet((val // 10), cnt_ch, cnt_nch)


a = int(input('Введите число: '))
print(cnt_chet(a, 0, 0))
