"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def my_calc(operation=False, first_num=False):
    valid_operations = ('+', '-', '*', '/')
    if not operation:
        operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation == '0':
        print('Работа калькулятора завершена')
    elif operation not in valid_operations:
        print('Вы ввели некорректную операцию, попробуйте заново')
        return my_calc()
    else:
        if not first_num:
            first_num = input('Введите первое число: ')
            if not first_num.isdigit():
                print('Вы ввели не число, повторите ввод первого числа!')
                return my_calc(operation)
        second_num = input('Введите второе число: ')
        if not second_num.isdigit():
            print('Вы ввели не число, повторите ввод второго числа!')
            return my_calc(operation, first_num)
        elif operation == '/' and second_num == '0':
            print('Вы пытаетесь делить на 0, введите другое число!')
            return my_calc(operation, first_num)
        else:
            if operation == '+':
                print(f'Ваш результат {int(first_num) + int(second_num)}')
                return my_calc()
            elif operation == '-':
                print(f'Ваш результат {int(first_num) - int(second_num)}')
                return my_calc()
            elif operation == '*':
                print(f'Ваш результат {int(first_num) * int(second_num)}')
                return my_calc()
            else:
                print(f'Ваш результат {int(first_num) / int(second_num)}')
                return my_calc()

print()
if __name__ == '__main__':
    my_calc()
