"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def seq_sum(num_elem):
    if num_elem < 2:
        return 1
    return 1 - seq_sum(num_elem - 1) / 2

num_elem = int(input("Введите количество элементов: "))
print(f'Количество элементов: {num_elem}, их сумма: {seq_sum(num_elem)}')
