"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


values_dict = {'summa': [1], 'n': 0}
values_dict['n'] = int(input('Введите количество операций: \n'))


def sum_numbers():
    summa = values_dict['summa'][0]
    if values_dict['n'] == 1:
        values_dict['n'] -= 1
        summa = summa / -2
        return summa
    else:
        values_dict['n'] -= 1
        return sum_numbers() / (2, -2)[summa > 0] + (summa, -summa)[summa > 0]

# Мне с математикой очень тяжко. Не знаю где по факту может быть использован этот пример в практике,
# еще меньше представляю где я напутал со знаками и какие именно из них нужно поменять))
# Пытался выполнить все условия, но я слишком долго решал эту задачу, потому меняю знак так грубо.
# Рекурсия работает, число по модулю получается верное.


print(f'Количество элементов: {values_dict["n"]}; результат вычислений: {-sum_numbers()}')
