"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import sys


def flip(number):
    if number < 10:   # базовый случай
        print(number, end='')
        return
    else:
        print(number % 10, end='')
        # шаг рекурсии
        flip(number // 10)


try:
    num = int(input('Введите натуральное число, которое требуется перевернуть '))
except:
    print('Это не число. До свидания!')
    sys.exit()
if num < 1:
    print('Число должно быть натуральным')
else:
    print('Перевернутое число: ', end='')
    flip(num)
