"""
Задание 7.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
"""


def sum_rec(n):
    if n == 0:
        return 0
    else:
        return sum_rec(n - 1) + n


def check(n):
    return sum_rec(n) == (n * (n + 1)) / 2


if __name__ == '__main__':
    print('1+2+...+n = n(n+1)/2 верно') if check(5) else print('1+2+...+n = n(n+1)/2 не верно')
