"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def el_sum(user_num, total=0, counter=0, actual_num=-2.0):
    if user_num == 0:  # базовый случай
        print('Количество элементов: 0, их сумма: 0')
    elif counter == user_num:
        print(f'Количество элементов: {user_num}, их сумма: {total}')
    else:  # шаг рекурсии
        actual_num = (actual_num / -2)
        total += actual_num
        el_sum(user_num, total, counter + 1, actual_num)


el_sum(int(input('Введите количество элементов: ')))
