"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc():
    operation = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if operation == '0':
        return print('Пока')
    if operation in ['+', '-', '*', '/']:
        x = input("Введите первое число: ")
        if x.isdigit():
            x = int(x)
        else:
            print('Вы ввели не число!!!')
            return calc()
        y = input("Введите второе число: ")
        if y.isdigit():
            y = int(y)
        else:
            print('Вы ввели не число!!!')
            return calc()
        if operation == '+':
            print("Ваш результат", x + y)
        if operation == '-':
            print("Ваш результат", x - y)
        if operation == '*':
            print("Ваш результат", x * y)
        if operation == '/':
            if y != 0:
                print("Ваш результат", x / y)
            else:
                print("Деление на ноль")
                return calc()
    else:
        print("Неизвестная операция")
    return calc()


calc()
