"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который
даст рекурсивная ф-ция со значением, полученным в правой части (здесь нужно
просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_nature_nums(n):
    """Рекурсивно вычисляет сумму n-натуральных чисел"""
    # базовый случай - последний элемент
    if n == 1:
        return n
    return n + sum_nature_nums(n - 1)


if __name__ == '__main__':

    test_set = 1, 5, 25, 100, 500

    print("Проверка выполнения для множества натуральных чисел равенства:\n"
          "1+2+...+n = n(n+1)/2, где n - любое натуральное число.")

    for numb_nat in test_set:
        print(f'Сумма {numb_nat}-натуральных чисел:\n'
              f'\t- по формуле: {int(numb_nat * (numb_nat + 1) / 2)}\n'
              f'\t- сложением элементов : {sum_nature_nums(numb_nat)}')
