"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def number_sum(number):
    if number == 0:
        return 0
    else:
        sum = 1 + number_sum(number - 1) / - 2
        return sum


num_of_number = int(input('Enter the number of elements: '))
print(f'Amount of elements: {num_of_number}, their sum: {number_sum(num_of_number)}')
