"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import random
n = round(random() * 100)
attempt = 1
print("Отгадайте число, которое загадал компьютер. У вас 10 попыток")
while attempt <= 10:
    x = int(input(str(attempt) + '-я попытка: '))
    if x > n:
        print('Много')
    elif x < n:
        print('Мало')
    else:
        print(f'Вы угадали с {attempt}-й попытки')
        break
    attempt += 1
else:
    print(f'У вас больше нет попыток. Было загадано число {n}')
