"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint


def game(num, attempts):
    if attempts == 0:
        print('кончились попытки')
        return
    user_num = int(input('Введите число '))
    if num < user_num:
        print('Вы ввели число больше чем загаданное')
        return game(num, attempts - 1)
    elif num > user_num:
        print('Вы ввели число меньше чем загаданное')
        return game(num, attempts - 1)
    else:
        print('Вы угадали!')
        return


game(randint(0, 100), 10)
