"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def reverse_num(numbers, result):
    this_number = numbers % 10

    result = f'{result}{this_number}'

    if len(str(numbers)) > 1:
        next_numbers = numbers // 10
        return reverse_num(next_numbers, result)

    return result


while True:
    try:
        value = int(input('Введите число:\n'))
        break
    except ValueError:
        print('Вы ввели строку, а не число')

print(f'Перевернутое число: {reverse_num(value, "")}')
