"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""

# n = int(input('Введите число: '))



def delimetr(n, numbers=[], num=1):
    if len(numbers) == n:
        return sum(numbers)
    else:
        if len(numbers) % 2:
            numbers.append(num * (-1))
        else:
            numbers.append(num * (1))
        num /= 2
        return delimetr(n, numbers, num=num)


print(delimetr(int(input('Ведите количество чисел: '))))
