"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc():

    operator = input('Введите операцию (+, -, *, / или 0 для выхода):\n>>> ')
    if operator in ('+', '-', '*', '/', "0"):
        if operator == '0':
            print('Работа завершена.')
            return

        while True:
            num_1 = input('Введите первое число:\n>>> ')
            try:
                num_1 = float(num_1)
                break
            except ValueError:
                print('Введено не число, попробуйте снова!')

        while True:
            num_2 = input('Введите второе число:\n>>> ')
            try:
                num_2 = float(num_2)
                break
            except ValueError:
                print('Введено не число, попробуйте снова!')

        if operator == '+':
            print(f'Сумма чисел {num_1} и {num_2} равна {num_1 + num_2}')
        elif operator == '-':
            print(f'Разность чисел {num_1} и {num_2} равна {num_1 - num_2}')
        elif operator == '*':
            print(f'Произведение чисел {num_1} и {num_2} равно {num_1 * num_2}')
        else:
            if num_2 == 0:
                print('Ошибка. Попытка деления на 0. Попробуйте снова.')
            else:
                print(f'Часное чисел {num_1} и {num_2} равно {num_1 / num_2}')

    calc()


calc()
