"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def math_operation(sign, num_1, num_2):

    try:
        if sign == '0':
            return 'Конец'

        if sign == '/':
            return 'Ваш результат : ' + str(num_1 / num_2), \
                   math_operation(input('Введите знак, для прекращения операции введите 0 : '),
                                  int(input('Введите первое число : ')),
                                  int(input('Введите второе число : ')))
        if sign == '*':
            return 'Ваш результат : ' + str(num_1 * num_2), \
                   math_operation(input('Введите знак, для прекращения операции введите 0 : '),
                                  int(input('Введите первое число : ')),
                                  int(input('Введите второе число : ')))
        if sign == '+':
            return 'Ваш результат :' + str(num_1 + num_2), \
                   math_operation(input('Введите знак, для прекращения операции введите 0 : '),
                                  int(input('Введите первое число : ')),
                                  int(input('Введите второе число : ')))
        if sign == '-':
            return 'Ваш результат : ' + str(num_1 - num_2), \
                   math_operation(input('Введите знак, для прекращения операции введите 0 : '),
                                  int(input('Введите первое число : ')),
                                  int(input('Введите второе число : ')))
    except ValueError:
        return 'Вы ошиблись при введении цифры, повторите попытку', \
               math_operation(input('Введите знак, для прекращения операции введите 0 : '),
                              int(input('Введите первое число : ')),
                              int(input('Введите второе число : ')))
    except ZeroDivisionError:
        return 'На ноль делить нельзя', \
               math_operation(input('Введите знак, для прекращения операции введите 0 : '),
                              int(input('Введите первое число : ')),
                              int(input('Введите второе число : ')))


print(math_operation(input('Введите знак, для прекращения операции введите 0 : '),
      int(input('Введите первое число : ')),
      int(input('Введите второе число : '))))
