"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

############################################################################


def calculation():

    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation not in ['+', '-', '*', '/', '0']:
        print('Неверный знак операции.')
        return calculation()

    if operation == '0':  # Базовый случай.
        return f'Выход.'

    try:
        num_1 = float(input('Введите первое число: '))
        num_2 = float(input('Введите второе число: '))
    except ValueError:
        print(f'Вы ввели не число.')
        return calculation()

    if operation == '+':
        print(f'Результат: {num_1 + num_2}')
        return calculation()
    if operation == '-':
        print(f'Результат: {num_1 - num_2}')
        return calculation()
    if operation == '*':
        print(f'Результат: {num_1 * num_2}')
        return calculation()
    if operation == '/':
        try:
            print(f'Результат: {num_1 / num_2}')
            return calculation()
        except ZeroDivisionError:
            print('Деление на ноль не поддерживается.')
            return calculation()


print(calculation())
