"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def row_sum(n, num_start=1.0, total=0):
    if n > 0:
        return row_sum(n - 1, num_start / 2 * -1,  total + num_start)
    else:
        return total


try:
    n_el = int(input('Введите количество элементов: '))
    n_sum = row_sum(n_el)
    print(f'Количество элементов: {n_el}, их сумма: {n_sum}')
except:
    print(f'Ввели не правильное число! Попробуйте еще раз!')
    n_sum = row_sum(n_el)
    print(f'Количество элементов: {n_el}, их сумма: {n_sum}')
