"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def num_recourse_sum(number, counter=0):
    counter += 1
    if counter == number:
        return number
    else:
        return counter + num_recourse_sum(number, counter)


try:
    user_num = int(input('Введите число: '))
    if num_recourse_sum(user_num) == user_num * (user_num + 1) / 2:
        print("Равенство: 1+2+...+n = n(n+1)/2 выполняется для любого n")
    else:
        print("Равенство: 1+2+...+n = n(n+1)/2 не выполняется для любого n")
except ValueError:
    print('Вы ввели строку вместо числа. Введите число')

    