"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def prog_sum(n=int(input('Введите количество элементов:')), num=1, total=0):
    if n:
        total += num
        num = -num/2
        return prog_sum(n-1, num, total)
    else:
        return sum


if __name__ == "__main__":
    print(prog_sum())
