"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Введите число, которое требуется перевернуть: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def rev_numb(numb):
    """ В мое перевёрнутое число, точнее строку добавляется ноль в конец, так и не
    сообразил, как его убрать. Ваш пример я посмотрел и разобрался, но свой вариант
    оставил, как есть, так честнее наверно """
    if numb == 0:
        return str(numb)
    else:
        remainder = numb % 10
        numb = numb // 10
    return str(remainder) + str(rev_numb(numb))

numb = rev_numb(int(input(f'Введите число, которое требуется перевернуть: ')))
print(f'Перевернутое число: {numb}')