"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

# n = int(input('Введите натуральное число: '))
# left = 1
# right = n*(n + 1) / 2
# while n != 1:
#     left += n
#     n -= 1
#
# print(left)
#
# if left == right:
#     print('Равенство!')


def gen_left_recurs(n):
    if n == 1:
        return n
    else:
        return gen_left_recurs(n - 1) + n


number = int(input('Введите натуральное число: '))
right = number * (number + 1) / 2

if gen_left_recurs(number) == right:
    print('Выражения равны!')




