"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import sys


def sum_el(number):
    global num
    if number == num:       # базовый случай
        return (1/(2**(number - 1)))*((-1)**(number - 1))
    return (1/(2**(number - 1)))*((-1)**(number - 1)) + sum_el(number + 1)   # шаг рекурсии


try:
    num = int(input('Введите натуральное число '))
except:
    print('Это не число. До свидания!')
    sys.exit()
if num < 1:
    print('Число должно быть натуральным')
else:
    print(f'Сумма элеметов последовательности: {sum_el(1)}')
