"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


n = int(input('Введите количество элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...: '))


def progress(count_of_numbers):
    if count_of_numbers == 1:
        return 1

    result = 1
    result += (-1) * (progress(count_of_numbers - 1) / 2)
    return result


print(f'Количество элементов : {n}, их сумма : {progress(n)}')
