#!/usr/bin/env python3

"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def process(value: int) -> tuple:
    even, not_even = 0, 0

    if value:
        if (value % 10) % 2:
            not_even += 1
        else:
            even += 1
        result = process(value // 10)
        return even + result[0], not_even + result[1]

    return even, not_even


def main():
    while True:
        try:
            result = process(int(input('Введите число: ')))
        except ValueError:
            pass
        else: break

    print(f'Четные: {result[0]}\nНечетные: {result[1]}')


if __name__ == '__main__':
    main()
