"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


# Возвращает результат в виде числа.
# Без лидиоующего нуля
def reverse_to_number(number, result=0):
    if number > 0:
        return reverse_to_number(number // 10, result * 10 + number % 10)
    return result


# Возвращает результат в виде строки
def reverse_to_string(number):
    if number > 0:
        return str(number % 10) + reverse_to_string(number // 10)
    return ''


user_number = int(input('Введите число: '))
print('Реверс в виде числа (без лидирующих нулей)', reverse_to_number(user_number))
print('Реверс в виде строки', reverse_to_string(user_number))
