"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def my_calc():
    operators = input("Введите операцию (+, -, *, / или 0 для выхода): ")

    if operators == '0':
        print('Завершение программы')
        return

    else:
        if operators in '+-*/':
            while True:
                first_operand = input("Введите первое число\n>>>")
                if first_operand.isdigit():
                    first_operand = float(first_operand)
                    break
                else:
                    print("Вы ввели не число, пожалуйста введите число")
            while True:
                second_operand = input("Введите второе число\n>>>")
                if second_operand.isdigit():
                    second_operand = float(second_operand)
                    break
                else:
                    print("Вы ввели не число, пожалуйста введите число")
            if operators == '+':
                result = first_operand + second_operand
                print(f'Результат операции: {result}')
                return my_calc()
            elif operators == '-':
                result = first_operand - second_operand
                print(f'Результат операции: {result}')
                return my_calc()
            elif operators == '*':
                result = first_operand * second_operand
                print(f'Результат операции: {result}')
                return my_calc()
            elif operators == '/':
                try:
                    result = first_operand / second_operand
                except ZeroDivisionError:
                    print('Нельзя делить на ноль')
                else:
                    print(f'Результат операции: {result}')
                return my_calc()
        else:
            print('Пожалуйста, введите символ из списка.')
            return my_calc()


my_calc()
