"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""

def reverse_num(user_number, reverse_number = ''):
    """
    :param user_number: передаваемое пользователем число
    :param reverse_number: инициализация возвращаемой переменной
    :return: возвращается string чтоб не потерять нули в начале
    """
    reverse_number += str(user_number % 10)
    if user_number < 10:
        return reverse_number
    else:
        return reverse_number + reverse_num(user_number // 10)

try:
    user_number = int(input('Введите число, которое требуется перевернуть: '))
    print(f'Перевернутое число: {reverse_num(user_number)}')
except ValueError as err:
    print(f'Вы ввели не число! {err}')