"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculation():
    actions = '+-*/'
    exit_condition = '0'
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')

    if operation == exit_condition:
        print('Выход из программы')
    elif operation not in actions:
        print('Необходимо ввести одну из операций (+, -, *, / или 0 для выхода)')
        calculation()
    else:
        num1 = input('Введите первое число: ')
        num2 = input('Введите второе число: ')

        try:
            num1 = int(num1)
            num2 = int(num2)
        except ValueError:
            print('Необходимо ввести число!!!')
            calculation()

        if operation == '+':
            rez = int(num1) + int(num2)
            print(f'Результат: {rez}')
            calculation()
        elif operation == '-':
            rez = int(num1) - int(num2)
            print(f'Результат: {rez}')
            calculation()
        elif operation == '*':
            rez = int(num1) * int(num2)
            print(f'Результат: {rez}')
            calculation()
        elif operation == '/':
            try:
                rez = int(num1) / int(num2)
                print(f'Результат: {rez}')
                calculation()
            except ZeroDivisionError:
                print('На 0 делить нельзя')
                calculation()


if __name__ == '__main__':
    calculation()
