"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат,
который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def function_with_a_good_name(number, start_number=-1, sum_of_raw=0):
    """Функция проверяет истиность утверждения, что для множества
    натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
    где n - любое натуральное число."""
    if start_number == -1:
        start_number = number
    if number == 0:
        print(f"Сумма ряда = {sum_of_raw}")
        print(f"{start_number}({start_number}+1)/2 ="
              f" {int(start_number * (start_number+1) / 2)}")
        return
    sum_of_raw += number
    number -= 1
    function_with_a_good_name(number, start_number, sum_of_raw)


function_with_a_good_name(55)
