"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
from random import randint


def guessing(number, attempts):
    if attempts == 0:
        print(f'Выши попытки истекли. Загаданное число {number}')
        return
    while True:
        user_num = input(f'Угадайте число от 0 до 100. Осталось попыток: {attempts}\n>>>')
        try:
            user_num = int(user_num)
            break
        except ValueError:
            print('Нужно ввести число от 0 до 100!')
    if user_num == number:
        print(f'Поздравляем! Вы угадали. Загаданное число {number}')
        return
    if user_num > number:
        print('Число слишком большое.')
    else:
        print('Число слишком маленькое.')
    guessing(number, attempts-1)


guessing(randint(0, 100), 10)
