"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def check_formula(num, i = 1, formula = '', sum_numbers = 1):
    if i == num:
        return formula + f"{num} = {sum_numbers} = {num}({num}+1)/2 = {num * (num+1) / 2}"
    else:
        formula += str(i) + "+"
        i += 1
        sum_numbers += i
        return check_formula(num, i, formula, sum_numbers)

try:
    number = int(input("Введите число:"))
except ValueError:
    print('Вы вместо числа ввели строку (((. Исправьтесь')

print(f"Для {number} проверяем следующее равенство {check_formula(number)} ")