"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

# a = int(input('Введите число: '))
# n = 1
# total = 0
#
# while a != 0:
#     total += n
#     n /= -2
#     a -= 1
# print(total)


def count(repeat, total=0, n=1):
    if repeat == 0:
        return total
    else:
        total += n
        n /= -2
        return count(repeat-1, total, n)


repeat = int(input('Введите число: '))

print(f'Количество элементов: {repeat}, их сумма: {count(repeat)}')
