"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_number_series(input_number):
    return None


number = int(input("Введите количество элементов: \n"))
print(f"Вы ввели: {number}\n")

first = 1
sum_el = 0
for _ in range(number):
    print(first)
    sum_el = sum_el + first
    first = first * -0.5

print(sum_el)
