"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""



def flip_the_number(some_int, some_list=[]):
    if some_int == 0:
        new_int = ''.join(some_list)
        return new_int
    list_el = str(some_int % 10)
    some_list.append(list_el)
    some_int = some_int // 10
    return flip_the_number(some_int)

if __name__ == '__main__':
    user_int = input('Введите число: ')
    try:
        user_int = int(user_int)
    except Exception:
        print('Вы ввели не число, а строку! Исправьтесь.')

    print(flip_the_number(user_int))

