"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

from random import randint

START_NUMBER = 0
END_NUMBER = 100
COUNTER = 10

def guess_number(number, i=0):
    user_answer = int(input('Введите число: '))
    if i == COUNTER - 1:
        return 'Вы проиграли!'
    elif user_answer == number:
        return f'Вы угадали затратив {i} попыток'
    else:

        if user_answer > number:
            print(f'Вы ввели слишком большое число. Осталось попыток: {COUNTER - i - 1}')
            return guess_number(number, i + 1)
        else:
            print(f'Вы ввели слишком маленькое число. Осталось попыток: {COUNTER - i - 1}')
            return guess_number(number, i + 1)


print(guess_number(randint(START_NUMBER, END_NUMBER)))