"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc_recurs():
    val = str(input('Введите операцию (+, -, *, / или 0 для выхода): '))

    if val == '0':
        return f'Заканчиваем работу.'
    elif val != '+' and val != '-' and val != '*' and val != '/' and val != 0:
        print('Введено неправильное значение! Используйте +, -, *, / или 0 для выхода')
        return calc_recurs()
    try:
        first_n = int(input('Введите первое число: '))
    except ValueError:
        print('Необходимо ввести число')
    try:
        sec_n = int(input('Введите второе число: '))
    except ValueError:
        print('Необходимо ввести число')

    if val == '+':
        print(first_n + sec_n)
        return calc_recurs()
    elif val == '-':
        print(first_n - sec_n)
        return calc_recurs()
    elif val == '*':
        print(first_n * sec_n)
        return calc_recurs()
    elif val == '/':
        try:
            print(first_n / sec_n)
        except ZeroDivisionError:
            print('Ошибка! Деление на ноль невозможно!')
        return calc_recurs()


calc_recurs()
