"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def change_num(num, change=''):
    """Функция формирует обратную последовательность введеного числа"""

    if num == 0:
        return change
    else:
        change += str(num % 10)
        return change_num(num // 10, change)


# ---------------------------- main --------------------------
while True:
    print('-' * 50, '\nДля выхода введите => 0')
    number = input('Введите натуральное число: ')

    if number == '0':
        print('Выход')
        break

    try:
        number = int(number)
    except ValueError:
        print('Не введено натуральное число!!!')
        continue

    print(f'Перевертыш: {change_num(number)}')
