"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

number = 1
summ_number = 0

def get_sum_number(number):
    # базовый случай!!!
    global summ_number, count
    if count == 0:
        return summ_number
    else:
        # шаг рекурсии
        count = count - 1
        summ_number += number
        return get_sum_number(number/(-2))

count = int(input('Введите количество элементов: '))
print(get_sum_number(number))