"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


# Проверка на корректность вводимого оператора
def valid_operator(operator):
    if operator not in '+,-,*,/,0' or operator == '':
        print(f'Неизвестный оператор {operator}')
        operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
        valid_operator(operator)
    else:
        return operator


# Валидация на числа
def valid_number(number):
    try:
        number = float(number)
    except ValueError:
        print(f'ValueError Вы ввели не число {number}')
        number = valid_number(input('Введите корректное число: '))
    return number


# Функция для более красивого вывода int или float чисел
def int_float(numb):
    int_numb = int(numb)
    if int_numb == numb:
        return int_numb
    else:
        return round(numb, 4)


def calk(operator, numb_1=0, numb_2=0):
    if operator == '+':
        print(int_float(numb_1 + numb_2))
    elif operator == '-':
        print(int_float(numb_1 - numb_2))
    elif operator == '*':
        print(int_float(numb_1 * numb_2))
    elif operator == '/':
        try:
            print(int_float(numb_1 / numb_2))
        except ZeroDivisionError:
            print('Ошибка деление на 0')

    operator = valid_operator(input('Введите операцию (+, -, *, / или 0 для выхода) : '))
    if operator == '0':
        return
    numb_1 = valid_number(input('Введите первое число: '))
    numb_2 = valid_number(input('Введите второе число: '))

    calk(operator, numb_1, numb_2)


calk('+')
