"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

from random import randint


def guess_num(i, num):
    
    print('Попытка - ', i)
    number_user = int(input('Введите цифру от 0 до 120: '))
    if number_user == num:
        print('Вы угадали цифру -', num)
    elif i == 10:
        print('Попытки кончились, вы проиграли =(')
        print('Загаданная цифра -', num)
    else:
        if number_user > num:
            print('Загаданная цифра <', number_user)
        else:
            print('Загаданная цифра >', number_user)
        guess_num(i + 1, num)


guess_num(1, randint(0, 120))
