"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def game(num=10, rid_num=0):
    if num == 0:
        return f'Ваши попытки закончились!( Загаданное число {rid_num}.'
    if num == 10:
        print('Загаданное число находится в пределах от 1 до 100.\n'
              f'У вас есть {num} попыток, чтобы угадать его.')
        rid_num = random.randint(1,101)
    user_num = int(input("Введите число: "))
    if user_num > rid_num:
        print('Загаданное число меньше.')
    elif rid_num > user_num:
        print('Загаданное число больше.')
    else:
        return f'Вы победили! Загаданное число {user_num}.'
    return game(num-1, rid_num)


print(game())
