"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def recursive_sum(n, num=-2.0):
    num = num / -2
    n -= 1
    if n <= 0:
        return num
    else:
        return num + recursive_sum(n, num)


try:
    number = int(input('Введите кол-во элементов: '))
    print(f'Кол-во элементов равно: {number}, их сумма равна: {recursive_sum(number)}')
except ValueError:
    print('Вы ввели строку вместо числа. Введите число!')

