"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


import random


def guesser(attempt, guessed_number):
    print(f"Попытка {attempt} из 10")
    answer = int(input("Загадано число от 0 до 100, предположите, какое: "))
    if answer == guessed_number or attempt == 10:
        if answer == guessed_number:
            print("Угадали")
        print(f"Загаданное число {guessed_number}")
    else:
        if answer < guessed_number:
            print(f"Введите большее число")
        else:
            print(f"Введите меньшее число")
        guesser(attempt + 1, guessed_number)


guesser(1, random.randint(0, 100))
