"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_n(n, i=0, el=1, s=0):
    s += el
    el += 1
    i += 1
    if n == 1:
        return f'Для n = {i} \nсумма элементов от 1 до {i} = {i}({i}+1)/2 \nили {s} = {i*(i + 1) / 2:.0f}'
    return sum_n(n-1, i, el, s)


print(sum_n(int(input('Введите количество элементов: '))))
