"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


# можно задать все, плоть до первого члена и знаменателя прогресии

def sum_of_geom_pr(n=1, a=1.0, s=-0.5, my_sum=1.0):
    if n == 1:
        print(f'Искомая сумма: {my_sum}')
        return
    else:
        sum_of_geom_pr(n - 1, a=a * s, my_sum=my_sum + a * s)


if __name__ == '__main__':
    sum_of_geom_pr(3)
