"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_n(n, count=0, sum_from=1, total=0):
    if count == n:
        return print(f"Количество элементов: {n}, их сумма: {total}")
    sum_n(n, count + 1, sum_from / 2 * -1, total + sum_from)


sum_n(int(input("Введите количество элементов: ")))
