"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
from random import randint


def guess_the_number(tries=10, rand_num=str(randint(1, 100))):
    user_num = input('Угадайте целое число от 0 до 100: ')
    if tries <= 1:
        return f'Поражение, загаданное число: {rand_num}'
    elif user_num == rand_num:
        return f'Победа, загаданное число: {rand_num}'
    elif rand_num < user_num:
        print('Ваше число больше загаданного')
        return guess_the_number(tries - 1, rand_num)
    elif user_num < rand_num:
        print('Ваше число меньше загаданного')
        return guess_the_number(tries - 1, rand_num)


print(guess_the_number())
