"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

check_value = int(input('Введите значение, для которого будем проверять формулу: '))


def our_sum(n):
    if n == 1:
        return 1
    return our_sum(n - 1)


def comparison(n):
    return print('Для введенного значения написанная выше формула верна') if our_sum(n) == n * (n + 1) / 2 else print(
        'Для введенного значения написанная выше формула верна')


comparison(check_value)
