"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2
Подсказка:
В ф-цию принимаются два элемент - это левая и правая части
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def sum_of_arithm_progr(number):
    if number == 1:
        return 1
    return number + sum_of_arithm_progr(number - 1)

number = 25
left = sum_of_arithm_progr(number)
right = number * (number + 1) / 2
print(left == right)