"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random

def recursion(i, num):
    print(f'Попытка №{i}')
    user_answer = int(input('Ввидите число от 0 до 100: '))
    if i ==10 or user_answer == num:
        if user_answer == num:
            print('Вы угадали!')
        print(f'Задуманное число: {num}')
    else:
        if user_answer > num:
            print('Задуманное число меньше вашего')
        else:
            print('Задуманное число больше вашего')
        recursion(i + 1, num)

recursion(1, random.randint(0, 100))