"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elements(n, lst=[1.], counter=2):

    n -= 1

    if n == 0:
        # print(lst)
        return sum(lst)
    else:
        if counter % 2 != 0:
            lst.append((lst[-1] / 2))
        else:
            lst.append((lst[-1] / 2) * (-1))

        return sum_elements(n, lst)


a = int(input('Введите натуральное число ,больше "0": '))  # Проверки на валидность введеных значений не выполняю
print(f'Количество элементов: {a}, их сумма: {sum_elements(a)}')
