"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
# создал список со знаками для условия из строки 39
SIGN_LST = ['+', '-', '*', '/']


def calc():
    sign = input('Введите операцию (+, -, *, / или O для выхода): ')
    if sign == '0':
        return print('Завершение программы')
    if sign not in SIGN_LST:
        return print('Вы ввели неверный знак, введите (+, -, *, / или 0 для выхода)'), calc()
    try:
        numb1 = int(input('Введите первое число: '))
        numb2 = int(input('Введите второе число: '))
        if sign == '+':
            return print(f'Ваш результат - {numb1 + numb2}'), calc()
        elif sign == '-':
            print(f'Ваш результат - {numb1 - numb2}')
        elif sign == '*':
            print(f'Ваш результат - {numb1 * numb2}')
        elif sign == '/':
            if numb2:
                print(f'Ваш результат - {numb1 / numb2}')
            else:
                print('На 0 делить нельзя!')
            calc()
    except ValueError:
        return print(f'Вы ввели не целое число! Повторите попытку'), calc()


calc()
