"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from logging import getLogger, basicConfig


def calc_recursion() -> None:
    """
    Рекурсивная функция калькулятор
    :return: None
    """
    available_operations = ('+', '-', '*', '/')
    operation = input("Введите знак операции (+, -, *, / или 0 для выхода): ")
    if operation == '0':
        print("Всего доброго! До свидания!")
        return
    elif operation in available_operations:
        try:
            op1 = float(input("Введите первый операнд: "))
            op2 = float(input("Введите второй операнд: "))

            if operation == '+':
                print(f"{op1} + {op2} = {op1 + op2}")
            elif operation == '-':
                print(f"{op1} - {op2} = {op1 - op2}")
            elif operation == '*':
                print(f"{op1} * {op2} = {op1 * op2}")
            else:
                print(f"{op1} / {op2} = {op1 / op2}")
        except ZeroDivisionError as ex:
            print("На ноль делить нельзя! Давайте попробуем ещё раз.")
            logger.error(ex.args)
        except ValueError as ex:
            print("Похоже вы ввели не число. Повторите ввод!")
            logger.error(ex.args)
    else:
        print(f"Я не знаю операцию {operation}. Используйте только знакомые мне операции, пожалуйста!")

    calc_recursion()


if __name__ == '__main__':
    logger = getLogger('task_1')
    FORMAT = '%(asctime)-15s %(message)s'
    basicConfig(filename='task_1.log', filemode='w', format=FORMAT)

    calc_recursion()
