"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    try:
        oper = input('Введите операцию (+, -, *, / или 0 для выхода): ')
        if oper not in '+-*/0':
            raise ValueError("Несоответствующее значение операции. Введите одну из операций +, -, *, /, 0.")
    except ValueError as err:
        print(err)
        return calculator()
    else:
        if oper == '0':
            return print('Программа завершена')
        number_1 = int(input('Введите первое число: '))
        number_2 = int(input('Введите второе число: '))
        if oper == '+':
            result = number_1 + number_2
        elif oper == '-':
            result = number_1 - number_2
        elif oper == '*':
            result = number_1 * number_2
        elif oper == '/':
            if number_2 == 0:
                while not number_2:
                    number_2 = int(input('Нельзя делить на ноль, выберете другое число: '))
                result = number_1 / number_2
            else:
                result = number_1 / number_2
        print(f'Ваш результат: {result}')
        return calculator()


calculator()
