"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""
<<<<<<< 9cc3dfed95c8b84cd33355135898a9760fe23a70
=======


def sum_(n):
    def sum_n(el, num=1):
        if el <= 0:
            return 0
        else:
            return num + sum_n(el - 1, -num / 2)
    print(f'The quantity of elements: {n}, the amount of elements: {sum_n(n)}')


sum_(int(input('Please enter the number of elements: ')))
>>>>>>> Task 4 completed
