"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_line(n, result=0, count=0):
    if n == count:
        return print(result)
    else:
        result = (result + 1 / 2 ** count) if count % 2 == 0 else (result - 1 / 2 ** count)
        count += 1
    return sum_line(n, result, count)


sum_line(int(input('Введите натуральное число: ')))
