"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def cnt(num, even_=0, odd_=0):
    """Функция подсчитывает каоличество четных и нечетных цифр в числе"""
    if num % 2:
        odd_ += 1
    else:
        even_ += 1
    return (even_, odd_) if num < 10 else cnt(num // 10, even_, odd_)


user_num = int(input('Enter number: '))
even, odd = cnt(user_num)
print(f'В числе {user_num}\nчетных цифр: {even}\nнечетных цифр: {odd}')
