"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint
def ugad(counter):
    chislo = random.randint(1,100)
    print("Для проверки: " + chislo)
    if counter==0:
        print("Вы проиграли")
    else:
        popitka = int(input("Введите число"))
        if popitka==chislo:
            print("Вы победили!")
        elif popitka>chislo:
            return counter-1
            print("Загаданное число меньше")
        elif popitka<chislo:
            return counter-1
            print("Загаданное число больше")

ugad(10)