"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def calc():
    correct = False
    digit1 = 0
    digit2 = 0
    while correct == False:
        operation=input('Введите операцию (+, -, *, / или 0 для выхода): ')
        if operation == "0":
            break
        if operation not in '+-*/0':
            print('Неверный ввод операции')
        else:
            while True:
                try:
                    digit1 = int(input('Введите первое число: '))
                    digit2 = int(input('Введите второе число: '))
                    if digit2 == 0 and operation == '/':
                        print('При деление знаменатель должен быть больше 0. Повторите ввод')
                        correct_del_0 = False
                        while correct_del_0 == False:
                            digit2 = int(input('Введите второе число: '))
                            if digit2 == 0:
                                print('При деление знаменатель должен быть больше 0. Повторите ввод')
                            else:
                                correct_del_0 = True
                    break
                except  ValueError:
                    print('Неверный формат чисел')
            correct = True

    if operation == "+":
        print(f'{digit1}+{digit2}={digit1 + digit2}')
        return calc()
    elif operation == "-":
        print(f'{digit1}-{digit2}={digit1 - digit2}')
        return calc()
    elif operation == "*":
        print(f'{digit1}*{digit2}={digit1 * digit2}')
        return calc()
    elif operation == "/":
        print(f'{digit1}/{digit2}={digit1 / digit2}')
        return calc()
    return


calc()
