"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""

def sum_numbers(num_elements=int(input('Введите количество элементов:')),
                sum_elem=0,
                num_iter=0):
    if num_iter == num_elements:
        print('Количество элементов:', num_elements, 'их сумма:', sum_elem)
        return sum_elem
    else:
        sum_elem += 1/(2**(num_iter)) * (-1)**num_iter
        num_iter += 1
        return sum_numbers(num_elements, sum_elem, num_iter)

sum_numbers()