"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

def number_check(_num, digit_1=0, digit_2=0):
    if _num == 0:
        return print(f'The quantity of even and odd digit in number is equally : ({digit_1}, {digit_2})')
    else:
        num = _num % 10
        _num = _num // 10
        if num % 2 == 0:
            digit_1 += 1
        else:
            digit_2 += 1
        return number_check(_num, digit_1, digit_2)


my_num = int(input('Please enter a number: '))
number_check(my_num)