"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def summ(n=-1, s=0, number=1, start=0):
    if n == -1:
        try:
            n = int(input('Введите количество элементов: '))
        except ValueError:
            print("Давай без шуток")
            return summ()
        start = n
    elif n == 0:
        return f'Количество элементов: {start}, их сумма: {s}'

    return summ(n - 1, s + number, number * (-0.5), start)


print(summ())


def summ1(n, r=1, s=0): return summ1(n - 1, r * (-0.5), s + r) if n != 0 else print(s)


summ1(3)
