"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum(num):

    if num == 1:
        return num
    else:
        return get_sum(num - 1) + num


try:
    user_num = int(input("Введите число: "))
    if get_sum(user_num) == user_num * (user_num + 1) / 2:
        print(f"Равенство 1+2+...+n = n(n+1)/2 для числа {user_num} верно")
except ValueError:
    print("Это не число. Попробуйте еще раз")
