"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
import random


def guess(num, min=0, max=100, attempts=10):
    n = int(input(f'Угадайте число от {min} до {max}, осталось {attempts} попыток: '))
    if attempts == 0:
        return f"Вы проиграли. Ответ: {num}"
    else:
        if n == num:
            return f"Вы выиграли"
        elif num < n:
            if n > max:
                max = max
            else:
                max = n
            guess(num, min, max, attempts - 1)
        elif num > n:
            if n < min:
                min = min
            else:
                min = n
            guess(num, min, max, attempts - 1)


num = random.choice(range(0, 100))
print(guess(num))



