"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


number = list(str(input('Введите число - ')))
rebmun = []


def revers():
    if len(number) == 0:
        print(f'Перевернутое число - {"".join(rebmun)}')
    else:
        rebmun.append(number.pop())
        return revers()


revers()


# def revers_number(numb):
#     rest_numb, numeral = divmod(numb, 10)
#     if rest_numb == 0:
#         return str(numeral)
#     else:
#         return str(numeral) + str(revers_number(rest_numb))
#
#
# number = int(input("Введите число, которое требуется перевернуть: "))
# print(f'Перевернутое число: {revers_number(number)}')
