"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint


def guess_number(num, count):
    if count == 0:
        return 'Попытки закончились. Game over'
    assumption = int(input('Введите число: '))
    if assumption == num:
        return 'Вы угадали!'
    else:
        print('Ваше число {}'.format('больше' if assumption > num else 'меньше'))
        return guess_number(num, count-1)


print(guess_number(randint(1, 100), 10))
