"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""


def sum_series(n):
    try:
        n = int(n)
        if n < 0:
            return 'Ошибка ввода данных. Вы ввели отрицательное число.'
        elif n == 0:
            return 0
        elif n == 1:
            return 1
        else:
            return sum_series(n - 1) + 1 / ((-2) ** (n - 1))
    except ValueError:
        return 'Ошибка ввода данных. Введено не целое число'


if __name__ == '__main__':
    print(sum_series(input('Введите количество элементов (целое положительное число): ')))
