"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_of_sequence(num: int) -> int:
    if num == 0:
        return num
    else:
        return num + sum_of_sequence(num-1)


if __name__ == '__main__':
    try:
        num = int(input("Введите количество элементов последовательности (натуральное число): "))
        sum1 = sum_of_sequence(num)
        sum2 = int(num * (num + 1) / 2)
        print(f"Raw sum of numbers is {sum1}")
        print(f"The Sum of the sequence according to the formula is {sum2}")
        print("The formula is correct!" if sum1 == sum2 else "The formula is wrong!")
    except ValueError as ex:
        print("I need a number!")
