"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def my_func():
    symbols = ['+', '-', '*', '/', '0']
    symbol = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if symbol in symbols:
        if symbol == '0':
            return print('Выход осуществлен!')


        try:
            first_int = int(input('Введите первое число: '))
        except Exception:
            print('Вы ввели строку вместо числа! Исправьтесь.')
            my_func()

        try:
            second_int = int(input('Введите второе число: '))
        except Exception:
            print('Вы ввели строку вместо числа! Исправьтесь.')
            my_func()

        if symbol == '+':
            print(f'Результат равен: {first_int + second_int}')
        elif symbol == '-':
            print(f'Результат равен: {first_int - second_int}')
        elif symbol == '*':
            print(f'Результат равен: {first_int * second_int}')
        elif symbol == '/':
            try:
                print(f'Результат равен: {first_int / second_int}')
            except ZeroDivisionError:
                print('На ноль делить нельзя!')
        return my_func()
    else:
        print('Такая операция не допустима, выберите из предложенных!')
        return my_func()

if __name__ == '__main__':
    my_func()