"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def proof_of_equality(n, sum=0, formul=0):
    if formul == 0:
        formul = n * (n+1) // 2
    if n == 1:
        sum += 1
        print(f'1 + 2 + ... + n = n(n+1)/2\n'
              f'{sum} - {formul}')
        return sum == formul
    sum += n
    return proof_of_equality(n - 1, sum, formul)


print(proof_of_equality(6))
