"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_of_series(n):
    """Функция вычисляет сумму первых n элементов ряда 1, -0.5, 0.25, -0.125, ..."""
    if n == 1:
        return 1
    return 1 + sum_of_series(n - 1) * -.5


num = int(input("Введите количество элементов ряда для сложения: "))
print(sum_of_series(num))
