"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    action = input('Введите операцию (+, -, *, / или 0 для выхода)')
    if action == '0':
        print('Всего доброго')
        return None
    else:
        if action in '+-*/':
            try:
                first_num = int(input('Введите первое число'))
                second_num = int(input('Введите второе число'))

                if action == '+':
                    result = first_num + second_num
                    print(f'Ваш результат {result}')
                    return calculator()
                elif action == '-':
                    result = first_num - second_num
                    print(f'Ваш результат {result}')
                    return calculator()
                elif action == '*':
                    result = first_num * second_num
                    print(f'Ваш результат {result}')
                    return calculator()
                elif action == '/':
                    try:
                        result = first_num / second_num
                    except ZeroDivisionError:
                        print('Делить на нуль нельзя')
                    else:
                        print(f'Ваш результат {result}')
                    finally:
                        return calculator()
            except ValueError:
                print(f'Вместо числа вы ввели строку. Повторите запрос.')
                return calculator()
        else:
            print('Вы ввели не тот символ оператора')
            return calculator()


if __name__ == '__main__':
    calculator()
