"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def summ_row(n: int, count=0, num=1.0, summ=0.0):
    if count == n:
        print(f'Количество элементов: {n}, их сумма: {summ}')
    else:
        return summ_row(n, count + 1, -num/2, summ + num)

summ_row(int(input('Введите количество элементов: ')))