"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


import random
dig = random.randint(0, 100)
print('Я загадал число от 0 до 100, угадай за 10 попыток:')

def puzzle(num, tries=10):
    try:
        user_num = int(input(f'Осталось попыток: {tries}, введите число: '))
    except:
        puzzle(num, tries)

    if user_num == num:
        return print('Поздравляю, получилось!')
    else:
        tries -= 1
        if tries < 0:
            return print(f'Попытки кончились, загаданное число: {num}')
        if user_num > num:
            print('Слишком много!')
        if user_num < num:
            print('Слишком мало!')
        return puzzle(num, tries)


puzzle(dig)