"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_reversed_str_from_int(num: int):
    if num < 10:
        return str(num)

    last = num % 10
    num = num // 10

    return str(last) + get_reversed_str_from_int(num)


if __name__ == '__main__':
    is_complete = False

    while not is_complete:
        try:
            user_num = int(input('Ведите строку чисел для реверса: '))
            print(get_reversed_str_from_int(user_num))
            is_complete = True

        except ValueError:
            print('Вы ввели строку (((. Исправьтесь')
