"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    operators = ('+', '-', '*', '/', '0')
    oper = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if oper in operators:
        if oper == '0':
            return 0
        try:
            first_num = float(input('Введите первое число: '))
            second_num = float(input('Введите второе число: '))
            result = 'Вычислений не произведено'
            if oper == '+':
                result = first_num + second_num
            elif oper == '-':
                result = first_num - second_num
            elif oper == '*':
                result = first_num * second_num
            elif oper == '/':
                result = first_num / second_num
        except ValueError:
            print('Вы ввели не число, попробуйте еще раз')
            return calculator()
        except ZeroDivisionError:
            print('Делить на ноль нельзя, попробуйте еще раз')
            return calculator()

        print(f'Ваш результат: {result}')
        return calculator()
    else:
        print('Введена неверная операция, попробуйте еще раз')
        return calculator()


calculator()
