"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def row_el(n):
    return 1 if n == 1 else row_el(n-1) * -0.5

"""
Рекурсию для члена ряда привел. Запихнуть суммирование в рекурсию не смог.
А вообще, это геометрическая прогрессия. Для подсчета суммы не нужны ни
рекурсия, ни иттерация.Считается простейшей формулой.
"""