"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_el(usr_num, nums_sum=0, counter=0, cur_num=-2.0):
    if usr_num == 0:
        print('Количество элементов: 0, их сумма: 0')
    elif counter == usr_num:
        print(f'Количество элементов: {usr_num}, их сумма: {nums_sum}')
    else:
        cur_num = (cur_num / -2)
        nums_sum += cur_num
        sum_el(usr_num, nums_sum, counter + 1, cur_num)


sum_el(int(input('Введите количество элементов:')))
