"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

from random import randrange


def func1(rand, n=10):
    rand = rand
    while True:
        try:
            guess = int(input(f"Отгадайте число, у вас осталось {n} попыток: "))
            break
        except ValueError:
            print("Вы ввели не число")
    if guess != rand:
        print(rand)
        n -= 1
        return func1(rand, n)
    else:
        return "Вы отгадали число"

print(func1(randrange(0, 100)))