"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_func(n) -> int:
    return int(n * (n + 1) / 2)


def recur_func(n) -> int:
    return 1 if n == 1 else n + recur_func(n - 1)


if __name__ == '__main__':
    print('RECURSION  FORMULA')
    print('-' * 10, '-' * 10)
    for i in range(1, 6):
        print(f'{recur_func(i):^10d} {check_func(i):^10d}')

'''
RECURSION  FORMULA
---------- ----------
    1          1     
    3          3     
    6          6     
    10         10    
    15         15 
'''
