"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    operation = input('Введите опрерацию(+, -, *, /, 0 - для выхода): ')
    if operation == '0':
        return 'Операция завершена'
    else:
        if operation == '+' or operation == '-' or operation == '*' or operation == '/':
            try:
                fst_num = int(input('Введите первое число: '))
                snd_num = int(input('Введите второе число: '))

                if operation == '+':
                    print(f'Результат суммы: {fst_num + snd_num}')
                    return calculator()

                elif operation == '-':
                    print(f'Результат разности: {fst_num - snd_num}')
                    return calculator()

                elif operation == '*':
                    print(f'Результат произведения: {fst_num * snd_num}')
                    return calculator()

                elif operation == '/':
                   try:
                       print(f'Результат частного: {fst_num / snd_num}')
                   except ZeroDivisionError:
                       print("Попытка произвести деление на ноль! На ноль делить нельзя!")
                   finally:
                       return calculator()

            except ValueError:
                print('Введена строка. Введите число!')
                return calculator()

        else:
            print('Введён не верный символ, попробуйте ещё раз')
            return calculator()


calculator()

