"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check(num_in, rev_num=''):
    if num_in > 0:
        # используем то, что выход из стека уже отдает с конца.
        rev_num = rev_num + str(num_in % 10)
        check(num_in // 10, rev_num)
    else:
        print(f'Перевернутое число: {rev_num}')


def main(att=3):
    try:
        x = int(input('Введите число, которое требуется перевернуть: '))
        check(x)
    except:
        att -= 1
        print(f'Вы точно ввели число? Попробуйте еще раз... (Попыток осталось: {att}) ')
        main(att)


main(3)
