"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def progression_sum(repeat_number, seq_start=1, seq_sum=0):
    if repeat_number > 0:
        repeat_number -= 1
        seq_sum += seq_start + progression_sum(repeat_number, seq_start / -2, seq_sum)
    return seq_sum


print(progression_sum(3, 2))
