"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_of_elems(i, n, sum_of_numbs, el):
    if i == n:      # выходим, если счётчик достиг введёного количества элементов для суммы
        print(f"Количество элементов: {n}, их сумма: {sum_of_numbs}")
    elif i < n:
        return sum_of_elems(i + 1, n, sum_of_numbs+el, el /2 * -1)


n = int(input("Введите количество элементов: "))
sum_of_elems(0, n, 0, 1)