"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def elem_sum():
    n = int(input('Введите количество элементов: '))
    sum_elms = 0
    el = 1
    count = 0
    while count != n - 1:
        el = -(el / 2)
        sum_elms = sum_elms + el
        count += 1
    print(sum_elms + 1)


def elem_sum_recurs(n, sum_elms=0.0, count=0, el=1.0):
    if count == n - 1:
        print(sum_elms + 1)
    else:
        el = -(el / 2)
        sum_elms = sum_elms + el
        count += 1
        return elem_sum_recurs(n, sum_elms, count, el)


# elem_sum()
elem_sum_recurs(int(input('Введите количество элементов: ')))

