"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def recurs_calc():

    operand = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    """Рекурсия"""
    if operand == '0':  # базовый случай
        print('Завершение работы')
        return
    elif operand == '-' or operand == '+' or operand == '*' or operand == '/':
        try:
            number_1 = int(input('Введите первое число: '))
            if not isinstance(number_1, int):
                print('Вы ввели не число')
                return recurs_calc()
            number_2 = int(input('Введите второе число: '))
            if not isinstance(number_2, int):
                print('Вы ввели не число')
                return recurs_calc()
        except ValueError:
            print('Вы ввели не число')
            return recurs_calc()
        if operand == '/' and number_2 == 0:
            print('На 0 делить нельзя')
            return recurs_calc()
        elif operand == '+':
            result = number_1 + number_2
            print(result)
            return recurs_calc()
        elif operand == '-':
            result = number_1 - number_2
            print(result)
            return recurs_calc()
        elif operand == '*':
            result = number_1 * number_2
            print(result)
            return recurs_calc()
        elif operand == '/':
            result = number_1 / number_2
            print(result)
            return recurs_calc()
        else:
            return recurs_calc()
    else:
        print('Введен не правильный оператор')
        return recurs_calc()


recurs_calc()
