"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def numbers_sum(i, number, count, final_sum):

    if i == count:

        print(f"Кол-во элементов - {count}, а их сумма - {final_sum}")

    elif i < count:

        return numbers_sum(i + 1, number / 2 * -1, count, final_sum + number)


try:

    user_count = int(input("Введите нужное кол-во элементов: "))
    numbers_sum(0, 1, user_count, 0)

except ValueError:

    print("Вы ввыели вместо числа строку. Исправляйтесь!!!")
