"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_rec(n):
    if n == 0:
        return 0
    else:
        return sum_rec(n - 1) + n


def check(n):
    return sum_rec(n) == (n * (n + 1)) / 2


if __name__ == '__main__':
    print('1+2+...+n = n(n+1)/2 верно') if check(5) else print('1+2+...+n = n(n+1)/2 не верно')
