"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_num(num):
    if num.isdigit():
        return int(num)
    else:
        try:
            return float(num)
        except ValueError:
            print('Вы вместо числа ввели строку')
            return check_num(input('Введите число повторно: '))


def calc():
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation == '0':
        return

    f_num = check_num(input('Введите первое число: '))
    l_num = check_num(input('Введите второе число: '))

    if operation == '+':
        return print(f_num + l_num)
    elif operation == '-':
        return print(f_num - l_num)
    elif operation == '*':
        return print(f_num * l_num)
    elif operation == '/':
        if l_num == 0:
            print('Деление на ноль')
            l_num = check_num(input('Введите второе число: '))
        else:
            return print(f_num / l_num)


calc()
