"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
#1 Решение
n = int(input("Введите число: "))
def l_side(m=1, k=0):
    if m > n:
        return k
    else:
        k += m
        m += 1
        return l_side(m,k)

if l_side() == n * (n+1)/2:
    print(f"Равенство 1+2+...+{n} = {n}({n}+1)/2 верное")

#2 Решение
def get_sum_of_set(base):
    return base if base == 1 else base + get_sum_of_set(base - 1)

n = 3
print(f'Is 1+2+...+{n} = {n}({n}+1)/2? \nAnswer: '
      f'{get_sum_of_set(n) == n * (n + 1) / 2} (Sum = {get_sum_of_set(n)})')