"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def verife_operand (char_operand):
    if char_operand == 43 or char_operand == 45 or char_operand == 42 or char_operand == 47 or char_operand == 48:
        print(char_operand, chr(char_operand))
        return 1
    else:
        return 0


if __name__ == '__main__':
      # 43 +
      # 45 -
      # 42 *
      # 47 /
      # 48 0
    while True:
        operand = input (f'Введите операцию (+, -, *, / или 0 для выхода): ')
        if ord (operand) == 48:
            break
        number_one = input (f'Введите первое 3-значное число : ')
        number_two = input (f'Введите второе 3-значное число : ')
        if not number_one.isdigit() or not number_two.isdigit():
            print (f'Вы вместо трехзначного числа ввели строку (((. Исправьтесь')
            continue
        elif int(number_one) < 1000 or int(number_two) < 1000:
            if ord(operand) == 43:
                print (f'Ваш результат: ', int(number_one) + int(number_two))
            elif ord(operand) == 45:
                print (f'Ваш результат: ', int(number_one) - int(number_two))
            elif ord(operand) == 42:
                print (f'Ваш результат: ', int(number_one) * int(number_two))
            elif ord(operand) == 47:
                print (f'Ваш результат: ', int(number_one) / int(number_two))
            else:
                print (f'Вы ввели не операцию и не выход')
                continue
        else:
            print (f'Вы вместо трехзначного числа ввели больше')
            continue
    print (f'Выход')


