"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc():
    operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operator == '0':
        print('Good bye!')
    elif operator == '*' or operator == '+' or operator == '-' or operator == '/':
        try:
            num1 = int(input('Введите первое число: '))
            if not isinstance(num1, int):
                return calc()
            num2 = int(input('Введите второе число: '))
            if not isinstance(num2, int):
                return calc()
        except ValueError:
            print('Вы ввели строку!')
            return calc()
        if operator == '/' and num2 == 0:
            print('Деление на 0 невозможно!')
            return calc()
        elif operator == '+':
            result = num1 + num2
            print(result)
            return calc()
        elif operator == '-':
            result = num1 - num2
            print(result)
            return calc()
        elif operator == '*':
            result = num1 * num2
            print(result)
            return calc()
        elif operator == '/':
            result = num1 / num2
            print(result)
            return calc()
        else:
            return calc()
    else:
        print('Неправильный оператор!')
        return calc()


calc()
