"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    # предлагаем ввести доступные символы
    action = input("Введите +, -, *, / или q для выхода\n")

    if action.lower() == 'q':
        # если введена буква q, то выход из функции если ввели
        # прописную букву Q, то она приводится к нижнему регистру
        exit()

    if action in '+-*/':
        # если введенный символ есть в строке, то выполняем скрипт
        try:
            number_1 = int(input("Введите первое число\n"))  # запрос ввода 1-го чосла
            number_2 = int(input("Введите второе число\n"))  # и 2-го числа

            if action == '+':
                result = number_1 + number_2
                print(f"Сумма ваших чисел {result}")
                return calculator()
            elif action == '-':
                result = number_1 - number_2
                print(f"Разность ваших чисел {result}")
                return calculator()
            elif action == '*':
                result = number_1 * number_2
                print(f"Произведение ваших чисел {result}")
                return calculator()
            elif action == '/':
                try:
                    result = number_1 / number_2
                    print(f"Частное от вашего деления {result}")
                except ZeroDivisionError:  # проверка деления на 0
                    print("На ноль делить нельзя")
                    return calculator()
        except ValueError:
            # если были введены не числа или хотя бы не 1 число, то обрабатываем исключение
            print("Ошибка! Вы ввели не число.")
            return calculator()
            # рекурсивный запуск
    else:
        # если вначале ввели символ отличный от предложенных, то
        print("Вы ввели некорректный символ.")  # сообщаем об этом
        return calculator()                     # и запускаем рекурсию


calculator()
