"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random

def guess(n):
    """Рекурсивная процедура угадывания"""
    if n < 1:
        print("Вы исчерпали число попытоки проиграли.")
        return
    print(f"Попытка номер {n}.")
    prob = int(input("Введите угадываемое число:"))
    if prob == secret_num:
        print("Вы угадали число и выиграли.")
        return
    if prob < secret_num:
        print("Загаданное число больше введенного вами.")
    else:
        print("Загаданное число меньше введенного вами.")
    guess(n-1)

secret_num = random.randint(0,100)
print("Загадано число от 0 до 100 \nПопробуйте угадать его за 10 попыток.")
guess(10)
