#!/usr/bin/env python3

"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

operators = {
    '+' : lambda x, y: x + y,
    '-' : lambda x, y: x - y,
    '*' : lambda x, y: x * y,
    '/' : lambda x, y: x / y,
}


def process() -> None:
    while True:
        operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
        if operator not in list(operators.keys()) + ['0']:
            print('Введен неверный символ операции')
        else: break

    if operator != '0':
        while True:
            try:
                value1 = int(input('Введите первое число: '))
                value2 = int(input('Введите второе число: '))
            except ValueError:
                print('Введено не корректное число!')
            else: break

        try:
            print(f'{value1} {operator} {value2} = {operators[operator](value1, value2)}')
        except ZeroDivisionError:
            print('Деление на 0 невозможно!')

        process()


def main():
    process()

if __name__ == '__main__':
    main()
