"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    operators = ['+', '-', '*', '/']
    operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operator != '0':  # шаг рекурсии
        if operator in operators:
            try:
                operand_1 = float(input('Введите первое число: '))
                operand_2 = float(input('Введите второе число: '))
                if operator == '+':
                    print(f'{operand_1} {operator} {operand_2} = {round(operand_1 + operand_2, 2)}')
                elif operator == '-':
                    print(f'{operand_1} {operator} {operand_2} = {round(operand_1 - operand_2, 2)}')
                elif operator == '*':
                    print(f'{operand_1} {operator} {operand_2} = {round(operand_1 * operand_2, 2)}')
                else:
                    print(f'{operand_1} {operator} {operand_2} = {round(operand_1 / operand_2, 2)}')
            except ZeroDivisionError:
                print('На 0 делить нельзя!')
            except ValueError:
                print('Вы вместо трехзначного числа ввели строку :(. Исправьтесь')
        else:
            print(f'{operator} не является оператором. Исправьтесь')
        calculator()
    else:
        print('Завершение работы программы.')  # базовый случай

calculator()