"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def number(count, sum, num, n):
    if n == count:
        return print(f'Количество элементов: {user_in}, их сумма: {sum}')
    else:
        sum = sum + num
        num = num / -2
        n += 1
        return number(count, sum, num, n)


user_in = int(input('Введите количество элементов: '))
number(user_in, 0, 1, 0)
