"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def recursion(val,rv):
    if val // 10 == 0:
        rv.append(val)
        return rv
    rv.append(val % 10)
    recursion(val // 10,rv)

reverse_val =  []
val = input('Введите число, которое требуется перевернуть:')
try:
    recursion(int(val),reverse_val)
except TypeError:
    print("Вы ошиблись при вводе числа. Работа закончена")
    exit(1)
else:
    val = ''
    for i in reverse_val:
        val +=  str(i)
    print(f"Перевернутое число:{val}")

