"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc(a=None, d1=None, d2=None):
    if not a:
        a = input(f"Введите операцию (+, -, *, / или 0 для выхода): ")
        if a == 0:
            return f"Выход из калькулятора...\n"
        if a not in ['+','-','*','/']:
            print(f"Вы ввели некорректный знак, попробуйте заново!\n")
            return calc()
    if not d1:
        d1 = input("Введите первое число: ")
        if not d1.isdigit():
            return calc(a=a)
    if not d2:
        d2 = input("Введите второе число: ")
        if not d2.isdigit():
            return calc(a=a, d1=d1)
    if a == '/':
        if float(d2) == 0:
            print(f"Деление на ноль!\n")
            return calc(a=a, d1=d1)
        print(f"Результат: {float(d1)/float(d2)}")
        return calc()
    if a == '+':
        print(f"Результат: {float(d1)+float(d2)}")
        return calc()
    if a == '-':
        print(f"Результат: {float(d1)-float(d2)}")
        return calc()
    if a == '*':
        print(f"Результат: {float(d1)*float(d2)}")
        return calc()


if __name__ == "__main__":
    calc()
