"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def odd_even(number, odd=0, even=0):
    if number == 0:  # базовый случай
        print(f'Количество цифр в числе равно:\nнечетных-{odd}\nчетных-{even}')
    else:  # шаг рекурсии
        try:
            if int(number) % 2 == 0:
                even += 1
            else:
                odd += 1
            number = number // 10
            return odd_even(number, odd, even)
        except:
            print(f'Значение {number} не является натуральным числом!')

odd_even(int(input('Введите число: ')))
odd_even(135724689000)
odd_even('string')
odd_even([])
