"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_func(n):
    def sum_nums(i, num=1):
        if i <= 0:
            return 0
        else:
            return num + sum_nums(i - 1, -num / 2)
    print(f'Количество элементов: {n}, их сумма: {sum_nums(n)}')


sum_func(int(input('Введите количество элементов: ')))
