"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum_of_set(base):
    return base if base == 1 else base + get_sum_of_set(base - 1)


n = 500
print(f'Is 1+2+...+{n} = {n}({n}+1)/2? \nAnswer: {get_sum_of_set(n) == n * (n + 1) / 2} (Sum = {get_sum_of_set(n)})')
