"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc(operation='', first='', second=''):
    if operation == '':
        oper = input('Ведите операцию (+, -, *, /, или 0 для выхода): ')
    else:
        oper = operation
        print('Операция: ', oper)

    if oper == '0':
        return

    if oper not in ('+', '-', '*', '/'):
        print('Неверная операция!')
        calc()
        return

    try:
        if first == '':
            first_dig = int(input('Введите первое число: '))
        else:
            first_dig = int(first)
            print('первое число = ', first_dig)
    except:
        print('Неверно, введите число')
        calc(oper)
        return
    try:
        if second == '':
            second_dig = int(input('Введите второе число: '))
        else:
            second_dig = int(second)
            print('второе число = ', second_dig)
    except:
        print('Неверно, введите число')
        calc(oper, first_dig)
        return

    if oper == '/' and second_dig == 0:
        print('На ноль делить нельзя!')
        calc(oper, first_dig)
        return

    print('Результат: ', eval(str(first_dig) + oper + str(second_dig)))
    calc()
    return


calc()