"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum(n):
    if n == 1:
        return n
    else:
        return get_sum(n - 1) + n


def get_str(n, str_='1', i=1):
    if n == 1:
        return str_
    else:
        return get_str(n - 1, str_ + '+' + str(i + 1), i + 1)


if __name__ == '__main__':
    while True:
        try:
            num = int(input('Введите число: '))
            if get_sum(num) == num * (num + 1) / 2:
                print(f'для n = {num}\n{get_str(num)} = {num}({num}+1)/2')
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь')
