"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


class OperatorError(Exception): pass


def calc():
    operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    try:
        if operator not in ('+', '-', '*', '/', '0'):
            raise OperatorError
    except OperatorError:
        print('Нет введенного вами оператора')
        return calc()
    if operator == '0':
        exit('Сеанс завершен')
    try:
        operand_1 = float(input('Введите первое число:'))
        operand_2 = float(input('Введите второе число: '))
    except ValueError:
        print(f'Вы ввели не число ')
        return calc()
    if operator == '+':
        print(f'Ваш результат: {operand_1 + operand_2}')
        return calc()
    elif operator == '-':
        print(f'Ваш результат: {operand_1 - operand_2}')
        return calc()
    elif operator == '*':
        print(f'Ваш результат: {operand_1 * operand_2}')
        return calc()
    elif operator == '/':
        try:
            print(f'Ваш результат: {operand_1 / operand_2}')
        except ZeroDivisionError:
            print('Деление на 0 ')
            return calc()


a = calc()
