"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc():
    op_tuple = ('0', '+', '-', '*', '/')
    operation = input("Введите операцию (+, -, *, / или 0 для выхода):")
    if op_tuple.count(operation) == 0:
        print("Вы не ввели операцию из предложенного списка")
        return calc()
    if operation == '0':
        exit()
    else:
        try:
            first_number = int(input("Введите первое число:"))
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь')
            return calc()

        try:
            second_number = int(input("Введите первое число:"))
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь')
            return calc()

        if operation == '+':
            result = first_number + second_number
        elif operation == '-':
            result = first_number - second_number
        elif operation == '*':
            result = first_number * second_number
        elif operation == '/':
            try:
                result = first_number / second_number
            except ZeroDivisionError:
                print('На ноль делить нельзя (((. Исправьтесь')
                return calc()
        print("Ваш результат ", result)
        return calc()

calc()

