"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
"""
Домашнее задание к уроку №2 Алгоритмы и структуры данных на Python
Студент: Максим Сапунов. Jenny6199@yandex.ru 10.06.2021
"""


def formula_1(n: int, get_sum=0):
    """ Вычисление левой части заданного выражения"""
    if n == 0:
        return int(get_sum)
    else:
        get_sum += n
        n -= 1
        formula_1(n, get_sum)


def formula_2(n):
    """ Вычисление правой части заданного выражения"""
    return int(n * (n + 1) / 2)


print(formula_1(10))
print(formula_2(10))
