"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

def getEvenCount(digit, even=0):
    """Рекурсия"""
    # все цифры числа извлечены
    if digit == 0:
        return even
    else:
        # достаем очередную цифру числа
        current = digit % 10
        # число естественно становится короче
        digit = digit // 10
        if current % 2 == 0:
            even += 1
        return recur_method(digit, even)


    number = int(input("Введите натуральное число: "))
    print(f"Количество четных и нечетных цифр в числе равно: {getEvenCount(number)}")
    
"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

def getEvenCount(digit, even=0):
    if digit == 0:
        return even
    else:
        current = digit % 10
        # число естественно становится короче
        digit = digit // 10
        if current % 2 == 0:
            even += 1
        return getEvenCount(digit, even)


number_input = input("Введите натуральное число: ")
evenCount = getEvenCount(int(number_input))
print(f"Количество четных и нечетных цифр в числе равно: {evenCount}, {len(number_input) - evenCount}")
    
