"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def proof_n(num):
    
    if num <= 1:
        return num
    else:
        return proof_n(num - 1) + num


number = input('Введи число для проверки: ')
if number.isdigit():
    if proof_n(int(number)) == int(number) * (int(number) + 1) / 2:
        print('Равенство выполняется')
else:
    print('Вы ввели строку вместо числа!')
