"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

el = 1
summ = 1

def sequence_sum(n, count=1):
    global summ, el
    if count == n:
        return
    else:
        el = el / 2 * (-1)
        summ = summ + el
        sequence_sum(n, count+1)
    return summ


print(sequence_sum(int(input('Input the number of elements: '))))