"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

try:
    num = int(input('Введите количество элементов: \n'))
except ValueError:
    print('Введите целое положительное число ')


def sum_of_el(n, el=1):
    if n <= 0:
        return 'Введите положительное число'
    return el if n == 1 else el + sum_of_el(n - 1, -(el / 2))


print(sum_of_el(num))
