"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_el(seq_num, seq_digit=1.0, count=1, seq_sum=1):

    """ Рекурсивная функция """

    if count == seq_num:
        return seq_sum
    else:
        seq_digit = seq_digit / 2 * (-1)
        SEQ.append(seq_digit)
        seq_sum += seq_digit
        return sum_el(seq_num, seq_digit, count + 1, seq_sum)


if __name__ == '__main__':
    # По умолчанию в последовательности уже имеется "1"
    SEQ = [1]
    try:
        NUM = int(input('Введите количество элементов: '))
        print(f'Количество элементов: {NUM}, их сумма: {sum_el(NUM)} ')
    except ValueError:
        print('Вы ввели не число')

    print(SEQ)
