"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def func_1(num, even=0, odd=0):
    char = num % 10
    if char % 2:
        odd += 1
    else:
        even += 1
    if char != num:
        func_1(num // 10, even, odd)
    else:
        print(f'Найдено {even} четных и {odd} нечетных')
        return


while True:
    value = input('Введите натуральное число >')
    if value.isdigit():
        value = int(value)
        if value > 0:
            break
    print("Введены некорректные данные")
func_1(value)
