"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

import random

def get_num(num, i ):
    if i == 10:
        print('Вы исчерпали 10 попыток. Было загадано', num)
    u = int(input(str(i) + '-я попытка: '))
    if u > num:
        print('Загаданное число меньше')
        return get_num(num, i+1)
    elif u < num:
        print('Загаданное число больше')
        return get_num(num, i+1)
    else:
        print('Вы угадали с %d-й попытки' % i)
        return

print('Число загадано, у Вас 10 попыток')
num = random.randint(1,100)
get_num(num, 1)