"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


class WrongSign(Exception):
    def __init__(self, text):
        self.text = text


def calculator():
    """ Рекурсивный калькулятор """
    # Ввод знака
    try:
        operator = input('Введите знак операции("+", "-", "*", "/" или "0" для выхода): ')
        if operator == '0':  # Базовый случай
            print("Базовый случай. Выходим.")
            return
        elif operator not in ["+", "-", "*", "/"]:
            raise WrongSign('Необходимо ввести знак из списка')
    except WrongSign as ws:
        print(ws)
        return calculator()

    # Ввод первого числа
    try:
        num1 = float(input('Введите первое число: '))
    except ValueError:
        print('Вы ввели не число')
        return calculator()

    # Ввод второго числа
    try:
        num2 = float(input('Введите второе число: '))
    except ValueError:
        print('Вы ввели не число')
        return calculator()

    # Блок калькуляции
    if operator == '+':
        print(f'Ваш результат: {num1 + num2}')
    elif operator == '-':
        print(f'Ваш результат: {num1 - num2}')
    elif operator == '*':
        print(f'Ваш результат: {num1 * num2}')
    elif operator == '/':
        try:
            print(f'Ваш результат: {num1 / num2}')
        except ZeroDivisionError:
            print('Делить на 0 нельзя')

    return calculator()


# Проверка
calculator()
