"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
import random

def num_ran(count , number):
    print(f"Попытка № {count}")
    answer = int(input("Введите число от 1 до 100 : "))
    if count == 10 or number == answer:
        if number == answer:
            print("Верно")
        print(f"Загаданное число : {number}")
    else:
        if answer > number:
            print(f"Число меньше чем {answer} ")
        if answer < number:
            print(f"Число больше чем {answer} ")
        num_ran(count + 1, number)

num_ran(1, random.randint(0,100))