"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

number = int(input('Количество элементов (n) вводится с клавиатуры.'))

# n = int(input())
# e = 1
# s = 0
# for i in range(n):
#     s += e
#     e /= -2
# print(s)


def amount(numbers):
    if numbers == 1:
        return 1
    else:
        return 1+amount(numbers-1)/-2


print(amount(number))
