"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def create_arr(values_left, arr=[]):
    if values_left > 0:
        if len(arr) == 0:
            arr.append(1)
        else:
            arr.append(arr[len(arr) - 1] / -2)
        values_left = values_left - 1
        create_arr(values_left, arr)
    else:
        print(f'Элементов: {len(arr)}, на сумму: {(sum(el for el in arr))}')


# Запускаем нашу рекурсию.
try:
    inp = int(input('Введите количество элементов: '))
    create_arr(inp)
except:
    print('Введите число!')
