"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_num(n, count=0, start_num=1.0, num_sum=0.0):
    return print(f'Количество элементов: {n}, их сумма: {num_sum}') if count == n else \
        sum_num(n, count + 1, start_num / 2 * -1, num_sum + start_num)


sum_num(4)
