"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.
Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""

def reverse_number(number, reverse_digits_list = []):
    digit = number % 10
    new_number = number // 10

    reverse_digits_list.append(digit)

    if new_number == 0:
        result = ''
        for number in reverse_digits_list:
            result += str(number)
        print(f'Перевернутое число: {result}')
        return

    reverse_number(new_number, reverse_digits_list)


while True:
    try:
        number = int(input('Введите натуральное число: '))
        if number < 0:
            raise ValueError
        break
    except ValueError:
        print('Вводить можно лишь натуральные числа и 0! Попробуйте еще раз.')

reverse_number(number)