"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def reciprocate(num_in='', num_out=''):
    if num_in == '':
        try:
            num_in = int(input('Введите число для зеркалирования: '))
        except:
            return reciprocate(num_in='', num_out='')
    if num_in == 0:
        return print(num_out)
    else:
        return reciprocate(num_in // 10, num_out + str(num_in % 10))


reciprocate()
reciprocate(12340)
reciprocate(212)
reciprocate(1234567890)