"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def is_float(number):
    try:
        float(number)
        return True
    except ValueError:
        print('Вы должны были ввести число. Попробуйте еще раз)')
        return False


def calc():
    action = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if action == '0':
        return print('Вы ввели "0". Выходим из функции.')
    if action not in ('+', '-', '*', '/'):
        print('Вы должны были ввести знак операции. Попробуйте еще раз)')
        return calc()

    first_number = input("Введите первое число: ")
    if not is_float(first_number):
        return calc()
    first_number = float(first_number)

    second_number = input("Введите второе число: ")
    if not is_float(second_number):
        return calc()
    second_number = float(second_number)

    if action == '+':
        print('Ваш результат:', first_number + second_number)
    elif action == '-':
        print('Ваш результат:', first_number - second_number)
    elif action == '*':
        print('Ваш результат:', first_number * second_number)
    elif action == '/' and second_number:
        print('Ваш результат:', first_number / second_number)
    else:
        print('Делитель должен быть отличным от нуля. Попробуйте еще раз)')

    return calc()


calc()
