"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def lot(n=5, sum=0, n_fin=0):
    if n == 0:
        return f"Сумма({n_fin}) = {sum}, а {n_fin}({n_fin}+1)/2 = {int(n_fin * (n_fin + 1) / 2)} они равны = {sum == n_fin * (n_fin + 1) / 2}"
    elif n < 0:
        print("ненадо так")
        return
    else:
        return lot(n - 1, sum + n, n_fin + 1)


print(lot(100))
