"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""

numb = int(input("Введите число: "))


def get_sum_number(n, sum=None, sign=True):
    if sum is None:
        n = n - 1
        sum = 1
    else:
        if sign:
            sign = False
            sum = sum - sum / 2
        else:
            sign = True
            sum = sum + sum / 2

    if n == 0:
        return sum
    else:
        return get_sum_number(n - 1, sum, sign)


print(get_sum_number(numb))
