"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def summ_natural_recur(n):
    """Вычисление сумму ряда натуральных чисел 1+2+...+n"""
    if n == 1:
        return 1
    return n + summ_natural_recur(n - 1)


num = int(input("Введите число n: "))

print(
    f"равенство 1+2+...+ {num} = {num} * ({num} + 1) / 2 "
    f"{'выполняется' if summ_natural_recur(num) == num * (num + 1) / 2 else 'не выполняется'}")

print(f"результат суммы {num} чисел ряда: {summ_natural_recur(num)}")
