"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def task03(input_num, reverse_num, call_count):

    if input_num == 0:
        print(f'Перевернутое число: {reverse_num}')
        print(f'Количество вызовов: {call_count}')
        return

    reverse_num += str(input_num % 10)
    call_count += 1

    task03(input_num //10, reverse_num, call_count)


while True:
    input_value = input('Введите число, либо 0 для завершения: ')
    if input_value == '0':
        break

    try:
        input_value = int(input_value)
    except ValueError:
        print('Введено некорректное значение!')
    else:
        task03(input_value, '', 1)
