"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def add(num_1: int, num_2: int) -> int:
    return num_1 + num_2


def sub(num_1: int, num_2: int) -> int:
    return num_1 - num_2


def mul(num_1: int, num_2: int) -> int:
    return num_1 * num_2


def div(num_1: int, num_2: int) -> float:
    return num_1 / num_2


def calc_rec():

    operation_dict = {
        '+': add,
        '-': sub,
        '*': mul,
        '/': div,
        '0': None
    }
    operation = input(f'Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation not in operation_dict.keys():
        return calc_rec()

    if operation == '0':
        return

    try:
        num_1 = int(input(f'Введите первое число: '))
        num_2 = int(input(f'Введите второе число: '))
    except ValueError:
        print(f'Вы ввели не число (((. Исправьтесь')
        return calc_rec()

    try:
        print(f'Ваш результат {operation_dict[operation](num_1, num_2)}')
    except ZeroDivisionError:
        print(f'Деление на 0!!!')

    return calc_rec()


calc_rec()
