"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def row(n):
    if n == 1:
        return 1
    else:
        return n + row(n-1)


print('Бытует мнение, что для множества натуральных чисел справедливо выражение:\n'
      '1+2+...+n = n(n+1)/2.\n'
      'Сейчас мы это проверим.')
n = int(input('Введите положительное целое n: '))
print('Вычислим с помощью суммы ряда:', row(n))
print('Вычислим с помощью формулы:', int(n * (n + 1) / 2))
print('Ну как, сошлось?')