"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def element_sum(this_value, element_count):
    if element_count == 0:
        return 0
    return this_value + element_sum(this_value / 2 * -1, element_count - 1)


while True:
    try:
        value = int(input('Введите количество элементов:\n'))
        break
    except ValueError:
        print('Вы ввели строку, а не число')

print(f'Количество элементов: {value}, их сумма: {element_sum(1, value)}')
