"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
import random


def guess_numb(numb, cnt=10):
    if cnt == 10:
        numb = random.randint(0, 100)

    if cnt <= 0:
        print(f"Вы не угадали ! Было загадано число : {numb}")
        return

    user_num = float(input(f"Осталось #{cnt} попыток: "))
    if (user_num - numb) == 0:
        print("Вы Угадали! )")
        return
    elif (user_num - numb) > 0:
        print("Меньше !")
    else:
        print("Больше !")

    guess_numb(numb, cnt=cnt - 1)


# Test
guess_numb(0)
