"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст
 рекурсивная ф-циясо значением, полученным в правой части (здесь нужно просто подставить
  n и подсчитать) Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def my_sum(n):
    """ Подсчет суммы рядаот 1 до н"""
    return 1 if n == 1 else n + my_sum(n-1)

print("Программа численно проверяетравенство 1+2+...+n = n(n+1)/2 для натуральных чисел")
while True:
    num = int(input("Введите число для проверки. Ноль окончание работы:"))
    if not num:
        break
    print(my_sum(num) == num * (num + 1)/2)
