"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def prove(n=0, x=0, left=[]):
    if n == 0:
        n = int(input('Please insert the number n: '))
    left.append(x + 1)
    # print(left)
    if x == n - 1:
        result = sum(left)
        right = int(n * (n + 1) / 2)
        return print(f'{result == right}: {result} = {right}')
        # return print(left[-1])
    return prove(n, x + 1, left)


prove()
