"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def f_reverse(p_in):
    if p_in == 0:
        return ''

    v_ret = str(p_in % 10) + f_reverse(p_in // 10)

    return v_ret


while True:
    try:
        n = int(input('Введите положительное число, которое требуется перевернуть: '))
        if n < 0:
            raise ValueError
        break
    except ValueError:
        print("Введенное значение не является положительным числом (((. Исправьтесь")

print(f'Перевернутое число: {f_reverse(n) if n != 0 else 0}')
