"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calculator():
    actions = ('+', '-', '*', '/', '0')
    operation = input('Введите операцию (+, -, *, /) Для выхода из программы введите 0: ')
    if operation == '0':
        print('Работа программы завершена')
        return None
    if operation not in actions:
        print(f'Вы ввели неправильный символ {operation}, введите Введите операцию (+, -, *, /)')
        return calculator()
    try:
        first_num = float(input('Введите первое число: '))
        second_num = float(input('Введите второе число: '))
        result = ''
        if operation == '+':
            result = first_num + second_num
        elif operation == '-':
            result = first_num - second_num
        elif operation == '*':
            result = first_num * second_num
        elif operation == '/':
            result = first_num / second_num
    except ValueError:
        print('Необходимо ввести число, попробуйте еще раз')
        return calculator()
    except ZeroDivisionError:
        print('Делить на ноль нельзя, попробуйте еще раз')
        return calculator()
    print(f'Результат: {result}')
    return calculator()


calculator()
