"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""
def sum_fuction(input_count, iter_sum, i=0, sum=0):
    while i < input_count:
        return sum_fuction(input_count, iter_sum / -2  ,i + 1, sum+iter_sum)
    print (f"Количество элементов - {i}, их сумма - {sum}")
sum_fuction(3,1)
sum_fuction(2,1)