"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""
steps = 15
conv_lst = []


def step_conv(step, num):
    conv_lst.append(num)
    if step == 0:
        print("res")
        print(conv_lst)
        print(sum(conv_lst))
        return
    step_conv(step - 1, num / -2)


# Test
step_conv(steps, 1)
