"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""
c = input('Введите операцию (+, -, *, / или 0 для выхода):')


def calc(c):
    if c == '0':
        return 'Программа завершена'
    elif c == '+':
        a = int(input('Введите первое число: '))
        b = int(input('Введите второе число: '))
        print(a + b)
        return calc(c=input('Введите операцию (+, -, *, / или 0 для выхода):'))
    elif c == '-':
        a = int(input('Введите первое число: '))
        b = int(input('Введите второе число: '))
        print(a - b)
        return calc(c=input('Введите операцию (+, -, *, / или 0 для выхода):'))
    elif c == '*':
        a = int(input('Введите первое число: '))
        b = int(input('Введите второе число: '))
        print(a * b)
        return calc(c=input('Введите операцию (+, -, *, / или 0 для выхода):'))
    elif c == '/':
        a = int(input('Введите первое число: '))
        b = int(input('Введите второе число: '))
        if b == 0:
            print('Делить на ноль не хорошо. Начните заново')
        else:
            print(a / b)
        return calc(c=input('Введите операцию (+, -, *, / или 0 для выхода):'))
    else:
        print('Вы ввели что-то не то, попробуйте еще раз')
        return calc(c=input('Введите операцию (+, -, *, / или 0 для выхода):'))


print(calc(c))
