"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc(result):
    znak = input('Введите знак (0 для выхода): ')
    if znak not in '0+-*/':
        print('Введен неверный знак: ')
        return calc()
    if znak == '0':
        return result
    number_2 = int(input('Введите второе число: '))
    number_2 = int(number_2)
    if znak == '+':
        print(f'Результат = {result + number_2}')
        return calc(result=result + number_2)
    if znak == '-':
        print(f'Результат = {result - number_2}')
        return calc(result=result - number_2)
    if znak == '*':
        print(f'Результат = {result * number_2}')
        return calc(result=result * number_2)
    if znak == '/':
        try:
            result = result / number_2
            print(f'Результат = {result}')
            return calc(result=result)
        except ZeroDivisionError as e:
            print(f'{e} На 0 делить нельзя!!!')
            print(f'Результат = {result}')
            return calc(result)


number_1 = int(input('Введите первое число: '))

print(calc(number_1))
