"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


"""Решение"""


def my_is_type(num_1, num_2):
	"""функция для проверки типа вводимых пользователем чисел
	Если пользлователь вводит не число
	"""
	if float.is_integer(float(num_1)) and float.is_integer(float(num_2)):
		return int(num_1), int(num_2)
	elif type(float(num_1)) is float or type(float(num_1)) is float:
		return float(num_1), float(num_2)
	else:
		print('Необходимо вводить числа типов int, float')
		num_1 = input('Введите первое число: ')
		num_2 = input('Введите второе число: ')
		my_is_type(num_1, num_2)


def my_calc(operator):
	if operator == '0':
		print('Работа калькулятора завершена')
	else:
		num_a = input('Введите первое число типа int, float: ')
		num_b = input('Введите второе число типа int, float: ')
		num_a, num_b = my_is_type(num_a, num_b)
		if operator == '*':
			print(num_a * num_b)
		elif operator == '/':
			print(num_a / num_b)
		elif operator == '+':
			print(num_a + num_b)
		elif operator == '-':
			print(num_a - num_b)
		else:
			print('Тип действия не поддерживается')
		operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
		my_calc(operator)


first_calc = input('Введите операцию (+, -, *, / или 0 для выхода): ')
my_calc(first_calc)
