"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def calculator():
    operation = input('Input the operation or "0" for exit: ')
    if operation not in ('0', '+', '-', '*', '/'):
        print('Input error happens. You should input the sign of operation "+ - * /" or 0 for exit')
        return calculator()
    else:
        if operation == '0':
            return "quit"
        else:
            try:
                try:
                    a = int(input('Input the first number part: '))
                    b = int(input('Input the second number part: '))
                    return eval(f'{a}{operation}{b}')
                except ValueError:
                    print('Input error happens. You should input a number')
                    return calculator()
            except ZeroDivisionError:
                print("The division by zero happens. You can't divide so, try again.")
                return calculator()

print(calculator())