"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def geometric_progress(el, start=1, prog_sum=0):
    prog_sum += start
    start /= -2
    el -= 1
    if el == 0:
        return prog_sum
    else:
        return geometric_progress(el, start, prog_sum)


if __name__ == '__main__':
    print(geometric_progress(3))
