"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def task_4(n, num):
    if n == 0:
        return num
    n -= 1
    if n % 2 == 0:
        y = (num / 2) * -1
        return task_4(n, num + y)
    else:
        x = num / 2
        return task_4(n, num + x)


print(task_4(int(input('Введите кол-во элементов: ')) - 1, 1))
