"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_series(n):
    try:
        n = int(n)
        if n < 0:
            return 'Ошибка ввода данных. Вы ввели отрицательное число.'
        elif n == 0:
            return 0
        elif n == 1:
            return 1
        else:
            return sum_series(n - 1) + 1 / ((-2) ** (n - 1))
    except ValueError:
        return 'Ошибка ввода данных. Введено не целое число'


if __name__ == '__main__':
    print(sum_series(input('Введите количество элементов (целое положительное число): ')))
