"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


num = int(input('Введите целое число от 1 до 4: '))
some_list = [1, -0.5, 0.25, -0.125]


def my_sum(num_list, user_num):

    new_list = num_list[:user_num:]

    if not new_list:
        return 0
    else:
        return new_list[0] + my_sum(new_list[1:], user_num)


print(my_sum(some_list, num))
