"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def input_num():
    try:
        num = int(input("Введите натуральное число,для которого хотите\n"
                        "проверить равенство 1+2+...+n = n(n+1)/2: "))
        if num <= 0:
            print("Ошибка! Число должно быть натуральным.")
            return input_num()
    except ValueError:
        print("Вы ввели не число.")
        return input_num()
    return proof(num)


def my_sum(num):
    if num == 1:
        return num
    return num + my_sum(num - 1)


def proof(num):
    print(f"Наш расчет: {my_sum(num)}; Расчет по формуле: {num * (num + 1) / 2}")
    if my_sum(num) != num * (num + 1) / 2:
        print("Для данного числа равенство не выполняется")
    else:
        print("Для данного числа выполняется равенство")
    exit()


input_num()
