"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_equality(number, user_num=0):
    if number == 0:
        return user_num
    else:
        user_num = user_num + number
        number -= 1
    return check_equality(number, user_num)


num = int(input('Введите натуральное число: '))
if check_equality(num) == ((num * (num + 1)) / 2):
    print('Равенство 1+2+...+n = n(n+1)/2 является верным')
else:
    print('Равенство 1+2+...+n = n(n+1)/2 является неверным')
