"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def digital_mirror(number, reflexion=''):
    if number == 0:  # базовый случай
        return print(reflexion)
    else:  # шаг рекурсии
        try:
            # reflexion.join(str(int(number) % 10))
            reflexion += str(int(number) % 10)
            return digital_mirror(number // 10, reflexion)
        except:
            print(f'Значение {number} не является натуральным числом!')


digital_mirror(int(input('Введите число, которое нужно перевернуть: ')))
digital_mirror(1234500)
digital_mirror('string')
