"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def two_nums_arithmetic():
    oper_symb = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if oper_symb not in '+-*/0':
        print('Введен неверный знак операции или завершения программы.')
        return two_nums_arithmetic()
    elif oper_symb == '0':
        return  'Программа завершена пользователем.'
    num_1 = input('Введите первое число: ')
    if num_1.isdigit():
        num_1 = int(num_1)
    else:
        print(f'Вместо первого числа Вы ввели строку: {num_1}. Исправьтесь')
        return two_nums_arithmetic()
    num_2 = input('Введите второе число: ')
    if num_2.isdigit():
        num_2 = int(num_2)
    else:
        print(f'Вместо второго числа Вы ввели строку: {num_2}. Исправьтесь')
        return two_nums_arithmetic()
    if oper_symb == '+':
        print(f'Ваш результат: {num_1 + num_2}')
        return two_nums_arithmetic()
    elif oper_symb == '-':
        print(f'Ваш результат: {num_1 - num_2}')
        return two_nums_arithmetic()
    elif oper_symb == '*':
        print(f'Ваш результат: {num_1 * num_2}')
        return two_nums_arithmetic()
    elif oper_symb == '/':
        if num_2 == 0:
            print(f'На ноль делить нельзя! Исправьтесь')
            return two_nums_arithmetic()
        print(f'Ваш результат: {num_1 / num_2}')
        return two_nums_arithmetic()

if __name__ == "__main__":
    print(two_nums_arithmetic())

