"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def calc():
    try:
        type_of_operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')

        while type_of_operation != '0':
            number_1 = int(input('Введите 1 число: '))
            number_2 = int(input('Введите 2 число: '))
            try:
                if type_of_operation == '+':
                    print(f'Ваш результат: {number_1 + number_2}.')
                    return calc()
                elif type_of_operation == '-':
                    print(f'Ваш результат: {number_1 - number_2}.')
                    return calc()
                elif type_of_operation == '*':
                    print(f'Ваш результат: {number_1 * number_2}.')
                    return calc()
                elif type_of_operation == '/':
                    print(f'Ваш результат: {number_1 / number_2}.')
                    return calc()
                elif type_of_operation == '/' and number_2 == 0:
                    number_2 = int(input('Введите знаменатель отличный от нуля: '))
                    return calc()
            except ZeroDivisionError:
                print()

        return 'Калькулятор завершен.'
    except KeyError:
        print('Такой операции нет, введите из предложенных:(+, -, *, / или 0 для выхода)')
        return calc()


print(calc())