"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def task07(left_value):
    if left_value == 1:
        return 1
    else:
        return left_value + task07(left_value - 1)


while True:
    input_value = input('Введите натуральное число для проверки равенства, либо 0 для завершения: ')
    if input_value == '0':
        break

    try:
        input_value = int(input_value)
    except ValueError:
        print('Введено некорректное значение!')
    else:
        res = task07(input_value)
        if res == input_value * (input_value + 1) / 2:
            print(f'Значения в левой и правой части равенства совпали! Сумма членов прогрессии равна {res}')
