"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def funk(n, num=1, sum_num=0):
    if n == 0:
        print(sum_num)

    else:
        n -= 1
        sum_num = (sum_num + num)
        num = num / -2
        return funk(n, num, sum_num)


funk(int(input('Введите количество элементов - ')))
