"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def revers_numbers_1(number, list_revers=[]):
    if number == 0:
        print(list_revers)
    else:
        list_revers.append(number % 10)
        revers_numbers_1(number // 10, list_revers)


def revers_numbers_2(number):
    if number == 0:
        return ''
    else:
        return str(number % 10) + revers_numbers_2(number // 10)


if __name__ == '__main__':
    revers_numbers_1(123040)
    print(revers_numbers_2(123040))
