"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_the_eq(n, k=1, d=1, s=0):
    if n == 0:
        return int(s)
    else:
        return check_the_eq(n - 1, s=s + n)


if __name__ == '__main__':
    t = int(input('Введите последнее число прогрессии'))
    v = check_the_eq(t)
    if v == int(t * (t + 1) / 2):
        print('Равенство верное')
    else:
        print('Равенство неверное')
