"""
Задание 5.
Задание на закрепление навыков работы со стеком

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим стеком порогового значения.
Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
для реализации этой задачи.

После реализации структуры, проверьте ее работу на различных сценариях

Подсказка:
Отдельне стопки можно реализовать через:
# 1) созд-е экземпляров стека (если стопка - класс)
# 2) lst = [[], [], [], [],....]
"""
<<<<<<< HEAD


def ascii_tab_cycle():
    i = 1
    for char_num in range(32, 128):
        if i < 10:
            print(f'{ord(chr(char_num))} - {chr(char_num)}', end=' ')
            i += 1
        else:
            print(f'{ord(chr(char_num))} - {chr(char_num)}')
            i = 1


def ascii_tab_rec(char_num=32, i=1):
    if char_num == 128:
        return ''
    else:
        if i < 10:
            print(f'{ord(chr(char_num))} - {chr(char_num)}', end=' ')
            i += 1
        else:
            print(f'{ord(chr(char_num))} - {chr(char_num)}')
            i = 1
        return ascii_tab_rec(char_num + 1, i)


if __name__ == '__main__':
    ascii_tab_cycle()
    ascii_tab_rec()
=======
>>>>>>> 7b05359d119ad7d2edbbbbace24e97f96351fcd5
