"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def div_half(n):
    if n == 0:
        return 0
    n = n - 1
    val = (-1/2)**n   # -0.5^n
    return val + div_half(n)


# Проверка:
n = int(input('Введите количество элементов: '))
print(f'Количество элементов: {n}, их сумма: {div_half(n)}')

# Доп. вывод результатов для проверки
print('\n Дополнительная проверка результата:')
print(div_half(5))
print(div_half(4))
print(div_half(3), ' - в условии')
print(div_half(2))
print(div_half(1))
print(div_half(0))


# Вариант 2. C циклом

n = 3
f = 1
sum = 0
while n != 0:
    n = n - 1
    sum = sum + f
    f = - f / 2

print('Решение с циклом:', sum)
