"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


def guessing_number(guessed_number, attempts=10):
    """
    В программе генерируется случайное целое число от 0 до 100.
    Пользователь должен его отгадать не более чем за 10 попыток. После каждой
    неудачной попытки должно сообщаться больше или меньше введенное пользователем
    число, чем то, что загадано. Если за 10 попыток число не отгадано,
    то вывести загаданное число.
    :param guessed_number: Загоданое число
    :param attempts: количество попыток
    """
    answer = int(input('Угадайте чило: '))
    if answer == guessed_number:
        return 'Вы угадали!'
    if answer < guessed_number:
        print('Загаданое число больше.')
    else:
        print('Загаданое число меньше.')
    attempts -= 1
    if attempts == 0:
        return 'У вас кончились попытки'
    return guessing_number(guessed_number, attempts)


GUESSED_NUMBER = random.randint(1, 100)
print(guessing_number(GUESSED_NUMBER))
