"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""


def guess_num(min=0, max=100, trys=10):
    num = 15
    n = int(input(f'Угадайте число от {min} до {max}, осталось {trys} попыток: \n>> '))
    if trys == 0:
        return "Попытки закончились, к сожалению у вас не получилось угадать."
    else:
        if n == num:
            return "Поздравляю, вы угадали!"
        elif num < n:
            if n > 100 or n > max:
                max = max
            else:
                max = n
            guess_num(min, max, trys - 1)
        elif num > n:
            if n < 0 or n < min:
                min = min
            else:
                min = n
            guess_num(min, max, trys - 1)


print(guess_num())
