"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""

n = int(input('Введите количество элементов: '))


def f_sum(start_value, no_elements):
    if no_elements == 1:
        return start_value
    return start_value + f_sum(0 - (start_value / 2), no_elements - 1)


print(f'Количество элементов: {n}, их сумма: {f_sum(1, n)}')
