"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
class Error(Exception):
    pass


def calc(n=''):
    result = ''
    try:
        ask = input('Введите операцию (+, -, *, / или 0 для выхода): ')
        if ask == '0':
            return 'Программа завершила свою работу'

        if ask in '+-*/':
            first_num = float(input('Введите первое число: '))
            second_num = float(input('Введите второе число: '))
            if ask == '+':
                result = first_num + second_num
                print(f'Ваш результат: {result}')
            elif ask == '-':
                result = first_num - second_num
                print(f'Ваш результат: {result}')
            elif ask == '*':
                result = first_num * second_num
                print(f'Ваш результат: {result}')
            elif ask == '/':
                result = first_num / second_num
                print(f'Ваш результат: {result}')
            return f'{calc(result)}'
        else:
            raise Error
    except Error:
        print('Введите предложенную операцию!')
        return calc()
    except ZeroDivisionError:
        print('Произошло деление на 0')
        return calc()
    except ValueError:
        print('Введите число!')
        return calc()


print(calc())
