"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def row_summa(i, number, iters, result):

    if i == iters:
        print(f"Колличество элементов - {iters}, их сумма - {result}")
    elif i < iters:
        return row_summa(i + 1, number / 2 * -1, iters, result + number)

    try:
        iters = int(input("Введите кол-во элементов: "))
        row_summa(0, 1, iters, 0)
    except ValueError:
        print("Исправьте ввод на число")

row_summa(0,0,0,0)

'''
def function(h):
    k = h - 1
    if h == 0:
        return []
    return function(k) + [(-1) ** (k % 2) / (1 << k)]  # Бинарный сдвиг влево (<<)


n = int(input("Введите число:"))
print(function(n))
print(sum(function(n)))

'''