"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def num_reverse(num):
    # Базовый случай, если число оканчивается нулями
    if len(str(num)) > 1 and str(num)[1] == '0':
        return '0' * str(num).count('0') + str(num)[0]
    # Базовый случай, если число без нулей
    elif num == 0:
        return ''
    else:
        tens = 10 ** (len(str(num)) - 1)
        return num_reverse(num % tens) + str(num // tens)


print(num_reverse(987654321000))
print(num_reverse(123456789))
