"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint as rnd


def guessing_game(n=10, hidden_num=rnd(0, 100)):
    """ Передаем в функцию количество попыток и загаданное число.
        Если функцию используем без параметров, то устанавливаются значения по умолчанию """
    if n == 0:
        return f'Вы проиграли! Это было число {hidden_num}'  # -- Базовый случай 1
    answ_user = int(input('Введите ваш вариант ответа: '))
    if answ_user == hidden_num:
        return f'Вы угадали! Это число {answ_user}!'         # -- Базовый случай 2
    elif answ_user > hidden_num:
        print('Вы указали больше загаданного!')
    else:
        print('Вы указали меньше загаданного!')
    return guessing_game(n - 1, hidden_num)


# Проверка результата
print(guessing_game())
