"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sequence_sum(value, _element=1.0, _sequence_sum=0.0):
    if value <= 0:
        print(f'Sum of sequence: {_sequence_sum}')
    else:
        return sequence_sum(value - 1, -(_element / 2), _sequence_sum + _element)


if __name__ == '__main__':
    sequence_sum(3)
