"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


from task_4 import sum_n as sn


def get_next(num: int):
    return num + 1


def right_fun(nn: int):
    return (nn * (nn + 1)) / 2


if __name__ == '__main__':
    n = int(input("set N number:"))
    left = sn(1, n, get_next)
    right = right_fun(n)
    print(left, " == ", right, " ? ", (left == right))

