"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    commands = '+-*/0'
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation == '0':
        return
    if operation not in commands:
        print('Введена неправильная операция! Попробуйте ещё раз.')
        calculator()
    a = input('Введите первое число: ')
    if not a.isnumeric():
        print('Введена строка! Попробуйте ещё раз.')
        calculator()
    b = input('Введите второе число: ')
    if not b.isnumeric():
        print('Введена строка! Попробуйте ещё раз.')
        calculator()
    if operation == '+':
        print(f'Ваш результат: {int(a) + int(b)}')
        calculator()
    if operation == '-':
        print(f'Ваш результат: {int(a) - int(b)}')
        calculator()
    if operation == '*':
        print(f'Ваш результат: {int(a) * int(b)}')
        calculator()
    try:
        if operation == '/':
            print(f'Ваш результат: {int(a) / int(b)}')
            calculator()
    except ZeroDivisionError:
        print('Деление на ноль запрещено! Попробуйте ещё раз.')
        calculator()


calculator()
