"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint


def guessing(guess, number, attempt):
    try:
        if guess == number:
            print("Вы угадали! Поздравляю!")
            return
        elif guess < number:
            print("Загаданное число больше")
        else:
            print("Загаданное число меньше")
        if attempt == 10:
            print("Попытки закончились! Было загадано число ", number)
            return
        guessing(int(input("Следующая попытка: ")), number, attempt + 1)
    except ValueError:
        print('Ошибка ввода! Можно вводить только целые числа.')


guessing(int(input("Попробуйте угадать загаданное число: ")), randint(0, 25), 1)

