"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def equality_check(num, el=1, sum=0):
    try:
        num = int(num)
        if num == el:
            sum += el
            result = sum == num * (num + 1) / 2
            print(result)
        else:
            sum += el
            equality_check(num, el + 1, sum)
    except ValueError:
        print("Вы ввели не число. Попробуйте еще раз:")
        num = input("Введите число: ")
        equality_check(num)


user_num = input("Введите число: ")

equality_check(user_num)
