"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


# Рекурсивная функция для вычисления левой части равенства
def recursion_func(n):
    if n == 1:
        return n
    else:
        return n + recursion_func(n-1)


# Сравнение(доказательство) левой и правой части равенства
def check_func():
    try:
        num = int(input('Введите натуральное число: '))
        rez = num*(num+1)/2     # Правая часть равенства
        print(recursion_func(num) == rez)  # Сравнение
    except ValueError:
        print('Нужно ввести натуральное число!!!')
        check_func()


if __name__ == '__main__':
    check_func()
