"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def find_sum(number):
    return 1 / (-2) ** (number - 1) + find_sum(number - 1) if number > 1 else 1


if __name__ == '__main__':
    num = int(input('Введите количество элементов:\n'))
    print(f'Сумма {num} элементов равна: {find_sum(num)}')
