"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def calc():
    """
    ничего не передается. Данные принимаются в теле функции
    :return: служит для рекурсии
    """
    command = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    operations = {
        '+': (lambda x, y: x + y),
        '-': (lambda x, y: x - y),
        '*': (lambda x, y: x * y),
        '/': (lambda x, y: x / y),
        '0': '',
    }

    if command not in operations.keys():
        print(f'команда "{command}" не распознана')
        return calc()
    elif command == '0':
        return ('Работа программы завершена')
    else:
        try:
            x = int(input('Введите первое число: '))
            y = int(input('Введите второе число: '))
            print (f'{x} {command} {y} = {operations[command](x, y)}')
            return calc()
        except ValueError:
            print(f'Вы вместо числа ввели строку (((. Исправьтесь')
            return calc()
        except ZeroDivisionError:
            print(f'Деление на ноль запрещено!')
            return calc()

print(calc())