"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def calculator():

    print("Введите Ноль для выхода из программы:> 0")
    operation = input("Введите знак (+,-,*,/): ")

    if operation == '0':
        return "Выход"
    else:
        if operation in ('+', '-', '*', '/'):
            try:
                x = int(input('X = '))
                y = int(input('Y = '))

                if operation == '+':
                    print(f"Результат = {x + y}")

                elif operation == '-':
                    print(f"Результат = {x - y}")

                elif operation == '*':
                    print(f"Результат = {x * y}")

                elif operation == '/':
                    try:
                        result = x / y
                    except ZeroDivisionError:
                        print("Деление на ноль!")
                    else:
                        print(f"Результат = {result}")
                    finally:
                        return calculator()

            except ValueError:
                print("Введите числа вместо символов:>'0123456789'")
                return calculator()
        else:
            print("Неверный знак операции!")
            return calculator()
    calculator()

calculator()