"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def arithmetic_progression(count, res_sum=0, term=0):
    term += 1
    res_sum += term
    if term == count:
        return res_sum
    else:
        return arithmetic_progression(count, res_sum, term)


if __name__ == '__main__':
    n = 5
    if arithmetic_progression(n) == n*(n+1)/2:
        print('The formula is correctly')
    else:
        print('The formula is wrong')