"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc():
    try:
        action = input('Введите операцию +, -, *, /. 0 - выход\n >')
        if action == '0':
            return
        elif action not in ('+', '-', '*', '/'):
            raise ValueError('Введена не операция')
        first = input('Введите первый операнд >')
        if first.isdigit() is False:
            raise ValueError('Введено не число')
        first = int(first)
        second = input('Введите второй операнд >')
        if second.isdigit() is False:
            raise ValueError('Введено не число')
        second = int(second)
        if second == 0:
            raise ZeroDivisionError('Делить на ноль нельзя')
        if action == '+':
            first = first + second
        elif action == '-':
            first = first - second
        elif action == '*':
            first = first * second
        else:
            first = first / second
        print(f' Результат >{first}<')
        calc()
    except (ValueError, ZeroDivisionError) as e:
        print(f' Ошибка. {e}')
    calc()


calc()
