"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

import random


def f_guess(p_atmpt):  # Число введенное пользователем и количество оставшихся попыток
    if p_atmpt == 0:
        print('Попытки закончились. Вы не угадали((')
        return

    i = int(input(f'Попытка № {10 - p_atmpt + 1}. Введите число: '))

    if i > n:
        print('Вы веели число больше, чем загаданное число')
        f_guess(p_atmpt - 1)
    elif i < n:
        print('Вы веели число меньше, чем загаданное число')
        f_guess(p_atmpt - 1)
    else:
        print('Вы угадали!!!')
        return


n = random.randint(1, 100)
print(f'Было загадано число от 1 до 100. Попробуйте угадать из 10 попыток')
f_guess(10)
