"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def computation(num):
    """
    previous - предыдущий элемент.
    regular - настоящий элемент, получамый делением на два предыдущего и сменой знака
    interim_sum - предварительная сумма
    n_sum - искомая сума n элементов заданной последовательности
    """
    if num == 1:
        return 1, 1
    else:
        previous, interim_sum = computation(num-1)
        regular = previous/(-2)
        n_sum = interim_sum + regular
        return regular, n_sum


def result():
    try:
        num = int(input('Введите количество элементов: '))
        print(f'Количество элементов: {num}, их сумма: {computation(num)[1]}')
    except ValueError:
        print('Необходимо ввести число.')
        result()


result()
