"""6. В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка: Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7"""

from random import randint


def guess_number(num, try_cnt):
    """
    Реализует рекурсивный алгоритм угадывания пользователем в консоли
    загаданного числа за определенное кол-во попыток.
    Результат угадывания - выводится в консоль.
    Коды завершения: 0 - число угадано, 1 - закончились попытки.
    :param num: загаданное число
    :param try_cnt: количество попыток
    :return: None
    """
    if try_cnt > 0:
        try:
            try_num = int(input(f"Осталось попыток {try_cnt}, "
                                f"введите целое число: "))
        except ValueError:
            print("Это не целое число! Минус попытка!")
            guess_number(num, try_cnt - 1)
    # базовый случай - число угадано или кончились попытки
    if try_cnt < 1:
        print (f'Попытки закончились - вы не отгадали!\nБыло загадано: {num}')
        exit(1)
    if try_num == num:
        print(f'Бинго! Вы угадали - это было число: {num}')
        exit(0)
    print('"Недолет"...' if num > try_num else '"Перелет"...')
    guess_number(num, try_cnt - 1)


if __name__ == '__main__':

    START_NUM, END_NUM = 0, 100  # начало и конец диапазона случ. чисел
    TRY_CNT = 10                 # кол-во попыток для отгадывания

    # генерим случ. число для отгадывания
    rnd_number = randint(START_NUM, END_NUM)

    print(f'Программа генерирует случайное число от {START_NUM} до '
          f'{END_NUM}.\nУ Вас {TRY_CNT} попыток угадать его.')
    guess_number(rnd_number, TRY_CNT)
