"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc():
    var = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if var == '0':  # проверка условия выхода
        return

    else:
        if var in '+-*/':   # проверяем допустимые операции
            try:
                fst_num = int(input('Введите первое число: '))
                snd_num = int(input('Введите второе число: '))

                if var == '+':
                    val = fst_num + snd_num
                    print('Ваш результат: ' + str(val))
                    return calc()

                elif var == '-':
                    val = fst_num - snd_num
                    print('Ваш результат: ' + str(val))
                    return calc()

                elif var == '*':
                    val = fst_num * snd_num
                    print('Ваш результат: ' + str(val))
                    return calc()

                elif var == '/':
                    try:
                        val = fst_num / snd_num
                    except ZeroDivisionError:
                        print('Деление на 0 невозможно!')
                    else:
                        print('Ваш результат: ' + str(val))
                    finally:
                        return calc()
            except ValueError:
                print('Вы вместо трехзначного числа ввели строку (((. Исправьтесь')
                return calc()
        else:
            print('Введена неверная команда, пожалуйста, повторите ввод.')
            return calc()


calc()