"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def equal(number):
    if number == 0:
        return number
    else:
        temp_number = number + equal(number - 1)
        return temp_number


user_answer = int(input('Введите любое натуральное число'))
number_1 = equal(user_answer)
number_2 = (user_answer * (user_answer + 1) / 2)

if number_1 == number_2:
    print(f'{number_1} = {number_2} is True')
else:
    print('False')
