"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def operations():
    operators = '+-*/'
    user_input = input('Введите тип операции или 0 для выхода: ')

    if user_input == '0':
        return None
    elif user_input not in "+-*/":
        print('Вы ввели некорректный тип операции, повторите сначала.')
        return operations()
    else:
        try:
            operand_left = int(input('Введите первое число: '))
        except ValueError as Error:
            print('Вы ввели некорректное первое число, повторите сначала.')
            return operations()
        try:
            operand_right = int(input('Введите второе число: '))
        except ValueError as Error:
            print('Вы ввели некорректное второе число, повторите сначала.')
            return operations()

        if user_input == '*':
            result = operand_left * operand_right
        elif user_input == '+':
            result = operand_left + operand_right
        elif user_input == '-':
            result = operand_left - operand_right
        elif user_input == '/':
            if operand_right != 0:
                result = operand_left / operand_right
            else:
                result = 'None - Деление на 0 недопустимо.'
        print(f"Результат вычисления равен {result}")
        return operations()

operations()
