"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc(numb_obj, sign_obg):
    if sign_obg != '0':
        if sign_obg in signs:
            try:
                number2 = float(input('Введите следующее число: '))
            except ValueError:
                print('Ошибка ввода числа!')
                return calc(numb_obj, sign_obg)
            if sign_obg == '+':
                numb_obj += number2
            elif sign_obg == '-':
                numb_obj -= number2
            elif sign_obg == '*':
                numb_obj *= number2
            elif sign_obg == '/':
                try:
                    numb_obj /= number2
                except ZeroDivisionError:
                    print('Ошибка! Деление на 0! Операция отменена')
        else:
            print('Неверно введен знак!')
        print(f'Результат: {numb_obj}')
        sign_obg = input('Введите операцию (+, -, *, / или 0 для выхода): ')
        return calc(numb_obj, sign_obg)
    else:
        return print(f'Итоговый результат: {numb_obj}')


signs = ['+', '-', '*', '/', '0']
ind = True
while ind:
    try:
        number = float(input('Введите первое число: '))
        ind = False
    except ValueError:
        print('Ошибка ввода числа!')
sign = input('Введите операцию (+, -, *, / или 0 для выхода): ')
calc(number, sign)
