"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum_descending_row(number: int, number_of_row=1.0, sum_of_row=0.0, depth_value=1):
    """
        Считает сумму чисел убывающего ряда (sum_of_row) чисел вида: : 1 -0.5 0.25 -0.125 ...
        где number - количество (depth_value) чисел этого ряда, т.е. натуральное число
    """
    sum_of_row += (number_of_row if depth_value % 2 else - number_of_row)  # суммируем в переменную
    return print(f'Количество элементов: {depth_value} , их сумма: {sum_of_row}') if number == 1 \
        else get_sum_descending_row(number - 1, number_of_row / 2, sum_of_row, depth_value + 1)


user_number = int(input('Введите количество элементов: '))
get_sum_descending_row(user_number)
