"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def get_sum_test(cycles: int, n=1.0, res=1):
    if cycles == 1:
        return res
    else:
        n = n / -2
        cycles -= 1
        res += n
        return get_sum_test(cycles, n, res)


print(get_sum_test(int(input('Количество стэков вызова: '))))
