"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def calculator(sign):
    if sign == '0':
        return
    if sign in ('+', '-', '*', '/', '0'):
        try:
            a, b = map(int, input('Введите два числа: ').split())
            if sign == '+':
                print(a, '+', b, '=', a+b)
            elif sign == '-':
                print(a, '-', b, '=', a-b)
            elif sign == '*':
                print(a, '*', b, '=', a*b)
            elif sign == '/':
                print(a, '/', b, '=', a/b)
        except ZeroDivisionError:
            print('Запрещено делить на 0! Введите другие значения.')
        except ValueError:
            print('Неправильный ввод значений! Введите два числа через пробел.')
    else:
        print('Введена неверная операция!\nВыберите одну из следующих операций: +, -, *, /.\n'
              'Для завершения программы введите 0.')
    calculator(input('Введите операцию (+, -, *, / или 0 для выхода): '))


calculator(input('Введите операцию (+, -, *, / или 0 для выхода): '))

