"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""


def revers_numbers_1(number, list_revers=[]):
    if number == 0:
        print(list_revers)
    else:
        list_revers.append(number % 10)
        revers_numbers_1(number // 10, list_revers)


def revers_numbers_2(number):
    if number == 0:
        return ''
    else:
        return str(number % 10) + revers_numbers_2(number // 10)


if __name__ == '__main__':
    revers_numbers_1(123040)
    print(revers_numbers_2(123040))
