"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


from random import randint


def guess_number(my_number, number_tries):
    answer = int(input("Угадайте число от 0 до 100: "))
    if (answer == my_number):
        print("Поздравляем!!! Вы угадали с %d попытки!!!" % (10 - number_tries + 1))
        return
    else:
        if my_number < answer:
            print("\nЗагаданное число - меньше.")
        else:
            print("\nЗагаданное число - больше.")
        if number_tries > 1:
            print("У вас осталось %d попыток.\n" % (number_tries - 1))
            guess_number(my_number, number_tries - 1)
        else:
            print("\nУ вас не осталось ни одной попытки. Вы проиграли!")
    return


guess_number(randint(0, 100), 10)