"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""
def rec_met(i, numb, n_count, com_sum ):
    if i == n_count:
        print(f"Элементов : {n_count} , Сумма: {com_sum }")
    elif i < n_count:
        return rec_met(i+1,numb / 2 * -1, n_count , com_sum + numb)

try:
    N_COUNT = int(input("Введите элементы : "))
    rec_met(0, 1, N_COUNT, 0)
except ValueError:
    print("Введите число,а не строку")
