"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""

list1 = [1]


def func1(n, base=1.00):
    if n > 0:
        new_base = -base / 2
        list1.append(new_base)
        n -= 1
        return func1(n - 1, new_base)
    else:
        return sum(list1)


print(func1(3))
