"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
class OwnError (Exception):
    def __init__(self, txt):
        self.txt = txt


def req_reverse(user_number, reverse_str=''):
    return req_reverse(user_number // 10, reverse_str + str(user_number % 10)) if user_number >= 10 else reverse_str + str(user_number)


while True:
    try:
        user_number = int(input(f"Введите число:"))
        if user_number <= 0:
            raise OwnError("Введено не натуральное число!\n")
        print(req_reverse(user_number))
        break
    except ValueError:
        print('Введено не число!\n')
    except OwnError as err:
        print(err)



