"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    command = input('Введите операцию (+, -, *, /) или exit чтоб выйти: ')

    if command == 'exit':
        return print('Калькулятор выключен')
    else:
        if command == '+' or command == '-' or command == '*' or command == '/':
            try:
                a = int(input('Введите первое число: '))
                b = int(input('Введите второе число: '))

                if command == '+':
                    print('Сумма чисел - {}'.format((a + b)))
                    return calculator()

                elif command == '-':
                    print('Разность чисел - {}'.format((a - b)))
                    return calculator()

                elif command == '*':
                    print('Произведение чисел - {}'.format((a * b)))
                    return calculator()

                elif command == '/':
                    print('Частное чисел - {}'.format((a / b)))
                    return calculator()

            except ValueError:
                print('Вместо числа введена строка!')
                return calculator()

        else:
            print('Неверная команда, повторите ввод!')
            return calculator()


calculator()
