"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_n_el(n):
    return 1 if n == 1 else 1 + sum_n_el(n-1) / -2


while True:
    number = input('Введите количество элементов последовательности чисел: '
                   '1 -0.5 0.25 -0.125 ... (n > 0) \n>>> ')
    if number.isdigit() and int(number) > 0:
        break

number = int(number)
print(f'Сумма элементов последовательности {sum_n_el(number)}')
