"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.
Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ
Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""



def is_int(parametr_x):
    try:
        parametr_x = int(parametr_x)  #SDFA
    except ValueError:
        parametr_x = is_int(input('Вы ввели не цело число, введите, пожалуйста, число: '))
    return parametr_x


def make_back_form(slovar):
    number = int(slovar['number_copy'])
    if slovar['number'] == '0':
        slovar['back_form'] = '0'
    elif number != 0:
        slovar['back_form'] += str(number % 10)
        slovar['number_copy'] = number//10
        make_back_form(slovar)
    else:
        return
slovar ={'number': str(is_int(input("Введите число: "))),'back_form': ''}
slovar['number_copy'] = slovar['number']
make_back_form(slovar)
print(slovar['back_form'])