"""
Реализовать склонение слова «процент» для чисел до 20. Например, задаем число 5 — получаем «5 процентов», задаем
число 2 — получаем «2 процента». Вывести все склонения для проверки.
"""

list_1=['ов','','а','а','а','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов','ов']
for pct in range(21) :
    print('{} процент{}'.format(pct,list_1[pct]))


