"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1
Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple
sum_companies = int(input('Введите количество предприятий'))
profits = []

company_ex = namedtuple('company', 'name profit')
companies = []
for i in range(sum_companies):
    name = input(f'Введите название предприятия {i+1} : ')
    input_profit = sum(map(int, input(
        'через пробел введите прибыль данного предприятия за каждый квартал Всего 4 квартала').split()))
    profits.append(input_profit)
    cmp = company_ex(name, input_profit)
    companies.append(cmp)

middle_profit = sum(profits) / sum_companies

less_m_c = [i.name for i in companies if i.profit < middle_profit]
more_m_c = [i.name for i in companies if i.profit > middle_profit or i.profit == middle_profit]
print(f'Предприятия, с прибылью выше среднего значения: {less_m_c}')
print(f'Предприятия, с прибылью выше среднего значения:{more_m_c}')