
"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

"""
def fun():
    a = int(input("Введите 1 число: "))
    b = int(input("Введите 2 число: "))
    c = str(input("Введите знак операции: "))
    if c == '0':
        return 0
    else:
        if c in "+-*/":
            try:
                if c == '+':
                    print(f"Результат  {a+b}")
                    return fun()
                elif c == '-':
                    print(f"Результат {a-b}")
                    return fun()
                elif c == '*':
                    print(f"Результат {a*b}")
                    return fun()
                elif c =='/':
                    if b == 0:
                        print("Делить на 0 нельзя")
                        fun()
                    else:
                        print(f"Результат {a/b}")
                        fun()
            except ValueError:
                print("Введите число, а не строку")
                return fun()
        else:
            print("Введите верный знак")
            return fun()

fun()