"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""

import random

def fun(count,n):
    print(f"Попытка № {count}")
    answer=int(input("Введите число от 1 до 100: "))
    if count == 10 or answer == n:
        if answer == n:
            print("Угадали")
            return 1
        else:
            print(f"Не угадали,попытки закончились, загаданное число {n}")
            return 1
    else:
        if answer < n:
            print("Не угадали, ваше число меньше загаданного ")
            return fun(count+1,n)
        else:
            print("Не угадали, ваше значение больше загаданного")
            return fun(count+1,n)

fun(1,5)
