"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

"""

def fun(n):
    if (n<=1):
        return 1
    else:
        return(n + fun(n-1))

n=int(input("Введите число n: "))
print(f"n*(n+1)/2= { n*(n+1)/2 }")
print(f"1+2+...+n= {fun(n)}")