"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать где какая сложность.
Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
# Сложность O(n)
def findmin(list1):
    min=list1[0] # O(1)
    for i in list1: # O(n)
        if i < min: # O(1)
            min = i # O(1)
    print(min)
findmin([1,3,4,0])

# Сложность O(n^2)

def findmin2(list2):
    for i in list2: # O(n)
        min2=True # O(1)
        for j in list2: # O(n)
            if i > j : # O(1)
                min2 = False # O(1)
        if min2 == True: # O(1)
            print(i)
findmin2([1,2,3,4,5,6])