"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш
Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей
ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""
import hashlib
from uuid import uuid4


salt = uuid4().hex
password=input("ВВедите пароль: ")
hash_obj = hashlib.sha256(b"password")
hex_dig_res = hash_obj.hexdigest()
res = hashlib.sha256(salt.encode() + password.encode()).hexdigest()
print(res)

password_1=input("Введите пароль повторно: ")
res_1 = hashlib.sha256(salt.encode() + password_1.encode()).hexdigest()
if res_1 == res:
    print("Пароль верный")
else:
    print("Неверный пароль")

