"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"
Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносит ее в кэш
Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации
"""

from uuid import uuid4
import hashlib

salt = uuid4().hex
x = {}


def fun(url):
    if x.get(url):
        print("Адрес присутствует в кэше")
    else:
        res = hashlib.sha256(salt.encode() + url.encode()).hexdigest()
        x[url] = res
        print(x)


fun('https://geekbrains.ru/')
fun('https://geekbrains.ru/')
