"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


# Сложность: O(n^2)
my_lst = [22, 15, 16, 17, 2, 5, 22, 16, 17, 3, 2, 22]

def min_numb(lst):
    j = lst[0]
    for i in lst[1:]:
        if i < j:
            j = i
    return j

# Сложность: O(n)
def min_numb_two(lst):
    k = my_lst[0]
    i = 0
    while len(my_lst) > i:
        if my_lst[i] < k:
            k = my_lst[i]
        i += 1
    return k

print(min_numb(my_lst))
print(min_numb_two(my_lst))



