"""
Задание 1.

Для каждой из трех задач выполнить следующее:

1) для каждой инструкции рядом в комментарии определите сложность этой инструкции
2) определите сложность алгоритма в целом

укажите сложность непосредственно в этом файле
точки, где нужно поработать вам, отмечены знаком '!!!'
Не забудтье оценить итоговую сложность каждого из трех алгоритмов.

Примечание:
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

import random


#############################################################################################
def check_1(lst_obj):
    """Функция должна создать множество из списка.

    Алгоритм 3:
    Создать множество из списка

    Сложность: !!!.
    """
    lst_to_set = set(lst_obj)  # !!! сложность  линейная, зависит от n. В этом случае сложность len(lst_obj)
    return lst_to_set  # !!! возвращаем значение, сложность константа (время не зависит от n - количества элементов)


#############################################################################################
def check_2(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 1:
    Проходимся по списку и для каждого элемента проверяем,
    что такой элемент отстутствует
    в оставшихся справа элементах

    Сложность: !!!.линейно логарифмическая
    """
    for j in range(len(lst_obj)):          # !!! цикл один, значит уже линейная О-нотация, сложность len(lst_obj)
        if lst_obj[j] in lst_obj[j+1:]:    # !!! необходимо перебрать j+1 раз,с увеличением j количество сравнений будет уменьшатся, логарифмическая сложность сложность n, с учетом цикла получаем сложность n*log(n)
            return False                   # !!! возвращает значение, сложность константа
    return True                            # !!! возвращает значение, сложность константа


#############################################################################################
def check_3(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 2:
    Вначале выполним для списка сортировку, далее, сравниваем элементы попарно
    Если присутствуют дубли, они будут находиться рядом.

    Сложность: !!!линейная сложность
    """
    lst_copy = list(lst_obj)                 # !!! сложность константа
    lst_copy.sort()                          # !!! сложность линейно-логарифмическая
    for i in range(len(lst_obj) - 1):        # !!! цикл один, линейная сложность
        if lst_copy[i] == lst_copy[i+1]:     # !!! сравнение, сложность константа 1
            return False                     # !!! возвращает значение, сложность константа
    return True                              # !!! возвращает значение, сложность константа

#############################################################################################


for j in (50, 500, 1000, 5000, 1000):
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)

print(check_1(lst))
print(check_2(lst))
print(check_3(lst))
