"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


# первый вариант. Квадратичная сложность.

def list_min1(lst):
    min_lst1 = lst[3]
    for i in lst:
        if i < min_lst1:
            min_lst1 = i
    return min_lst1


# второй вариант. Линейная сложность.

def list_min2(lst):
    min_lst = sorted(lst)[0]
    return min_lst


my_lst = [num for num in range(1, 10)]
print(my_lst)
print(f'мин значение в списке вычесленное 1-ой функцией: {list_min1(my_lst)}')
print(f'мин значение в списке вычесленное 2-ой функцией: {list_min2(my_lst)}')
