"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_my(m):
    if m == 1:
        return 1
    else:
        return sum_my(m - 1) + m


m = int(input('Введите натуральное число:'))
print(f'По формуле n(n+1)/2 сумма равна {((m ** 2 + m) * 0.5)}, "/n", '
      f'по рекурсивной функции сумма равна {sum_my(5)})')


