"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple
from collections import defaultdict

mnf = namedtuple('mnf', 'profit_1 profit_2 profit_3 profit_4 avr_pr')  # прибыль по кварталам, avr_pr - сред прибыль
nam_s = defaultdict()  # для хранения названия компании и прибыли по кварталам (зна-ия - mnf, ключи - назв-я предпр)
sum_all = 0  # для расчета общей средней прибыли за год (по всем предприятиям)
n_low, n_high = "", ""  # для хранения названий предприятий с прибылью ниже и выше общего среднего значения

n = input('введите количество предприятий:')
for i in range(int(n)):
    nam = input(f'введите название предприятия {i+1}:')
    pr = input(f'введите прибыль за каждый квартал  предприятия {i+1}, через пробел:')
    sr = (int(pr.split()[0]) + int(pr.split()[1]) + int(pr.split()[2]) + int(pr.split()[3]))
    nam_s[nam] = mnf(int(pr.split()[0]),  int(pr.split()[1]), int(pr.split()[2]), int(pr.split()[3]), sr/4)   # исполь-
    # зуем  словарь

# расчет средней прибыли по всем предприятиям
for v in nam_s.values():
    sum_all += v.avr_pr  # используем доступ по имени параметра avr_pr  именованного кортежа  mnf
print(f'Средняя прибыль по всем предприятиям: {sum_all / len(nam_s)}')

# сортировка предприятий на предприятия со средней прибылью меньше и больше  общей средней
for r, v in nam_s.items() :
    if v.avr_pr < sum_all/len(nam_s):
        n_low += r + '  '
    else:
        n_high += r + '  '

print(f'Предприятия с прибылью меньше среднего значения: {n_low}')
print(f'Предприятия с прибылью больше среднего значения: {n_high}')


