"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


def check_min_1(lst_obj):  # O(n), этот алгоритм лучше, т к его сложность меньше
    min_el = lst_obj[0]
    for i in range(1, len(lst_obj)):
        if lst_obj[i] < min_el:
            min_el = lst_obj[i]
    return min_el


def check_min_2(lst_obj): # O(n^2)
    rez_min_el = lst_obj[0]
    min_el = lst_obj[0]
    for i in range(len(lst_obj)):
        for j in range(len(lst_obj)):
            if lst_obj[i] < lst_obj[j]:
                min_el = lst_obj[i]
        if rez_min_el > min_el:
            rez_min_el = min_el

    return rez_min_el


lst_obj = [2, 1, 3, 6]
print(check_min_1(lst_obj))
print(check_min_2(lst_obj))
