"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def firm_calk(n):
    firm_list = [namedtuple('firm', 'name profit') for i in range(n)]
    list_more = []
    list_less = []
    summ = 0
    for i in range(n):
        firm_list[i].name = input('Введите название предприятия: ')
        firm_list[i].profit = sum(list(map(int, input('через пробел введите прибыль данного предприятия '
                                                      'за каждый квартал(Всего 4 квартала): ').split())))

        summ += firm_list[i].profit
    summ /= n
    for el in firm_list:
        if el.profit > summ:
            list_more.append(el.name)
        elif el.profit < summ:
            list_less.append(el.name)

    return f'Предприятия, с прибылью выше среднего значения: {",".join(list_more)}\nПредприятия, с прибылью  нижк среднего значения: {",".join(list_less)}\n'


n = int(input('Введите количество предприятий: '))
print(firm_calk(n))
