"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import re

RE_NUM_FL = re.compile(r'\-*\d+\.\d+')
RE_NUM_INT = re.compile(r'\-*\d+')


class MyErr(Exception):
    def __init__(self, txt):
        self.txt = txt


def str_to_number(str):
    if not RE_NUM_FL.fullmatch(str):
        return int(str)
    else:
        return float(str)


def calc():
    oper = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    try:
        if oper == '0':
            return 1
        else:
            if oper in ('+-/*'):
                num1 = input('Введите первое число: ')
                num2 = input('Введите второе число: ')
                try:
                    if (not RE_NUM_INT.fullmatch(num1) and not RE_NUM_FL.fullmatch(num1)) or (not RE_NUM_INT.fullmatch(num2) and not RE_NUM_FL.fullmatch(num2)):
                        raise MyErr("Вы ввели некорректное число. Исправьтесь")
                    if oper == '/' and num2 == '0':
                        raise MyErr("Деление на ноль запрещено. Исправьтесь")
                except MyErr as err:
                    print(err.txt)
                else:
                    num1 = str_to_number(num1)
                    num2 = str_to_number(num2)

                    if oper == '+':
                        result = num1 + num2
                    elif oper == '-':
                        result = num1 - num2
                    elif oper == '/':
                        result = num1 / num2
                    elif oper == '*':
                        result = num1 * num2
                    print(f'Ваш результат {result}')

                calc()
            else:
                print('Вы ввели некорректную операцию. Исправьтесь')
                calc()
    except MyErr as err:
        print(err)
calc()