"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def rec_calc():
    num_1 = 0  # pycharm очень просил дать имена переменным до калькулятора
    num_2 = 0  # pycharm очень просил дать имена переменным до калькулятора
    operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operator == '0':
        quit()
    elif operator != '0' and operator != '/' and operator != '+' and operator != '-' and operator != '*':
        print('Введён неверный оператор, попробуйте ещё раз')
    else:
        try:
            num_1 = float(input('Введите первое число: '))
            num_2 = float(input('Введите второе число: '))
            help_var = True  # если получили float от чисел, то операторы запускаются
        except:
            print('Вместо  числа вы ввели строку (((. Исправьтесь.')
            help_var = False  # если не получили float от чисел, то операторы не запускаются
        if operator == '+' and help_var:  # без help_var получаем результат даже без float(num_1) и/или float(num_2)
            print(f'Ваш результат: {num_1 + num_2}.')
        elif operator == '-' and help_var:
            print(f'Ваш результат: {num_1 - num_2}.')
        elif operator == '*' and help_var:
            print(f'Ваш результат: {num_1 * num_2}.')
        elif operator == '/' and help_var:
            try:
                help_var = num_1 / num_2
                print(f'Ваш результат: {num_1 / num_2}.')
            except:
                print('На ноль делить нельзя')
    return rec_calc()


print('Программа складывает, вычитает, умножает или делит два числа.')
rec_calc()
