"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.
Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)
Пример:
рара - 6 уникальных подстрок
рар
ра
ар
ара
р
а
"""
import hashlib

my_set = set()  # множество для хранения хешированных подстрок
user_str = input('Введите строку для подсчёта уникальных подстрок: ')
for i in range(len(user_str)):
	for j in range(i + 1, len(user_str) + 1):
		if user_str[i:j] != user_str:  # исключаем саму строку
			my_set.add(hashlib.sha256(user_str[i:j].encode()).hexdigest())

print(f'Количество различных(уникальных) подстрок в строке: {len(my_set)}.')
