"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint


def guess_number(n, att, u_n):
    if att == 10:
        print('Попытки закончились, число не угадано')
        quit()
    elif u_n == n:
        print('Поздравляем, вы угадали число!')
        quit()
    elif u_n > n:
        print('Введённое число больше загаданного.')
        print(f'Можете попытаться ещё {10 - att} раз.')
        u_n = int(input('Введите число  '))
        att += 1
    else:
        print('Введённое число меньше загаданного.')
        print(f'Можете попытаться ещё {10 - att} раз.')
        u_n = int(input('Введите число  '))
        att += 1
    return guess_number(n, att, u_n)


print('В программе генерируется случайное целое число от 0 до 100.')
print('Попробуйте его отгадать. У вас 10 попыток.')
hidden_number = randint(0, 100)
user_number = int(input('Введите число  '))
attempt_counter = 1
guess_number(hidden_number, attempt_counter, user_number)
