"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.
Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75
Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def row_sum(counter, a, el_sum):
    if counter == 0:
        return el_sum
        quit()
    else:
        counter -= 1
        a = a / -2
        el_sum += a
    return row_sum(counter, a, el_sum)


print('Программа считает сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125.')
n = int(input('Введите количество элементов числового ряда '))
help_num = -2  # вспомогательное число для получения элементов
print(f'Количество элементов: {n}, их сумма: {row_sum(n, help_num, 0)}.')
