"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2
Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_num(n, h, s):
    if h == n:
        return s
        quit()
    else:
        h += 1
        s += h
    return sum_num(n, h, s)


print('Программа показывает, что для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2.')
n_left = int(input('Введите натуральное число, которое хотите подставить в формулу '))
n_right = n_left * (n_left + 1) / 2
help_num = 0
sum_numbers = 0
n_left = sum_num(n_left, help_num, sum_numbers)
print(f'В левой части формулы получили {n_left}.')
print(f'В правой части формулы получили {int(n_right)}.')
if n_left == n_right:
    print('Как видите, равенство выполняется.')
