"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.
Хотя в примерах к уроку уже есть вариант реализации слияния,
попробуйте предложить другой (придумать или найти).
И попытаться сделать замеры на массивах разной длины: 10, 100, 1000, ...
Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""
import timeit
from random import random


def merge_sort(rand_list):
    if len(rand_list) > 1:
        center = len(rand_list) // 2
        left = rand_list[:center]
        right = rand_list[center:]
        merge_sort(left)
        merge_sort(right)

        # перестали делить
        # выполняем слияние
        i, j, k = 0, 0, 0

        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                rand_list[k] = left[i]
                i += 1
            else:
                rand_list[k] = right[j]
                j += 1
            k += 1

        while i < len(left):
            rand_list[k] = left[i]
            i += 1
            k += 1

        while j < len(right):
            rand_list[k] = right[j]
            j += 1
            k += 1
        return rand_list


number = int(input('Введите число элементов: '))
original_list = []
for n in range(number):
    original_list.append(random() * 50)
print(f'Исходный массив: {original_list}.')
print(f'Отсортированный по возрастанию массив: {merge_sort(original_list[:])}.')
print('Время выполнения сортировки составляет: ',
      timeit.timeit('merge_sort(original_list[:])', number=1000, globals=globals()), '.', sep='')

"""
Результаты замеров (вывод списков не копировала):
Замеры на 10:
Время выполнения сортировки составляет: 0.04843549999999963.
Замеры на 100:
Время выполнения сортировки составляет: 0.7911033000000001.
Замеры на 1000:
Время выполнения сортировки составляет: 10.983100799999999.
"""