"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random

# Алгоритм сложностью O(n^2)


def min_el1(my_list):
    min_value = my_list[0]
    for i in range(len(my_list)):
        if min_value > my_list[i]:
            min_value = my_list[i]
    return min_value


# Алгоритм сложностью O(n)


def min_el2(my_list):
    return min(my_list)


my_list = [round(random.random() * 100) - 50 for num in range(1, 20)]

print(my_list)
print(min_el1(my_list))
print(min_el2(my_list))
