"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
import random

def check(count, number):
    n = int(input('введите число от 1 до 100: '))
    if count == 10 or n == number:
        if n == number:
            print("Вы угадали!")
        else:
            print('вы проиграли!')
    else:
        if number < n:
            print("Число слишком большое")
        else:
                 print("Число слишком маленькое")
        check(count+1, number)


number = random.randint(1,100)
print(number)
check(1, number)


