"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.


def search_min(some_list):
    min_num = some_list[0]          # O(1)
    for el_one in some_list:        # O(n)
        for el_two in some_list:    # O(n)
            if el_one < el_two:     # O(1)
                min_num = el_one    # O(1)
    return min_num                  # O(1)



Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.


def search_min(some_list):
    min_num = some_list[0]   # O(1)
    for el in some_list:     # O(n)
        if el < min_num:     # O(1)
            min_num = el     # O(1)
    return min_num           # O(1)


Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
