"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение
"""


def nums(user_number):

    if user_number != 0:
        numbers = user_number % 10
        user_number = user_number // 10
        print(numbers, end = '')
        return nums(user_number)





def revers_optimaze(n):     # оптимизирванный метод "переворота" числа
    return ''.join([i for i in str(n)[::-1]])

nums(123456789012345678901)
print()
print(revers_optimaze(123456789012345678901))
print(revers_optimaze('подводные камни'))

"""
Выполнил это задание в первом даже не догадываясь))
такой метод рекурсии намного лучше потому что с помощью него можно переворачивать не только числа
но и слова и даже предложения, со стандартным делением на 10 так не получится,
а также этот метод занимает меньше строк кода и расходует в разы меньше памяти

Рекурсивный переворот числа
	Используемая память - 0.00390625 MiB
	Время выполнения - 0.21850619999999976 cек

Оптимизированый переворот числа
	Используемая память - 0.0 MiB
	Время выполнения - 0.2158547000000004 cек
"""