"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


def sign_in(login, password):
    if login in users.keys() and users[login] == password and is_activate[login] is True:  # O(n)
        print('Вы вошли в систему.')
    elif login not in users.keys():    # O(n)
        print('Зарегистрируйте аккаунт.')
    elif users[login] != password:     # O(1)
        print('Неверный пароль!')
    elif is_activate[login] is False:  # O(1)
        print('Ваш аккаунт не активирован, активируйте его на своей почте.')

    # Итого: O(n).


def sign_in_two(login, password):
    if users.get(login):                     # O(1)
        if users[login] == password:         # O(1)
            if is_activate[login]:           # O(1)
                print('Вы вошли в систему.')
            else:
                print('Ваш аккаунт не активирован, активируйте его на своей почте.')
        else:
            print('Неверный пароль!')
    else:
        print('Зарегистрируйте аккаунт.')

    # Итого: O(1)

    # Вывод: не используйте in в таких случаях, если можно использовать методы словаря.


if __name__ == '__main__':

    users = {
        'RoMiTos': '12323099',
        'Durov': '55353535',
        'Clown': 'qwerty12'
    }

    is_activate = {
        'RoMiTos': True,
        'Durov': True,
        'Clown': False
    }

    sign_in('RoMiTos', '12323099')
    sign_in('Cum', '12345')
    sign_in('Durov', '')
    sign_in('Clown', 'qwerty12')

    print('\n---\n')

    sign_in_two('RoMiTos', '12323099')
    sign_in_two('Cum', '12345')
    sign_in_two('Durov', '')
    sign_in_two('Clown', 'qwerty12')
