"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1
Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

firms_list = []
firms = namedtuple('firm', ['name_firm', 'profit_firm'])


def input_data():
    firm_name = input("Введите название предприятия: ")
    profit = sum(list(map(int, input(
        "через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ").split())))
    firms_list.append(firms(firm_name, profit))
    return firms_list


def get_avrage_profit(f_l):
    a_p = round(sum([i.profit_firm for i in f_l]) / len(f_l), 2)
    return a_p


count = int(input("Введите количество предприятий для расчета прибыли: "))
for i in range(count):
    firms_list = input_data()
average_profit = get_avrage_profit(firms_list)
firm_less = [i.name_firm for i in firms_list if i.profit_firm < average_profit]
firm_more = [i.name_firm for i in firms_list if i.profit_firm > average_profit]
print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {firm_more}')
print(f'Предприятия, с прибылью ниже среднего значения: {firm_less}')
