"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def reverse(number: int):
    new_str = ''
    if number == 0:
        return new_str
    new_str = reverse(number // 10)
    return str(number % 10) + new_str


user_input = int(input('Введите число, которое требуется перевернуть: '))
print(f'Перевернутое число: {reverse(user_input)}')
