"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def number_input(operator):
    while True:
        try:
            num_1 = int(input('Введите первое число: '))
            break
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь')
    while True:
        try:
            num_2 = int(input('Введите второе число: '))
            if operator == '/' and num_2 == 0:
                print('На ноль делить нельзя. Повторите ввод.')
                continue
            break
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь')

    return num_1, num_2


def operator_input():
    user_input = False
    while user_input not in ('+', '-', '*', '/', '0'):
        user_input = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    return user_input


def calculator():
    operator = operator_input()
    if operator == '0':
        print('Всего доброго!')
        return None
    number_1, number_2 = number_input(operator)
    if operator == '+':
        print(number_1 + number_2)
    elif operator == '-':
        print(number_1 - number_2)
    elif operator == '*':
        print(number_1 * number_2)
    elif operator == '/':
        print(number_1 / number_2)
    calculator()


calculator()
