"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


# my_list = ['+', 9,2,3,5,20]

def get_sum(my_list):
    # базовый случай!!!
    if len(my_list) < 2:
        return 0
    else:
        # шаг рекурсии
        return my_list[1] + get_sum(my_list[1:])

def get_gen(my_list):
    # базовый случай!!!
    if len(my_list) < 2:
        return 1
    else:
        # шаг рекурсии
        return my_list[1] * get_gen(my_list[1:])

def get_minus(my_list):
    # базовый случай!!!
    if len(my_list) < 2:
        return 1
    else:
        # шаг рекурсии
        return my_list[1] - get_gen(my_list[1:])

def get_div(my_list):
    # базовый случай!!!
    if len(my_list) < 2:
        return 1
    else:
        # шаг рекурсии
        return my_list[1] / get_gen(my_list[1:])

i = 1
while i != 0:
    element1 = (input("Введите команду операции +, -, *, /:"))
    if element1 not in ('+','-','*','/','0'):
        element1 = (input("Вы ввели неверную команду. Введите команду операции +, -, *, /:"))
    elif  element1 == '0':
        i == 0
        print('exit')
        break
    else:
        my_list = []
        my_list.append(element1)
        for i in range(0, 2):
            element = int(input("Введите аргумент: "))
            my_list.append(element)
        if element1 == '+':
            print("Сумма элементов: ")
            my_sum = get_sum(my_list)
            print(my_sum)
        if element1 == '-':
            print("Разность элементов: ")
            my_minus = get_minus(my_list)
            print(my_minus)
        if element1 == '*':
            print("Умножение элементов: ")
            my_gen = get_gen(my_list)
            print(my_gen)
        if element1 == '/':
            if my_list[2] == 0:
                print('Ошибка! Деление на 0 зарещено')
                break
            else:
                print("Деление элементов: ")
                my_div = get_div(my_list)
                print(my_div)
