"""
Задание 5.**
Приведен наивный алгоритм нахождения i-го по счёту
простого числа (через перебор делителей).
Попробуйте решить эту же задачу,
применив алгоритм "Решето Эратосфена" (https://younglinux.info/algorithm/sieve)
Подсказка:
Сравните алгоритмы по времени на разных порядковых номерах чисел:
10, 100, 1000
Опишите результаты, сделайте выводы, где и какой алгоритм эффективнее
Подумайте и по возможности определите сложность каждого алгоритма.
Укажите формулу сложности О-нотация каждого алгоритма
и сделайте обоснование результатам.
"""

#функция eratosfen(i) взята у преподователя


import timeit


def simple(i):
    """Без использования «Решета Эратосфена»"""
    count = 1
    n = 2
    while count <= i:
        t = 1
        is_simple = True
        while t <= n:
            if n % t == 0 and t != 1 and t != n:
                is_simple = False
                break
            t += 1
        if is_simple:
            if count == i:
                break
            count += 1
        n += 1
    return n


def eratosfen(i):
    # O(n log(log n))
    """Используя алгоритм «Решето Эратосфена»"""
    n = 2
    l = 10000
    sieve = [x for x in range(l)]
    sieve[1] = 0
    while n < l:
        if sieve[n] != 0:
            m = n * 2
            while m < l:
                sieve[m] = 0
                m += n
        n += 1
    return [p for p in sieve if p != 0][i - 1]


i = 10
print(f'Время работы алгоритмов для поиска {i}-го простого числа')
print(f'- Простой - {timeit.timeit("simple(i)", globals=globals(), number=100)}')
print(f'- Решето - {timeit.timeit("eratosfen(i)", globals=globals(), number=100)}')
i = 100
print(f'Время работы алгоритмов для поиска {i}-го простого числа')
print(f'- Простой - {timeit.timeit("simple(i)", globals=globals(), number=100)}')
print(f'- Решето - {timeit.timeit("eratosfen(i)", globals=globals(), number=100)}')
i = 1000
print(f'Время работы алгоритмов для поиска {i}-го простого числа')
print(f'- Простой - {timeit.timeit("simple(i)", globals=globals(), number=100)}')
print(f'- Решето - {timeit.timeit("eratosfen(i)", globals=globals(), number=100)}')

'''
Время работы алгоритмов для поиска 10-го простого числа
- Простой - 0.0013097999999999999
- Решето - 0.30323469999999997
Время работы алгоритмов для поиска 100-го простого числа
- Простой - 0.17254410000000003
- Решето - 0.2813627000000001
Время работы алгоритмов для поиска 1000-го простого числа
- Простой - 27.8947464
- Решето - 0.31352930000000256

алгоритм «Решето Эратосфена» работает лучше при поиске простого числа с большим номером
'''