"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum(n):
    if n > 0:
        return n + sum(n - 1)
    else:
        return 0


def comp_func(user_number):
    l_number = sum(user_number)
    r_number = user_number * (user_number + 1) / 2
    print(f'Левая часть равенства: {l_number}')
    print(f'Правая часть равенства: {r_number}')
    if l_number == r_number:
        return 'верно'
    else:
        return 'не верно'


user_number = int(input('Введите целое число: '))
print(f'Равенство 1+2+3..n = n(n+1)/2 для числа {user_number} {comp_func(user_number)}')
