"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.
Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)
Пример:
рара - 6 уникальных подстрок
рар
ра
ар
ара
р
а
"""


def num_uniq_substr(s):
    list_sets = set()
    for i in range(1, len(s)):
        for j in range(len(s)):
            list_sets.add(hash(s[j:j + i]))
    return len(list_sets)


print(num_uniq_substr('papa'))
