"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def func_sum(x, n, counter):
    if counter < n:
        counter += 1
        print(x)
        return x + func_sum(x / (- 2), n, counter)
    else:
        return 0


n = int(input('введите количество членов ряда: '))
print(f"Количество элементов: {n}, их сумма: {func_sum(1, n, 0)}")

