"""
Задание 5.**

Приведен наивный алгоритм нахождения i-го по счёту
простого числа (через перебор делителей).

Попробуйте решить эту же задачу,
применив алгоритм "Решето Эратосфена" (https://younglinux.info/algorithm/sieve)

Подсказка:
Сравните алгоритмы по времени на разных порядковых номерах чисел:
10, 100, 1000

Опишите результаты, сделайте выводы, где и какой алгоритм эффективнее
Подумайте и по возможности определите сложность каждого алгоритма.

Укажите формулу сложности О-нотация каждого алгоритма
и сделайте обоснование результатам.
"""
from timeit import timeit


def simple(i):
    """Без использования «Решета Эратосфена»"""
    count = 1
    n = 2
    while count <= i:
        t = 1
        is_simple = True
        while t <= n:
            if n % t == 0 and t != 1 and t != n:
                is_simple = False
                break
            t += 1
        if is_simple:
            if count == i:
                break
            count += 1
        n += 1
    return n


number = int(input('Введите порядковый номер искомого простого числа: '))
print(simple(number))


def eratosfen_sieve(i):
    n = 2
    l = 10000
    sieve = [x for x in range(l)]
    sieve[1] = 0
    while n < l:
        if sieve[n] != 0:
            m = n * 2
            while m < l:
                sieve[m] = 0
                m += n
        n += 1
    set_sieve = set(sieve)
    set_sieve.remove(0)
    sieve = list(set_sieve)
    sieve.sort()
    return sieve[i - 1]


print(eratosfen_sieve(number))
print(timeit("simple(number)", globals=globals(), number=100))
print(timeit("simple(number)", globals=globals(), number=100))

"""
Порядковый номер числа - 10:
29
29
0.0016594000000003106
0.0013868999999999687

Порядковый номер числа - 100:
0.13413559999999958
0.13437540000000014

Порядковый номер числа - 150:
863
863
0.3385047000000001
0.3341536000000005

Порядковый номер числа - 1000:
7919
7919
21.8828037
21.7534254

Порядковый номер числа - 1000:
8329
8329
24.412236399999998
24.319626400000004

Порядковый номер числа - 1100:
8831
8831
27.3865483
27.2401162

До тскомого числа под 1000м номером оба алгоритма работают примерно одинаково, 
но функция без применения решета Эратосфена работает в среднем чуть быстрее.
С увеличением порядкового номера числа время работы обих функций замедляется +- в 100 раз.
После того, как искомы порядковый номер становится больше 1000, работа с решетом Эратосфена получается 
более эффективной.

Простой алгоритм имеет сложность O(n**2) из-за вложенных одна в другую операций сложностью О(n), 
алгоритм с решетом Эратосфена имеет сложность O(n log(log n)).
"""