"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


my_count = int(input ('введите количество фирм : '))

total_profit = 0
my_dict = {}

for i in range(my_count):
    my_key = input ('введите название фирмы : ')
    my_value = input ('введите название через пробел введите прибиль за каждый квартал : ')
    my_list = my_value.split(' ')
    firma = namedtuple(my_key, 'one two free four')
    firma_tuple = firma._make(my_list)
    profit = int(firma_tuple.one) +int(firma_tuple.two) + int(firma_tuple.free) + int(firma_tuple.four)
    my_dict[my_key] = profit
    total_profit += profit

avr_profit = total_profit / my_count

print(my_dict)
print('средняя выручка: ', avr_profit)
for i, j in my_dict.items():
    if j > avr_profit:
        print('прибыль выше среднего ', i)
    else:
        print('прибыль ниже срежнего ', i)
print('максимальная выручка у ',max(my_dict,key=my_dict.get))

