"""
4. Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.
Массив в этом задании строить нельзя!
Нужно решить без него!
Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75
Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def calc(x, i, count, common_sum, indication = ()):

    if count == i:
        print('Количество элементов - ', count, 'их сумма - ', common_sum)
    else:
        if indication == 0:
            x = x / 2
            print(-x)
            return calc(x, i+1, count, common_sum + -x, indication = 1)
        else:
            x = x / 2
            print(x)
            return calc(x, i+1, count, common_sum + x, indication = 0)


count = int(input('Введите количество элементов: '))

calc(2, 0, count, 0)

"""
x - начальное значение числа от которого начиналось вычисление
count - количесво элементов
i - как счетчик для количества элементов
common_summ - итоговая сумма элементов
indication - индикатор для реализации смены знака
"""
