"""
2. Написать программу сложения и умножения двух шестнадцатиричных чисел.
При этом каждое число представляется как массив, элементы которого это цифры числа.
Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Также попробуйте решить задачу вообще без collections и применить только ваши знания по ООП
(в частности по перегрузке методов)

__mul__
__add__

Пример:
Например, пользователь ввёл A2 и C4F.
Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’]
Произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

1. вариант
defaultdict(list)
int(, 16)
reduce

2. вариант
class HexNumber:
    __add__
    __mul__

hx = HexNumber
hx + hx
hex()
"""


import collections
import functools


nums = collections.defaultdict(list)


def input_numbers():
    for idx in range(1, 3):
        num = input('Введите 16-ое натуральное число: ')
        nums[f'{idx}-{num}'] = list(num)
    print(nums)


def sum_numbers():
    return list('%X' % sum(int(''.join(num), 16) for num in nums.values()))


def multi_numbers():
    return list('%X' % functools.reduce(lambda x, y: x * y, [int(''.join(num), 16) for num in nums.values()]))


if __name__ == '__main__':
    input_numbers()
    print(sum_numbers())
    print(multi_numbers())
