"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint

def guess(num: int, attempts=10, win=False):
    if win:
        print('Поздравляю, Вы ответили правильно')
        return True
    if attempts == 0:
        print('Увы, попытки закончились, ')
        return False
    temp = int(input(f'Угадайте задуманное число, у Вас {attempts} попыток '))
    if temp < num:
        print("Ваше число меньше задуманного ")
        guess(num, attempts - 1)
    if temp > num:
        print("Ваше число больше задуманного")
        guess(num, attempts - 1)
    if temp == num:
        win = True
        guess(num, attempts, win)


guess(randint(0, 100))