"""
Задание 1.
Реализуйте свои пользовательские функции, в которых реализуйте:
a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему
b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему
Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)
Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функцийф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
import datetime
import random
import time


def time_of_function(func):
    def wrapped(*args, **kwargs):
        start_time = time.time_ns()
        result = func(*args, **kwargs)
        print(f'Время работы функции : {time.time_ns() - start_time} наносек')
        return result
    return wrapped


@time_of_function
def create_list():
    my_list = [random.randint(1, 100) for i in range(50)]
    return my_list


@time_of_function
def create_dict():
    my_dict = {x: random.randint(1, 100) for x in range(1, 51)}
    return my_dict


@time_of_function
def add_in_list(elem, my_list):
    my_list.append(elem)
    return my_list


@time_of_function
def add_in_dict(k, v, my_dict):
    my_dict.update({k: v})
    return my_dict


@time_of_function
def del_from_list(my_list):
    my_list.pop()
    return my_list


@time_of_function
def del_from_dict(my_dict):
    my_dict.popitem()
    return my_dict


print("Функция создания списка")
created_list = create_list()
print(created_list)

print("Функция создания словаря")
created_dict = create_dict()
print(created_dict)

print("Добавление в список")
elem = 150
created_list = add_in_list(elem, created_list)
print(created_list)

print("Добавление в словарь")
k = 150
v = 300
created_dict = add_in_dict(k, v, created_dict)
print(created_dict)

print("Удаление из списка")
created_list = del_from_list(created_list)
print(created_list)

print("Удаление из словаря")
created_dict = del_from_dict(created_dict)
print(created_dict)


'''
Не сосвсем понял, но время , как ни крутил, рано 0

Функция создания списка
Время работы функции : 0 наносек
[35, 2, 25, 41, 36, 84, 17, 19, 52, 86, 28, 85, 76, 12, 18, 60, 82, 79, 23, 95, 7, 53, 46, 70, 37, 29, 29, 42, 62, 39, 97, 40, 24, 61, 78, 58, 37, 87, 18, 12, 46, 45, 16, 49, 28, 28, 43, 8, 94, 82]
Функция создания словаря
Время работы функции : 0 наносек
{1: 52, 2: 76, 3: 70, 4: 54, 5: 15, 6: 69, 7: 1, 8: 34, 9: 59, 10: 23, 11: 80, 12: 83, 13: 26, 14: 90, 15: 10, 16: 33, 17: 44, 18: 69, 19: 80, 20: 29, 21: 73, 22: 95, 23: 92, 24: 3, 25: 67, 26: 50, 27: 29, 28: 64, 29: 58, 30: 47, 31: 66, 32: 94, 33: 85, 34: 54, 35: 91, 36: 20, 37: 4, 38: 96, 39: 54, 40: 3, 41: 32, 42: 10, 43: 23, 44: 45, 45: 15, 46: 2, 47: 66, 48: 52, 49: 2, 50: 93}
Добавление в список
Время работы функции : 0 наносек
[35, 2, 25, 41, 36, 84, 17, 19, 52, 86, 28, 85, 76, 12, 18, 60, 82, 79, 23, 95, 7, 53, 46, 70, 37, 29, 29, 42, 62, 39, 97, 40, 24, 61, 78, 58, 37, 87, 18, 12, 46, 45, 16, 49, 28, 28, 43, 8, 94, 82, 150]
Добавление в словарь
Время работы функции : 0 наносек
{1: 52, 2: 76, 3: 70, 4: 54, 5: 15, 6: 69, 7: 1, 8: 34, 9: 59, 10: 23, 11: 80, 12: 83, 13: 26, 14: 90, 15: 10, 16: 33, 17: 44, 18: 69, 19: 80, 20: 29, 21: 73, 22: 95, 23: 92, 24: 3, 25: 67, 26: 50, 27: 29, 28: 64, 29: 58, 30: 47, 31: 66, 32: 94, 33: 85, 34: 54, 35: 91, 36: 20, 37: 4, 38: 96, 39: 54, 40: 3, 41: 32, 42: 10, 43: 23, 44: 45, 45: 15, 46: 2, 47: 66, 48: 52, 49: 2, 50: 93, 150: 300}
Удаление из списка
Время работы функции : 0 наносек
[35, 2, 25, 41, 36, 84, 17, 19, 52, 86, 28, 85, 76, 12, 18, 60, 82, 79, 23, 95, 7, 53, 46, 70, 37, 29, 29, 42, 62, 39, 97, 40, 24, 61, 78, 58, 37, 87, 18, 12, 46, 45, 16, 49, 28, 28, 43, 8, 94, 82]
Удаление из словаря
Время работы функции : 0 наносек
{1: 52, 2: 76, 3: 70, 4: 54, 5: 15, 6: 69, 7: 1, 8: 34, 9: 59, 10: 23, 11: 80, 12: 83, 13: 26, 14: 90, 15: 10, 16: 33, 17: 44, 18: 69, 19: 80, 20: 29, 21: 73, 22: 95, 23: 92, 24: 3, 25: 67, 26: 50, 27: 29, 28: 64, 29: 58, 30: 47, 31: 66, 32: 94, 33: 85, 34: 54, 35: 91, 36: 20, 37: 4, 38: 96, 39: 54, 40: 3, 41: 32, 42: 10, 43: 23, 44: 45, 45: 15, 46: 2, 47: 66, 48: 52, 49: 2, 50: 93}

'''
