"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
my_dict = {'monarh': 2000, 'saturn': 5000, 'bober': 4500, 'olimp': 3000, 'opus': 7000, 'tororo': 8000, 'snk': 5500}

"""1 вариант
   Сложность: Сложность: n Log n 
"""
sorted_values = sorted(my_dict.values(), reverse=True) #O(n Log n)
sorted_total = sorted_values[:3] #O(3)
sorted_dict = {} #O(1)
for i in sorted_total: #O(n)
    for k in my_dict.keys(): #O(n)
        if my_dict[k] == i: #O(1)
            sorted_dict[k] = my_dict[k] #O(1)
            break
print('1 вариант: ', sorted_dict)

"""2 вариант
   Сложность: Сложность: O(n^2) 
"""
my_dict = {'monarh': 2000, 'saturn': 5000, 'bober': 4500, 'olimp': 3000, 'opus': 7000, 'tororo': 8000, 'snk': 5500}

my_list = list(map(list, my_dict.items()))
my_list_new = []
my_max = my_list[0]
j = len(my_list)
while j != 1:
    for i in range(len(my_list)):
        if my_max[1] <= my_list[i][1]:
            my_max = my_list[i]
    my_list_new.append(my_max)
    my_list.remove(my_max)
    my_max =my_list[0]
    j = j - 1

print('2 вариант: ', my_list_new[:3])


"""вывод
  1 вариант легче с точки зрения написания кода, но по времени занимает больше.
  2 вариант сложнее записи кода, но т.к. получается сложность квадратичная то затраты по времени будет меньше. 
  2 вариант лучше т.к. сложность квадратичная
"""








