"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc():
    oper = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if oper == '0':
        print('Выход')
        return
    elif oper in ['+', '-', '*', '/']:
        x = chekinput(input('Введите первое число: '))
        y = chekinput(input('Введите второе число: '))
        if oper == '+':
            print('Ваш результат ' + sum(x, y))
        if oper == '-':
            print('Ваш результат ' + sub(x, y))
        if oper == '*':
            print('Ваш результат ' + mult(x, y))
        if oper == '/':
            print('Ваш результат ' + div(x, y))
    else:
        print('Вы ошиблись.')
    calc()


def chekinput(x):
    try:
        int(x)
    except ValueError:
        print('Вы вместо трехзначного числа ввели строку (((. Исправьтесь !')
        calc()
    else:
        return int(x)


def sum(x, y):
    return str(x + y)


def sub(x, y):
    return str(x - y)


def mult(x, y):
    return str(x * y)


def div(x, y):
    if y != 0:
        return str(round(x / y, 2))
    else:
        return 'бесконечность'


calc()
