"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
import random



a = [(random.randint(0,100)) for i in range (10)]
print(a)

#Сложность: N Log N логарифмическая.
def num_1():
    a.sort()   # O(N Log N)
    return a[0]

#Сложность: N**2 квадратичная.
def num_2():
    ln = a[0]
    for i in a:  # O(N)
        if i<ln: # O(N**2)
            ln=i
    return ln

print(num_1())
print(num_2())


# Надеюсь что правильно расставил сложности операций
#Да не смог придумать сложность О(N), но О(N Log N) же лучше)))
#
#


