"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно. Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)
"""


def checking_the_equation(num: int):
    if num == 0:
        return 0
    return num + checking_the_equation(num - 1)


length_of_the_set = int(input('Введите длину множества: '))
right_side = length_of_the_set*(length_of_the_set+1)/2
left_side = checking_the_equation(length_of_the_set)
if left_side == right_side:
    print('Равенство 1+2+...+n = n(n+1)/2 - ВЕРНО!!! ')
else:
    print('Равенство 1+2+...+n = n(n+1)/2 - НЕВЕРНО!!! ')
