"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""


def check_user(username, password, users):
    answer1 = 'Вы авторизованы'  # O(1)
    answer2 = 'Активируйте вашу учетную запись'  # O(1)
    answer3 = 'Неверный пароль'     # O(1)
    answer4 = 'Такой пользователь не зарегистрирован'       # O(1)
    if username in users.keys():                            # O(n)
        user_list = users.get(username)         # O(1)
        if password == user_list[0]:        # O(1)
            if user_list[1] is True:        # O(1)
                return answer1      # O(1)
            else:       # O(1)
                return answer2      # O(1)
        else:
            return answer3      # O(1)
    else:
        return answer4      # O(1)




users = {'Arty': ('password1', True),
         'Helen': ('password2', False),
         'Mark': ('password3', True),
         'Paul': ('password4', True),
         'Raul': ('password5', True),
         'Emma': ('password6', True),
         'Mike': ('password7', False)}
username = input('Введите имя пользователя: ')
password = input('Введите имя пароль: ')
print(check_user(username, password, users))
# user_list = users.get(username)
# print(user_list[0])
