"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
"""


def rotate_number(user_number, out_number):
    if user_number >= 10:
        if out_number is None:
            out_number = str(user_number % 10)
            user_number = user_number // 10
        else:
            out_number = "".join((out_number, str(user_number % 10)))
            user_number = user_number // 10
        rotate_number(user_number, out_number)
    else:
        out_number = "".join((out_number, str(user_number)))
        print(out_number)
        return


rotate_number(int(input('Введите число: ')), None)
