"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""
def sum1(lst):
    total = 0
    for element in lst:
        if len(lst) == 1:
            total = total + sum1(element)
        else:
            total = total + element
    return total


n = int(input('введите количество элементов '))
i = 1
my_list = [1]
while n!=0:
    if n > 1:
        i = i /2
        if len(my_list) % 2==0:
            my_list.append(i)
        else:
            my_list.append(-i)
    n = n-1

print(my_list)
print("Сумма элементов равна:", sum1(my_list))