"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
"""
Сложность: O(n)-линейная
"""
def check_1(my_list):
    my_min = my_list[0]
    for j in range(len(my_list)):
            if my_list[j] < my_min:
                my_min = my_list[j]
    return (my_min)

"""
Сложность: O(n^2)- квадратичная
"""
def check_2(my_list):
    for j in range(len(my_list) - 1, 0, -1):
        for i in range(0, j):
            if my_list[i] > my_list[i + 1]:
                my_list[i], my_list[i + 1] = my_list[i + 1], my_list[i]
    return (my_list[0])



"""-------------------------------------------------------------------"""


print(check_1([40, 4, 32, 90, 87, 10, 22, 3, 11, 16, 25]))

print(check_2([40, 1, 32, 90, 87, 10, 22, 2, 11, 14, 25]))