"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

from collections import Counter
from heapq import nlargest
import time

companies_profit = {
    'Роснефть': 708000000000,
    'Газпром': 1203000000000,
    'ЛУКОЙЛ': 640000000000,
    'Сбербанк России': 845000000000,
    'Российские железные дороги': 156000000000,
    'Ростех': 179000000000,
    'X5 Retail Group': 20000000000,
    'Сургутнефтегаз': 106000000000,
    'ВТБ': 202000000000,
    'Магнит': 10000000000,
    'Интер РАО': 82000000000
}

# Решение 1
start_val = time.time()
k = Counter(companies_profit)
three_max1 = k.most_common(3)
print('(1) Три компании с наибольшей годовой прибылью:')
for el in three_max1:
    print(el[0], ':', el[1], 'руб.')

end_val = time.time()

print(f'Операция заняла {check_1(10000)[1]} сек')

# Сложность данного решения: O(n)

# Решение 2
three_max1 = nlargest(3, companies_profit, key=companies_profit.get)
print('\n' '(2) Три компании с наибольшей годовой прибылью:')
for val in three_max1:
    print(val, ":", companies_profit.get(val), 'руб.')

# Сложность данного решения: O(n)

#Вывод по заданию: здесь оба решения одинаково сложные, так как в обоих случаях
# применяется линейная функуция.