"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.
Хотя в примерах к уроку уже есть вариант реализации слияния,
попробуйте предложить другой (придумать или найти).
И попытаться сделать замеры на массивах разной длины: 10, 100, 1000, ...
Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""

import timeit
import random


def merge_sort(lst_obj):
    if len(lst_obj) < 2:
        return lst_obj
    else:
        center = len(lst_obj) // 2
        left = merge_sort(lst_obj[:center])
        right = merge_sort(lst_obj[center:])

        return merge(left, right)


def merge(left, right):
    result = []
    i, j = 0, 0
    while i < len(left) and j < len(right):
        if left[i] < right[j]:
            result.append(left[i])
            i += 1
        else:
            result.append(right[j])
            j += 1
    while i < len(left):
        result.append(left[i])
        i += 1
    while j < len(right):
        result.append(right[j])
        j += 1
    return result


orig_list = [random.random() * 50 for _ in range(int(input('Введите число элементов: ')))]
print(f'исходный список - {orig_list}')
print(f'отсортированный список - {merge_sort(orig_list[:])}')
print(
    timeit.timeit(
        "merge_sort(orig_list[:])",
        globals=globals(),
        number=1000))


"""
Введите число элементов: 10
исходный список - [31.68700540317998, 40.36411051794554, 37.24449478467333, 31.083258840301426, 43.70903543965333, ...]
отсортированный список - [7.355882300778271, 21.140320563291155, 25.0619797259294, 31.083258840301426, 31.68700540317998, ...]
0.023808900000000133

Введите число элементов: 100
исходный список - [13.87840450208293, 46.20705668499716, 11.658381879430546, 7.224156682388639, 21.417153774482696, ...]
отсортированный список - [0.2782492042535556, 1.241798508838643, 2.345031678686438, 2.370348999543931, 2.641995490956961, ...]
0.37883120000000003

Введите число элементов: 1000
исходный список - [47.430899964888226, 43.81032360070823, 10.986427710479884, 23.02252565321042, 13.042727644242763, ...]
отсортированный список - [0.056726943709128896, 0.09802030532287676, 0.1379623253389306, 0.15073420890208133, 0.15574176193214884, ...]
5.279289899999999
"""