"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def counter(number: int):
    even_counter = 0
    not_even_counter = 0
    if number == 0:
        return even_counter, not_even_counter
    even_counter, not_even_counter = counter(number // 10)
    if number % 2 == 0:
        even_counter += 1
    else:
        not_even_counter += 1
    return even_counter, not_even_counter


user_input = int(input('Введите число: '))
print('Количество четных в числе равно {}, а нечетных цифр {}.'.format(*counter(user_input)))
