
"""
Задание 4. Вебинар 4 (27:05)
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес (def get_page(url)
и проверять есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.
Задание творческое. Здесь нет жестких требований к выполнению.
"""

from uuid import uuid4 # Модуль uuid применяется для генерации случайного числа
import  hashlib

salt = uuid4().hex # Соль - сгенерованное случайное число
print(salt)
cash_dict = {} # ХЕШ ТАБЛИЦА (словарь) = Хеш-функция + массмв. ХЕШ ТАБЛИЦА - определяет место хранения эл-тов при
               # помощи еш-функции

def get_page(url):
    if cash_dict.get(url): # Проверяем, есть ли в словаре (в кэше) страница url (ключ)
        print(f'Данный адрес {url} присутствует в кеше')
    else: # Если нет, то вносим ее в кэш, добавив СОЛЬ
        res = hashlib.sha256(salt.encode() + url.encode()).hexdigest()
        cash_dict[url] = res
        print(cash_dict)

get_page('https: //geekbrains.ru')





