"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.
Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.
Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).
ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib
from uuid import uuid4
import os



passw = input('Пароль: ')
salt = uuid4().hex
res = str(hashlib.sha256(passw.encode() + salt.encode()).hexdigest())
print(res)

with open('hash.txt', mode='x') as f:
    f.write(res)
    f.close()

passw_1 = input('Пароль: ')
res_1 = str(hashlib.sha256(passw_1.encode() + salt.encode()).hexdigest())
print(res_1)
with open('hash.txt', mode='r') as f:
    res_2 = f.readline()
    f.close()

if res_1 == res_2:
    print('ЕЕЕЕЕЕ')
else:
    print('ЧТОЖ ЗАНОВО')


os.remove('hash.txt')



