"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
from random import randint


# Первый вариант: сложность O(n^2)
def min_in_list(lst):
    for el in lst:
        is_min = True
        for el_2 in lst:
            if el > el_2:
                is_min = False
        if is_min:
            return el


# Второй вариант: сложность O(n)
def min_in_list_2(lst):
    min_el = lst[0]
    for el in lst:
        if min_el > el:
            min_el = el
    return min_el


if __name__ == '__main__':
    # тест
    lst1 = [randint(0, 100) for el in range(20)]
    print(lst1)
    print(min_in_list(lst1))
    print(min_in_list_2(lst1))
