"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def recur_method(i, numb, n_count, sum_elements):
    """Рекурсия"""
    if n_count == i:
        print(f"Количество элементов - {n_count}, их сумма - {sum_elements}")
    elif i < n_count:

        return recur_method(i + 1, numb / 2 * -1, n_count, sum_elements + numb)


n = int(input("Введите количество элементов: "))
recur_method(0, 1, n, 0)
