"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def hypothesis(n, i=0):

    if n == 1 and i == 0:
        return f'{n} = {n} * ({n} + 1) / 2'
    elif n == 1:
        return f'{n} + '
    elif i == 0:
        return hypothesis(n - 1, i + 1) + f'{n} = {n} * ({n} + 1) / 2'
    else:
        return hypothesis(n - 1, i + 1) + f'{n} + '


print(hypothesis(5))
print(hypothesis(1))
