"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random
number = random.randint(1, 100)
print(number)
cnt = 0
def guess_the_number():
    global cnt
    answer = int(input('Введите число: '))
    if number == answer:
        return print('Вы угадали')
    elif cnt == 10:
        return print(f'Вы проиграли, правильный ответ: {number}')
    elif number < answer:
        cnt += 1
        return print('Попробуй ещё раз, но возьми число поменьше'), guess_the_number()
    elif number > answer:
        cnt += 1
        return print('Попробуй ещё раз, но возьми число побольше'), guess_the_number()

guess_the_number()