"""

Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

"""
try:
    NUM = int(input("Введите номер латинской буквы(В алфавите 26 букв) : "))
    if 1 <= NUM <= 26:
        print(chr(NUM + 96))
    else:
        print("В алфавите 26 букв. Введите число в этом диапазоне(1-26).")
except ValueError:
    print("Вы ввели не целое число")
