"""

Написать программу, которая генерирует в указанных пользователем границах
●	случайное целое число,
●	случайное вещественное число,
●	случайный символ.
Для каждого из трех случаев пользователь задает свои границы диапазона.
Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

"""

from random import random


LEFT = int(input("Минимальная граница: "))
RIGHT = int(input("Максимальная граница: "))
NUMB = int(random() * (RIGHT - LEFT + 1)) + LEFT
print(NUMB)

LEFT = float(input("Минимальная граница: "))
RIGHT = float(input("Максимальная граница: "))
NUMB = random() * (RIGHT - LEFT) + LEFT
print(round(NUMB, 3))

LEFT = ord(input("Минимальная граница: "))
RIGHT = ord(input("Максимальная граница: "))
NUMB = int(random() * (RIGHT - LEFT+1) + LEFT)
print(chr(NUMB))
