"""

Пользователь вводит две буквы.
Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.

"""

A = ord(input("Введите 1-ую латинскую букву: "))
B = ord(input("Введите 2-ую латинскую букву: "))

if A == B:
    print("Вы ввели одинаковые буквы")
elif A < 97 or B < 97 or A > 122 or B > 122:
    print("Вы ввели не корректные буквы")
else:
    print(f"1-ая буква - {A - 96}  в алфавите")
    print(f"2-ая буква - {B - 96}  в алфавите")
    print(f"Между ними {B - A} букв") if B - A > 0 else \
        print(f"Между ними {(B - A) * -1} букв")
