"""

По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника,
составленного из этих отрезков.
Если такой треугольник существует, то определить, является ли он разносторонним,
равнобедренным или равносторонним.

"""
AB = float(input("Введите длину отрезка АВ: "))
AC = float(input("Введите длину отрезка АС: "))
BC = float(input("Введите длину отрезка ВС: "))

if AB + BC > AC and AB < AC + BC and BC < AC + AB:
    print("Треугольник существует")
    if AB != AC != BC:
        print("Треугольник разносторонний")
    elif AB == AC == BC:
        print("Треугольник равносторонний")
    elif AB == AC or AC == BC or AB == BC:
        print("Треугольник равнобедренный")
else:
    print("Треугольник с такими сторонами не существует")
