"""

Определить, является ли год, который ввел пользователем, високосным или не високосным.

"""
try:
    YEAR = int(input("Введите год для проверки високосности: "))
    if (YEAR % 4 == 0 and YEAR % 100 != 0) or YEAR % 400 == 0:
        print("Год високосный")
    else:
        print("Год не високосный")
except ValueError:
    print("Ошибка ввода")
