"""

Выполнить логические побитовые операции "И", "ИЛИ" и др. над числами 5 и 6.
Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

"""
NUM_1 = 5
NUM_2 = 6

print(f"NUM_1 = {NUM_1} или {NUM_1:04b}")
print(f"NUM_2 = {NUM_2} или {NUM_2:04b}\n")

print(f'Бинарный оператор "И": {NUM_1 & NUM_2} или {NUM_1 & NUM_2:04b}')
print(f'Бинарный оператор "ИЛИ": {NUM_1 | NUM_2} или {NUM_1 | NUM_2:04b}')
print(f'Бинарный оператор "Исключительное ИЛИ": {NUM_1 ^ NUM_2} или {NUM_1 ^ NUM_2:04b}')
print(f'Побитовое отрицание (NOT)": {~NUM_1} или {~NUM_1:04b}\n')

print(f'Побитовый сдвиг вправо: {NUM_1 >> 2} или {NUM_1 >> 2:04b}')
print(f'Побитовый сдвиг влево: {NUM_1 << 2} или {NUM_1 << 2:04b}')
