"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.
Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)
Пример:
рара - 6 уникальных подстрок
рар
ра
р
ара
ар
а
"""

#Были попытки решить через while, но с обрезкой потерпел крах

word = ('рара')
set_word = set()
print(type(word))

for i in range(len(word)):
    for j in range(i + 1, len(word) + 1):
        if word[i:j] != word:
            set_word.add(hash(word[i:j]))
print(set_word)




