"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib, uuid

salt = uuid.uuid4().hex
pass_hash = hashlib.sha256(bytes(input('Введите пароль: ') + salt, encoding='utf-8')).hexdigest()
print(pass_hash)
f = open('DZ_answer3_pass.txt', 'w')
f.write(pass_hash + ';' + salt)
f.close()

f = open('DZ_answer3_pass.txt', 'r')
data_hash_from_file = f.read().split(sep=';')
f.close()
pass_hash = hashlib.sha256(
    bytes(input('Введите пароль для проверки: ') + data_hash_from_file[1], encoding='utf-8')).hexdigest()
print(f'Хэш пароля: {data_hash_from_file[0]}')
print(f'Соль: {data_hash_from_file[1]}')
print('Вы ввели правильный пароль') if data_hash_from_file[0] == pass_hash else print('Вы ввели не правильный пароль')
