"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?


def unique(word):  # функция получилось очень сложной потому что я пытался ее сделать для любого слова а не только papa
    """Функция высчитывает уникальные подстроки для любоко слова"""
    string_hash = []
    count = 0
    while count < len(word):
        for i in range(1, len(word)):
            if count > i:
                continue
            elif count == 0 and i+1 == len(word):
                continue
            string_hash.append(hash(word[count:i+1]))
        count += 1

    return f'{word} - количество уникальных подстрок: {len(set(string_hash))}'


print(unique('papa'))
