"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""


def string_unique(string_in):
    for i in range(len(string_in)):
        for j in range(i, len(string_in)):
            if not string_in[i:j + 1] == string_in:
                string_uni.add(hash(string_in[i:j + 1]))
    return f'{string_in} - {len(string_uni)} уникальных подстрок'


string_uni = ''
string_uni = set(string_uni)


string_in = 'papa'
print(string_unique(string_in))
