"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?
papa = "papa"

def func1(s):
    set1 = set()
    for i in range(len(s)):
        for j in range(i + 1, len(s) + 1):
            if s[i: j] != s:
                set1.add(hash(s[i:j]))
    return len(set1)


print(func1(papa))

