"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

text = 'papa'

uniques = set()
for m in range(len(text)):
    for n in range(len(text) + 1):
        if n > m:
            if m == 0 and n == (len(text)):  # чтобы не включить само слово, выполняем эту проверку
                continue
            substring = hash(text[m: n])    # без использования hash результат тот же? или я не так понял задание
            uniques.add(substring)

print(uniques)
print(len(uniques))
