"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

import hashlib
from uuid import uuid4

salt = uuid4().hex
hash_obj = hashlib.sha256(salt.encode() + input("Введите пароль: ").encode('utf-8'))
hex_dig_res = hash_obj.hexdigest()
print('В базе данных хранится строка: ', hex_dig_res)
with open('password_storage.txt', 'w') as f:
    f.write(hex_dig_res)
hash_obj_check = hashlib.sha256(salt.encode() + input("Введите пароль еще раз для проверки: ").encode('utf-8'))
with open('password_storage.txt', 'r') as f:
    if hash_obj_check.hexdigest() == f.readline():
        print('Вы ввели правильный пароль')
    else:
        print('Пароли не совпадают!')

