"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?

def number_of_str(str):
    my_set = set()
    for i in range(len(str)):
        for j in range(i + 1, len(str) + 1):
            if str[i: j] != str:
                my_set.add(hash(str[i:j]))
    return len(my_set)


print(number_of_str('papa'))