"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
from hashlib import sha256


def make_hash(login, password):
    return sha256(login.encode() + password.encode()).hexdigest()


def reg():
    print("Регистрация")
    login = input('Введите логин:')
    password = input('Введите пароль:')
    with open('hash_file.txt', 'w+') as file:
        file.write(make_hash(login, password))


def log_in():
    print('Авторизация')
    login = input('Введите логин:')
    password = input('Введите пароль:')
    test_hash = make_hash(login, password)
    file = open('hash_file.txt', 'r')
    real_hash = file.read()
    if test_hash == real_hash:
        print('Вы вошли')
    else:
        print('Проверьте логин и пароль')
    file.close()


reg()
log_in()
