"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
from hashlib import sha256

cache = {}
salt = "Salt my cache"


def url_cache(url):
    res = cache.get(url)
    if res is None:
        url_hash = sha256(url.encode() + salt.encode()).hexdigest()
        cache[url] = url_hash
        print(f"Адрес '{url}' добавлен в кэш!")
    else:
        print(f"Адрес '{url}' уже кэширован!")


url_cache("gb.ru")
url_cache("gb.ru")
print(cache)
