"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""
def get_hash_set(in_str):
    """Returns substring hash set"""
    return set(hash(in_str[i:j]) for i in range(len(in_str)) for j in range(len(in_str)))

print(f"Во введенной строке {len(get_hash_set(input('Введите строку для работы:')))} уникальных подстрок.")
"""Учитывая свойства множества в Питоне операция ввычисления хэша абсолютно лишняя."""
