"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""


hashed_str = []
my_str = 'papa'
for i in range(len(my_str)):
    for j in range(i, len(my_str)):
        if my_str[i:j] != my_str:
            hashed_str.append(hash(my_str[i:j]))
print(set(hashed_str))
print(len(set(hashed_str)))
