"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""
from hashlib import sha1

s = input('Введите строку: ')


def func(s):
    len_ = len(s)
    hash_set = set()
    for i in range(len_):
        for j in range(i, len_+1):
            if s[i:j] and s[i:j] != s:
                hash_set.add(sha1(s[i:j].encode('utf-8')).hexdigest())

    return len(hash_set)


print(f'Количество подстрок: {func(s)}')