"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?


def num_strings(s):
    variety = set()
    n = len(s)

    for i in range(n):
        for j in range(i):
            value = hash(s[j:(n-i)])
            variety.add(value)

    return len(variety) + 1


string = input("Введите строку: ")
print(num_strings(string))
