import hashlib

"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?

my_str = 'papa'
my_set = set()

for i in range(len(my_str)):
    for j in range(i + 1, len(my_str) + 1):
        if my_str[i:j] != my_str:
            my_set.add(hash(my_str[i:j]))
            print(my_str[i:j], end='|')

print(f'\nКоличество уникальных подстрок: {len(my_set)}')
