"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def count_of_substrings(st):
    substrings = set()
    for i in range(1, len(st)):
        for j in range(len(st)):
            sub_st = st[j:j+i]
            substrings.add(hash(sub_st))
    return len(substrings)


print(count_of_substrings('papa'))
