"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

url : хеш-url


Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
from uuid import uuid4
import hashlib

cash_url = {}


def url_to_cash(url):
    salt = url[:10]
    res = hashlib.sha256(salt.encode() + url.encode()).hexdigest()
    if url in cash_url:
        print(url)
    else:
        cash_url[url] = res


url_to_cash('https://yandex.ru/')
url_to_cash('https://yandex.ru/')
print(cash_url)
