"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


#Функция должна принимать url-адрес и проверять
#есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

import hashlib
from uuid import uuid4

data = {}


def check_caching(url):
    r = data.get(url)
    if r is None:
        salt = uuid4().hex
        data[url] = hashlib.sha256(salt.encode() + url.encode()).hexdigest()


check_caching('www.utf-8.ru')
print(data)
check_caching('www.utf-8.ru')
print(data)
check_caching('www.utf-9.ru')
print(data)