"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""

str_start = 'papa'


def sum_unique():
    set_res = set(str_start[i:j] for i in range(len(str_start)) for j in range(i + 1, len(str_start) + 1) if len(str_start[i:j]) != len(str_start))
    return len(set_res)


print(sum_unique())