"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""


# -*- coding: utf-8 -*-

import hashlib


def hash_password():
    f = open("base.txt", "+w")
    passwd = input('Введите пароль: ')
    salt = 'rJIaBpbI6CeJIbXo3Hag3op'
    signature = hashlib.sha256(salt.encode() + passwd.encode()).hexdigest()
    f.write(signature)
    f.seek(0)
    print(f'В базу данных помещена следующая строка: {signature}')
    repeat_passwd = input('Введите пароль еще раз дял проверки: ')
    check_signature = hashlib.sha256(salt.encode()
                                     + repeat_passwd.encode()).hexdigest()
    for line in f.readlines():
        if line == check_signature:
            print(f'Пароли совпадают.')
        else:
            print('Пароли не совпадают!')


hash_password()
