"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""
# sqlite, postgres, db_api, orm

# Знаю, что стоило бы усложнить, но сроки поджимают, а домашку не успеваю вовремя делать.
# Мой косяк, в следующий раз постараюсь найти время и сделать всё качественно.


from hashlib import sha256

def create_password():
    user_login = input('Введите логин: ')
    user_password = input('Введите пароль: ')
    hash_obj = sha256(user_login.encode() + user_password.encode()).hexdigest()
    check = input('Введите пароль ещё раз: ')
    check_password = sha256(user_login.encode() + check.encode()).hexdigest()
    if hash_obj == check_password:
        print('Вы ввели правильный пароль')
    else:
        print('Вы ввели не правильный пароль!')

create_password()