"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""

result = []
word = 'papa'
for i in range(len(word)):
    for j in range(i + 1, len(word) + 1):
        if word[i:j] != word:
            result.append(hash(word[i:j]))
print(result)
res_set = set(result)
print(res_set)
print(f'Количество различных уникальных подстрок в слове: "{word}" - {len(res_set)}')
