"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

import hashlib

uniq_set = set()

s = 'papa'

for i in range(len(s)):
    for j in range(i+1, len(s) + 1):
        if s[i:j] != s:
            uniq_set.add(hashlib.sha256(s[i:j].encode()).hexdigest())

print(f'{s} - {len(uniq_set)} уникальных подстрок.')
print(uniq_set)

