"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

url : хеш-url


Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
# hash: url
import hashlib

cache_dict = {}


def cache_func(url):
    """Функция проверяет наличие url в кэше"""
    url_hash = hashlib.sha256(url.encode()).hexdigest()
    url1 = cache_dict.get(url_hash)
    if url1 is None:
        cache_dict[url_hash] = url
    return url


print(cache_dict)

cache_func('https://gb.ru')

print(cache_dict)
