"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

from uuid import uuid4
import hashlib

salt = uuid4().hex
print(f"Соль - {salt}")

passwd = input("Введите свой пароль: ")

with open("pass.txt", "wt") as file:
    file.write(hashlib.sha256(salt.encode() + passwd.encode()).hexdigest())

res = hashlib.sha256(salt.encode() + passwd.encode()).hexdigest()
print(res)

passwd_2 = input("Введите пароль еще раз: ")

if res == hashlib.sha256(salt.encode() + passwd_2.encode()).hexdigest():
    print("Вы ввели верный пароль")
else:
    print("Парль не совпадает")

print("Проверка через файл")

with open("pass.txt", "rt") as file:
    if file.readline() == hashlib.sha256(salt.encode() + passwd_2.encode()).hexdigest():
        print("Вы ввели верный пароль")
    else:
        print("Парль не совпадает")
