"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


user_str = str(input("Введите вашу строку:"))

print(f"Строка {user_str} имеет длину {len(user_str)} символов.")

subs_set = set()

for i in range(len(user_str)):
    for j in range(len(user_str) - 1 if i == 0 else len(user_str), i, -1):
        subs_set.add(hash(user_str[i:j]))

print(f"Количество уникальных подстрок в этой строке: {len(subs_set)}")
