"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

import hashlib
from uuid import uuid4

pass_db = open('hash_file_lesson_3.txt', 'w')
password = input("Введите пароль: ").encode('utf-8')
sal = uuid4().hex


def user_password(pas, salt, db):
    result_password = hashlib.sha256(salt.encode() + pas).hexdigest()
    db.writelines(result_password + '\n')


user_password(password, sal, pass_db)

pass_check = input("Введите пароль еще раз для проверки: ").encode('utf-8')
user_password(pass_check, sal, pass_db)
pass_db.close()

check = open('hash_file_lesson_3.txt', 'r')
lines = check.readlines()
print(f'В базе данных хранится строка: {lines[0]}')

if lines[0] == lines[1]:
    print("Вы ввели правильный пароль")
else:
    print("Вы ввели не правильный пароль")

check.close()

