"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib
import os

salt = os.urandom(32)


def hash_str(s):
    return hashlib.sha256(input(s).encode() + salt).hexdigest()


def identification():
    password = hash_str(input('Введите пароль: '))
    with open('pass', 'w+') as f:
        f.write(password)
        f.seek(0)
        print(f'В базе данных хранится строка: {f.read()}')
    check_password = hash_str(input('Введите пароль еще раз для проверки: '))
    with open('pass', 'r') as f:
        if f.read() == check_password:
            print('Вы ввели правильный пароль')
        else:
            print('Вы ввели неверный пароль')


if __name__ == '__main__':
    identification()