"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

s = 'papa'

def uniq(s: str, set_ = set()):
    if len(s) != 1:
        set_.add(hash(s[:-1]))
        set_.add(hash(s[1:]))
        return uniq(s[:-1], set_)
    return f'{len(set_)} уникальных подстрок'

print(f'{s} - {uniq(s)}')