"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.
Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.
Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).
ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
from hashlib import sha256
from uuid import uuid4

salt = uuid4().hex

password = input('Введите пароль:')
hash_password = (sha256((password.encode()) + salt.encode())).hexdigest()

print(f'В базе данных хранится строка: {hash_password}')
with open('hashes.txt', 'a', encoding='utf-8') as file:
    file.write(hash_password)

check_password = input('Введите пароль еще раз для проверки:')
hash_check_password = (sha256((check_password.encode()) + salt.encode())).hexdigest()
with open('hashes.txt', 'r', encoding='utf-8') as file:
    hashes = file.read()
if hash_check_password in hashes:
    print('Вы ввели правильный пароль')
else:
    print('Пароли не совпадают')
