"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""


def count_substring(s):
    res = set()
    for i in range(len(s)):
        for k in range(i, len(s)):
            if len(s) != len(s[i:k+1]):
                res.add(hash(s[i:k+1]))
    return res


hash_set = count_substring('papa')
print(f'{hash_set}, количество подстрок {len(hash_set)}')
