"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

from hashlib import sha256


def hash_pass(password):
    return sha256(password.encode() + login.encode()).hexdigest()


def check_pass():
    with open("password.txt") as q:
        password1 = q.read()
    pass_check = hash_pass(input('Введите пароль для проверки: '))

    if password1 == pass_check:
        end = 'Верный пароль'
    else:
        end = 'Неверный пароль'
    return end


login = input('Введите логин: ')
pass1 = hash_pass(input('Введите пароль: '))

print(pass1)

with open("password.txt", "w") as a:
    a.write(pass1)

print(check_pass())