"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""

import hashlib

need_set = set()

input_value = 'papa'

for letter_1 in range(len(input_value)):
    for letter_2 in range(letter_1 + 1, len(input_value) + 1):
        if input_value[letter_1:letter_2] != input_value:
            need_set.add(hashlib.sha256(input_value[letter_1:letter_2].encode()).hexdigest())

print(f'{input_value} - {len(need_set)} уникальных подстрок.')
