"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib
import json

password = input("Введите пароль: ")

salt = 'salt'
key = hashlib.sha256(salt.encode() + password.encode()).hexdigest()

# запись пароля в файл
with open('task_2.txt', 'w') as f:
    data = {'salt': salt, 'key': key}
    json.dump(data, f)

print("В базе данных хранится строка:", key)
check_pass = input("Введите пароль еще раз для проверки: ")

# чтение пароля из файла
with open('task_2.txt', 'r') as f:
    data = json.load(f)

# проверка пароля
key = hashlib.sha256(salt.encode() + check_pass.encode()).hexdigest()

print("Вы ввели правильный пароль" if data['key'] == key else "Пароль не верный")
