"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def search_unique():
    result_set = set()
    user_string = input("Введите строку -  ")
    for i in range(len(user_string)):
        for j in range(i + 1, len(user_string) + i):
            result_set.add(hash(user_string[i:j]))
    return f"Количество уникальных подстрок - {len(result_set)}"


print(search_unique())
