"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib
import uuid

user_pass = input(f"Введите пароль:")
salt = uuid.uuid4().hex.encode('utf-8')
hash_pass = hashlib.sha256(salt + user_pass.encode('utf-8')).hexdigest()
print(f'В БД пишем - {hash_pass}')
with open('pass.txt', 'w+', encoding='utf-8') as f:
    f.write(hash_pass)
user_pass = input(f"Повторите пароль:")
with open('pass.txt', encoding='utf-8') as f:
    hash_pass = f.read()
if hashlib.sha256(salt + user_pass.encode('utf-8')).hexdigest() == hash_pass:
    print("Пароли совпадают")
else:
    print("Пароли не совпадают")
