"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""
import hashlib

'''
рара
рар
ра
ар
ара
р
а
'''

s = input('ведите строку')
r = set()
N = len(s)
for i in range(N):
    if i == 0:
        N = len(s) - 1
    else:
        N = len(s)
    for j in range(N, i, -1):
        r.add(hashlib.sha1(s[i:j].encode('utf-8')).hexdigest())

print(f"кол-во посдтроек в строке {s} = {len(r)}")
