"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""
# sqlite, postgres, db_api, orm

import hashlib
from uuid import uuid4

user_password = input("Введите пароль ")


def hash_password(password, salt):
    result = hashlib.sha256(salt.encode() + password.encode()).hexdigest()
    print("В базе данных храниться строка: ", result)
    user_password_2 = input("Введите пароль повторно ")
    check = hashlib.sha256(salt.encode() + user_password_2.encode()).hexdigest()
    if result == check:
        print("Вы ввели верный пароль")
    else:
        print("Введён неверный пароль")


hash_password(user_password, uuid4().hex)
