"""
Задание 1.

Реализуйте свои пользовательские функции, в которых реализуйте:

a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему
b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

import time # Заполнение списка происходит быстрее исходя из замеров

def time_of_function(function):
    def wrapped(*args):
        start_time = time.perf_counter_ns()
        res = function(*args)
        print(time.perf_counter_ns() - start_time)
        return res
    return wrapped

@time_of_function
def main_list(j):
    list = []
    for i in range(j):
        x = input('Введите новый элемент списка: ')
        list.append(x)
    print(list)

@time_of_function
def main_dict(j):
    dict = {}
    for i in range(j):
        x = input('Введите имя ключа: ')
        y = input('Введите значение ключа: ')
        dict.update({x: y})
    print(dict)

main_list(3)
main_dict(3)




