"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

user_string = str(input("Введите строку: ")) # -> Получаем строку от пользователя

def search_substr(string):
    substring_set = set()
    # Режем строку на подстроки
    for i in range(len(string)):
        for j in range(len(string) - 1 if i == 0 else len(string), i, -1):
            substring_set.add(hash(string[i:j])) # -> добавляем хэшированную подстроку во множество
    return f"Количество различных подстрок в этой строке: {len(substring_set)}"

print(search_substr(user_string))
