"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
from hashlib import sha256


def password():
    with open("task_2.txt", "w+", encoding="utf-8") as pwd_hash:
        salt = "Криптографическая соль"
        pepper = "Криптографический перец"
        pwd = input("Введите пароль: ")
        hashed_pwd = sha256(pwd.encode() + salt.encode() + pepper.encode()).hexdigest()
        pwd_hash.write(f"{hashed_pwd}")
        pwd_hash.seek(0)
        read_pwd_hash = pwd_hash.read()
        print(f"В базе данных хранится строка: {read_pwd_hash}")
        check_pwd = input("Введите пароль ещё раз для проверки: ")
        check_hashed_pwd = sha256(check_pwd.encode() + salt.encode() + pepper.encode()).hexdigest()
        if check_hashed_pwd == read_pwd_hash:
            print("Вы ввели правильный пароль!")
        else:
            print("Пароль не верный!")


password()
