"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""


import hashlib
from uuid import uuid4


salt = uuid4().hex


def generate_hash(password):
    gen_hash = hashlib.sha256(salt.encode() + password.encode()).hexdigest()
    return gen_hash


password_1 = input('Введите пароль: ')
with open('hash_pass.txt', 'w', encoding='UTF-8') as f_object:
    f_object.write(generate_hash(password_1))

check_pass = input('Введите пароль повторно, для проверки: ')
with open('hash_pass.txt', 'r', encoding='UTF-8') as f_object:
    hash_pass = f_object.readline()
    if generate_hash(password_1) == hash_pass:
        print('Вы ввели верный пароль')
    else:
        print('Вы ввели неверный пароль')
