"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""
# sqlite, postgres, db_api, orm


from binascii import hexlify
from hashlib import pbkdf2_hmac
from uuid import uuid4

password = input("Введите пароль: ")
salt = uuid4().hex

# Здесь мы создаем хеш sha256 в пароле при помощи соли со 100,000 итераций.
obj = pbkdf2_hmac(hash_name='sha256',
                  password=password.encode(),
                  salt=salt.encode(),
                  iterations=100000)

result = hexlify(obj)

print(f'В базе данных хранится {result}')

password2 = input("Введите пароль повторно: ")
obj2 = pbkdf2_hmac(hash_name='sha256',
                   password=password2.encode(),
                   salt=salt.encode(),
                   iterations=100000)

if obj2 == obj:
    print("Пароли совпадают")
else:
    print("Пароли не совпадают")
