"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"
Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш
url : хеш-url
Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.
Задание творческое. Здесь нет жестких требований к выполнению.
"""

import hashlib

url = input('url: ')

cache = {'10dd6e016c6ddd709c730ea8db557c20a6e5a2558d5b73178bc68797bbb22e19': 'gb.ru'}


def check_url(u):
    hash_u = hashlib.sha256(u.encode()).hexdigest()
    if hash_u in cache.keys():
        return True
    else:
        return {hash_u: u}


check_url(url)

try:
    cache.update(check_url(url))
except TypeError:
    print("Такой объект уже есть в кэше")

print(cache)
