"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?

def unique(s, str_hash=[]):
    """
    Подсчет уникальных подстрок в передаваемой строке
    :param s: передаваемая строка
    :param str_hash: хэши уникальных подстрок
    :return: количество уникальных подстрок
    """
    print(s, end='')
    for k in range(2, len(s) + 1):
        str_hash.append(hash(s[1:k]))
        str_hash.append(hash(s[:k - 1]))

    return f' - уникальных подстрок: {len(set(str_hash))}'

print(unique('papa'))