"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

url : хеш-url


Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
import hashlib

url_dict = {}
salt = 'login'
def add_url(dct: dict, ur: str):
    if dct.get(ur) is None:
        dct.setdefault(ur, hashlib.sha256(ur.encode() + salt.encode()).hexdigest())
        return f'Хеш url {ur} занесен'
    else:
        return dct.get(ur)

print(add_url(url_dict, r'https://yandex.ru/'))
