"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
from uuid import uuid4
import hashlib
web_cache = set()
salt = uuid4().hex


def url_cache(website):
    web_cache.add(hashlib.sha256(salt.encode() + website.encode()).hexdigest())


url_cache('ya.ru')
url_cache('ip.net')
url_cache('ex.com')
url_cache('ya.ru')
print(web_cache)
