"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?

s = str(input("Введите строку S: "))
subs_set = set()

for i in range(len(s)):
    for j in range(len(s) - 1 if i == 0 else len(s), i, -1):
        subs_set.add(hash(s[i:j]))

print(f'Строка "{s}" имеет длину {len(s)} сиволов.')
print("Количество различных подстрок в этой строке:", len(subs_set))

