from random import randint
from time import sleep
from datetime import datetime

"""
Задание 1.

Реализуйте свои пользовательские функции, в которых реализуйте:

a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему
b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""


def check_time(func):
    start_time = datetime.now()
    func
    sleep(1)  # Поставил т. к. время отображалось как "0"
    return datetime.now() - start_time


def fill_lst(el):
    lst = [randint(0, 100) for i in range(el)]
    return lst


def fill_dict(el):
    usr_dict = {'User_' + str(key): randint(0, 100) for key in range(el)}
    return usr_dict


print(  # f'{fill_lst(10)}\n'
    # f'{fill_dict(10)}\n'
    f'Время выполнения фун-и заполнения списка: {check_time(fill_lst(10000))}.\n'
    f'Время выполнения фун-и заполнения словоря: {check_time(fill_dict(10000))}.\n')
