"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

import hashlib
from uuid import uuid4

def hash_passwd(pwd, slt):
    return hashlib.sha256(pwd.encode() + slt.encode()).hexdigest()

salt = uuid4().hex
passwd_1 = input('Введите пароль: ')

with open("hash.txt", 'w') as file:
    file.write(hash_passwd(passwd_1, salt))

with open("hash.txt") as file:
    hsh = file.read()
    print(f'В файле "hash.txt" хранится строка: {hsh}')

passwd_2 = input('Введите пароль еще раз для проверки: ')
if hash_passwd(passwd_2, salt) == hsh:
    print('Вы ввели правильный пароль')
else:
    print('Вы ввели не правильный пароль')
