"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

from hashlib import sha256


# Так как логина нет, привязывать соль не к кому. Так что просто поместим ее в функцию. Так будет удобнее.

def our_pass_hash(passwd):
    salt = 'Vasya'
    return sha256(salt.encode() + passwd.encode()).hexdigest()


with open(file='task_2_output.txt', encoding='UTF-8', mode='w+') as my_file:
    user_pass = input('Введите пароль: ')
    my_file.write(our_pass_hash(user_pass))
    my_file.seek(0)
    print('В базе данных хранится строка:', my_file.read())
    user_pass = input('Введите пароль еще раз для проверки: ')
    my_file.seek(0)
    print('Вы ввели правильный пароль') if my_file.read() == our_pass_hash(user_pass) else print(
        'Вы ввели неправильный пароль')

