"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""
# sqlite, postgres, db_api, orm

from uuid import uuid4
import hashlib

user_pass = input("Введите пароль: ")
salt = uuid4().hex
res1 = hashlib.sha256(salt.encode() + user_pass.encode()).hexdigest()
file_db = open('file_db.txt', 'w')
file_db.write(res1)
file_db.close()
print(f'В базе данных и в файле хранится строка: {res1}')

user_pass2 = input("Введите пароль еще раз для проверки: ")
res2 = hashlib.sha256(salt.encode() + user_pass2.encode()).hexdigest()
file_db = open('file_db.txt', 'r')
res1 = file_db.readline()
file_db.close()
if res1 == res2:
    print("Вы ввели правильный пароль")