"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?

import hashlib


def get_count(str):
    _set = set()
    for i in range(len(str)):
        for j in range(i + 1, len(str) + 1):
            hash_obj = hashlib.md5(str[i:j].encode())
            _set.add(hash_obj.hexdigest())

    print(f'Количество уникальный подстрок: {len(_set) - 1}')


get_count('papa')

