"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib
from uuid import uuid4


def pass_input(salt):
    password = input('Введите пароль: ')
    pass_hash = hashlib.sha3_256(salt.encode() + password.encode())
    return pass_hash


def add_password():
    salt = uuid4().hex
    pass_hash = pass_input(salt)
    print(type(pass_hash))
    pass_hash = pass_hash.hexdigest()
    with open('passwords.txt', 'w') as f:
        f.write(pass_hash)
    new_res = pass_input(salt).hexdigest()

    print(new_res == pass_hash)


add_password()
