"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def unique_checker(*args):
    s = set()
    count = 0
    for string in args:
        h = hash(string)
        if h in s:
            count -= 1
        else:
            s.add(h)
            count += 1
    print(f'В списке строк {count} уникальных строк')


unique_checker('papa')
