"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


import hashlib
from uuid import uuid4


def cash_web(url):
    salt = uuid4().hex.encode()
    hash_url = hashlib.sha256(salt + url.encode()).hexdigest()
    if url in dic.values():
        return 'Такой url-адрес уже есть.'
    else:
        dic.update({hash_url: url})
        return dic


dic = {}
while len(dic) != 3:
    print(cash_web(input('Введите url-адрес: ')))