"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

import hashlib
import uuid

with open('saved_pass.txt', 'w') as pass_file:
    pass_str = input('Введите пароль: ')

    salt = uuid.uuid4().hex
    save_pass_str = hashlib.sha256(salt.encode() + pass_str.encode()).hexdigest()
    print(f'salt = {salt}')
    print(f'saved pass string = {save_pass_str}')
    pass_file.write(save_pass_str)

    pass_str = input('Введите пароль повторно для проверки: ')
    if hashlib.sha256(salt.encode() + pass_str.encode()).hexdigest() == save_pass_str:
        print('Пароль введен верно!')
    else:
        print('Пароль введен неверно!')

# И тут что-то я упустил. В файл сохранен зашифрованный соленый пароль.
# Ок. В следующий раз при авторизации мы должны получить введенную строку с паролем,
# посолить, зашифровать и сравнить с сохраненным значением. Но как мы это сделаем,
# если соль генерится каждый раз разная? Т.е. соль, смешанная с паролем и записанная в файл, будет
# отличаться от той, которую мы будем генерить при авторизации. Где я что пропустил?
