"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


user_str = input('Введите строку состоящую только из строчных латинских букв: ')

substrs_set = set()
for i in range(len(user_str)):
    for j in range(i, len(user_str)):
        if user_str[i:j+1] != user_str:
            substrs_set.add(hash(user_str[i:j+1]))

print(f'Количество различных (уникальных) подстрок в введенной строке: {len(substrs_set)}')
