"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
salt = 'do crazy stuff'

import hashlib

dict_kesh = {}
def func(url):
    hash_url = hashlib.sha256(url.encode() + salt.encode())
    if hash_url not in dict_kesh:
        dict_kesh[hash_url] = url

url = 'https://gb.ru/lessons/158162'
func(url)