"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


text = 'papa'
set_obj = set()
for i in range(0, len(text)):
    for n in range(i + 1, len(text) + 1):
        set_obj.add(hash(text[i:n]))
set_obj.discard(hash(text))
print(f'Кол-во уникальных подстрок для строки {text} = {len(set_obj)}')
