"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""

import hashlib
from random import randint as ran


def pas_save():
    salt = str(ran(100, 1000))
    x = input('Entered password ')
    x = hashlib.sha256(x.encode('utf-8') + salt.encode('utf-8'))
    with open('file_password.txt', 'w') as file:
        file.write(x.hexdigest())
    return salt


def pas_ver(salt_x):
    y = input('Entered password ')
    y = hashlib.sha256(y.encode('utf-8') + salt_x.encode('utf-8')).hexdigest()
    with open('file_password.txt', 'r') as file:
        x = file.read()
        return x == y


if __name__ == '__main__':
    print('Вы ввели правильный пароль.') if pas_ver(pas_save()) else print('Вы ввели неправельный пароль.')
