"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""


def substrings(word):
    """
    Возвращает количетво подстрок в строке
    """
    substr = set()
    sub_length = 1
    for _ in range(len(word) - 1):
        for _ in range(len(word)):
            substr.add(hash(word[_:_ + sub_length]))
        sub_length += 1
    return len(substr)


print(substrings('рара'))
