"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?


def func(word):
    sub_s = set()
    for el in range(len(word)):
        for j in range(el + 1, len(word) + 1):
            sub_s.add(hash(word[el:j]))
    return sub_s


print(func('papa'))


