"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
import hashlib

cash = {}
while True:
    url = input("Введите адрес. Пустая строка - завершение работы. ")
    if not url:
        break
    url_hash = hashlib.sha256(url.encode() + url.encode()).hexdigest()
    if cash.get(url):
        print (f'Адрес уже есть в кэше')
    else:
        cash[url]=url_hash
        print(f'Адрес добавлен в кэш')

