"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib
from uuid import uuid4


def hash_password(value):
    salt = "password"
    return hashlib.sha256(salt.encode("utf-8") + value.encode("utf-8")).hexdigest()



def password():
    with open("hash.txt", 'w+', encoding='utf-8') as f:
        user_answer = input("Введите пароль: ")
        hash_obj = hash_password(user_answer)
        print(hash_obj)
        f.write(hash_obj)
        check_answer = input("Введите пароль еще раз для проверки: ")
        hash_obj_1 = hash_password(check_answer)
        print(hash_obj_1)
        f.seek(0)
        if hash_obj_1 == f.read():
            print("Вы ввели правильный пароль")
        else:
            print("Вы ввели не правильный пароль")


password()
"""
Пробывал добавить соль через uuid4, но при каждом формирование, формировался новый хэш.
Поэтому заменил на строку.
"""
