"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


import hashlib

word = input('Введите слово: ')
set_of_hash = set()


for i in range(len(word)):
    for j in range(i + 1, len(word) + 1):
        if word[i:j] != word:
            set_of_hash.add(hashlib.sha256(word[i:j].encode()).hexdigest())

print(f'Уникальных подстрок: {len(set_of_hash)}')




