"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""

s = input("Введите строку: ")  # d, f, g, df, fg
n = len(s)
hsh_unic = set()

for i in range(n):
    for k in range(i+1, n+1):
        if s[i:k] != s:
            hsh_unic.add(hash(s[i:k]))

print(f'{s} - число уникальных подстрок = {len(hsh_unic)}')

# print(hsh_unic)

