"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

hash_set = set()

# hash?
s = input("Enter string")

for j in range(1, len(s)):
    for i in range(len(s)):
        if i + j <= len(s):
            elem = s[i: i + j]
            h = hash(elem)
            hash_set.add(h)

print("len=", len(hash_set))
