"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

some_string = input('Введите строку')
some_set = set()

for i in range(len(some_string)):
    for j in range(i + 1, len(some_string) + 1):
        el = hash(some_string[i:j])
        if el != hash(some_string):
            some_set.add(el)

print(len(some_set))