"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def find_unique_substring(string):
    res = set()
    for i in range(1, len(string)):
        res.add(hash(string[i:]))
        res.add(hash(string[::-1][i:]))
    return len(res)


print(f'Количество уникальных подстрок: {find_unique_substring("sfdhgsfdhhssfh")}')
