"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

# hash?

def my_func(string):
    tmp = {}
    for i in range(len(string)):
        for el in range(i, len(string)):
            element = string[i:el + 1]
            tmp[hash(element)] = element
    tmp.pop(hash(string))
    print(f'{len(tmp)} уникальных подстрок \n')

my_func('papa')