"""
Задание 1.

Реализуйте свои пользовательские функции, в которых реализуйте:

a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему

b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!

a) Cловарь заполняется в среднем чуть медленнее, т.к. туда записывается ключ+значение
и по ключам строится индекс (хэш таблица). O(n) и там и там.
б) Поиск по значению в словаре значительно медленнее O(n), а вот по ключу практически
моментальный O(1). Собственно в этом смысл словаря - выдать моментально значение по ключу.

Замеры проведены с помощью декоратора. Список заполнялся числами от 1 до 1млн, словарь заполнялся
также, только добавлялись пары ключ=значение 1:1,2:2 и т.д. Был проведен 100 раз поиск произвольного
числа От 1 до 100млн в списке, в значениях словаря и в ключах словаря. Результаты теста прикладываю

Тест №1
fill_list время выполнения 0.04994392395019531
fill_dict время выполнения 0.05000877380371094
find_in_list время выполнения 0.8564951419830322
find_in_dict_values время выполнения 2.930009603500366
find_in_dict_keys время выполнения 0.0
Тест №2
fill_list время выполнения 0.04511761665344238
fill_dict время выполнения 0.06457757949829102
find_in_list время выполнения 0.8420953750610352
find_in_dict_values время выполнения 2.866082191467285
find_in_dict_keys время выполнения 0.0
Тест №3
fill_list время выполнения 0.047647953033447266
fill_dict время выполнения 0.04644417762756348
find_in_list время выполнения 0.8347549438476562
find_in_dict_values время выполнения 2.8831982612609863
find_in_dict_keys время выполнения 0.0
Тест №4
fill_list время выполнения 0.04814434051513672
fill_dict время выполнения 0.04722452163696289
find_in_list время выполнения 0.8224036693572998
find_in_dict_values время выполнения 2.8524551391601562
find_in_dict_keys время выполнения 0.0
Тест №5
fill_list время выполнения 0.05000472068786621
fill_dict время выполнения 0.04738783836364746
find_in_list время выполнения 0.837130069732666
find_in_dict_values время выполнения 2.8695733547210693
find_in_dict_keys время выполнения 0.0
Тест №6
fill_list время выполнения 0.05240797996520996
fill_dict время выполнения 0.04993009567260742
find_in_list время выполнения 0.8390665054321289
find_in_dict_values время выполнения 2.883876323699951
find_in_dict_keys время выполнения 0.0
Тест №7
fill_list время выполнения 0.04254770278930664
fill_dict время выполнения 0.05133414268493652
find_in_list время выполнения 0.8432846069335938
find_in_dict_values время выполнения 2.8888754844665527
find_in_dict_keys время выполнения 0.0
Тест №8
fill_list время выполнения 0.05016660690307617
fill_dict время выполнения 0.044931888580322266
find_in_list время выполнения 0.8499860763549805
find_in_dict_values время выполнения 2.8915750980377197
find_in_dict_keys время выполнения 0.0
Тест №9
fill_list время выполнения 0.045013427734375
fill_dict время выполнения 0.04988527297973633
find_in_list время выполнения 0.8498361110687256
find_in_dict_values время выполнения 2.8703718185424805
find_in_dict_keys время выполнения 0.0

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
import time
import random


def time_it(func):
    def func_with_time_count(*args):
        t1 = time.time()
        func(*args)
        t2 = time.time()
        delta = t2-t1
        print(f'{func.__name__} время выполнения {delta}')
    return func_with_time_count


@time_it
def fill_list(lst):
    for i in range(1, 1000000):
        lst.append(i)


@time_it
def find_in_list(lst):
    for i in range(1, 100):
        n = random.randint(1, 100000000)
        if n in lst:
            continue


@time_it
def find_in_dict_values(dct):
    for i in range(1, 100):
        n = random.randint(1, 100000000)
        for key in dct.keys():
            if dct[key] == n:
                continue


@time_it
def find_in_dict_keys(dct):
    for i in range(1, 100):
        n = random.randint(1, 100000000)
        if dct.get(n):
            continue


@time_it
def fill_dict(dct):
    for i in range(1, 1000000):
        dct[i] = i


for j in range(1, 10):
    print(f'Тест №{j}')
    test_list = []
    test_dict = {}
    fill_list(test_list)
    fill_dict(test_dict)
    find_in_list(test_list)
    find_in_dict_values(test_dict)
    find_in_dict_keys(test_dict)
