"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

url : хеш-url


Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
from hashlib import sha256

cache = {}
salt = 'some salt'


def cache_url(url):
    if url in cache.keys():
        print(f'Адрес {url} уже есть в кэше!')
    else:
        cache[url] = sha256(salt.encode() + url.encode()).hexdigest()


cache_url('https://www.gb.ru')
cache_url('https://www.gb.ru')
