"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""

import hashlib

s = input("Введите строку, состояфщую из строчных латинских букв ")
s_substring = set()

for i in range(len(s)):
    for j in range(len(s), i, -1):
        if s != s[i:j]:
            hash_s = hashlib.sha256(s[i:j].encode()).hexdigest()
            s_substring.add(hash_s)

print(s_substring)
print(f'Строка содержит {len(s_substring)} уникальных подстрок')

