"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""
input_str = 'ipa'
output_set = set()

for i in range(len(input_str)):
    for j in range(i + 1, len(input_str) + 1):
        if input_str[i:j] != input_str:
            output_set.add(hash(input_str[i:j]))
            print(input_str[i:j], end=' ')

print(f'\nКоличество уникальных подстрок: {len(output_set)}')