"""
Задание 1.

Реализуйте свои пользовательские функции, в которых реализуйте:

a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему
   И укажите сложность каждой ф-ции, которую вы применяете для заполнения.
   У этих ф-ций может быть разная сложность. Поэтому время заполнения списка и словаря может как совпадать, так и отличаться.
b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему
   И укажите сложность ф-ций, которые вы используете для операций.

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""


def benchmark(func):
    import time
    def wrapper(el):
        start = time.time()
        func(el)
        end = time.time()
        return f'Execution time {end - start}'
    return wrapper


@benchmark
def add_list(el):
    """ Difficult: O(n)
    """
    result_list = []
    for i in range(el):
        result_list.append(i)
    return result_list


print(add_list(45640), 'list')


@benchmark
def add_dict(el):
    """ Difficult: O(n)
    """
    result_dict = {}
    for i in range(el):
        result_dict[i] = str(i)
    return result_dict


print(add_dict(45640), 'dict')


""" Вывод: функция для заполнения списка и функция для заполнения словаря имеет
одинаковый уровень сложности, но  входе испытаний выеснилось что функция для заполнения списка 
быстре примерно в 3 раза, из за того что словарь, как я понял читая конспект, очень похож
или ваабще по сути одно и тоже с массивом, а свойства массива таковы что он не удобен для записи и удаления но прекрасно
потходит для просмотра информации, со списком наоборот удобен для записи и удаления но плох для чтения, (плох -
значит что скорость выполнения ниже чем у конкурента т.е. массива) поскольку в данном случая мы делаем запись
то словарь на поряддок медленне чем список
"""