"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если есть, получаем
если нет, то вносить ее в кэш

url : хеш-url


Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
import hashlib

var_str = {}
salt = '123'
def do_hash(url):
    if var_str.get(url):
        print(f'Данный адрес: {url} присутствует в кеше')
    else:
        res_hash = hashlib.sha256(salt.encode() + url.encode()).hexdigest()
        var_str[url] = res_hash
        print(var_str)

do_hash('http://mail.ru/')
do_hash('http://yandex.ru/')
do_hash('http://mail.ru/')
do_hash('http://gb.ru/')