"""
Задание 1.

Реализуйте свои пользовательские функции, в которых реализуйте:

a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему
b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
import time

x = 10000

def fill_list(n):
    start = time.time()
    my_list = [i ** 3 for i in range(n)]
    end = time.time()
    elapsed = end - start
    return elapsed


dict = {}
def fill_dict(n):
    start = time.time()
    for i in range(n):
        dict[i**2] = i ** 8
    end = time.time()
    elapsed = end - start
    return elapsed

print (fill_list(x))
print (fill_dict(x))
