"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносит ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации
"""
import hashlib

dict = {}

def url_save(db):
    url = input('https://www.')
    salt = url[:2]
    do_hash = hashlib.sha256(salt.encode() + url.encode()).hexdigest()
    if url in db:
        return db
    db[url] =  do_hash
    return f'Кэша не было'


while True:
    print(url_save(dict))
    # print(dict)


