"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def unique(word, sting_hash=[]):
    for k in range(2, len(word) + 1):
        sting_hash.append(hash(word[1: k]))
        sting_hash.append(hash(word[:k - 1]))

    return f'{set(sting_hash)}\nКоличество элементов: {len(set(sting_hash))}'

print(unique('papa'))
