"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""
import hashlib

bd = {'pasw_hash': []}  # -> бд, где хранится список хэшей


def session(bd):
    print('Авторизация')

    user_login = input('Enter your login: ').strip()
    user_pass = input('Enter your password: ').encode(encoding="utf-8")
    hash_passwd = hashlib.sha256(user_pass + user_login.encode(encoding="utf-8")).hexdigest()

    if hash_passwd in bd['pasw_hash']:
        return print('Авторизация прошла успешно')

    print('Данные в базе не найдены. Регистрация успешна. Пройдите авторизацию повторно!')

    bd['pasw_hash'].append(hash_passwd)

    return session(bd)


session(bd)
# sqlite, postgres, db_api, orm
