"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
import hashlib


def hashing(log, pas):
    salt_hash = hashlib.sha256(log.encode() + pas.encode()).hexdigest()
    print(salt_hash)
    with open('hashes.csv', 'a', encoding='utf-8') as f:
        f.write(salt_hash)


def checking(log, pas):
    salt_hash = hashlib.sha256(log.encode() + pas.encode()).hexdigest()
    print(salt_hash)
    with open('hashes.csv', 'r', encoding='utf-8') as f:
        hashes = f.read()
    if salt_hash in hashes:
        print('Вы ввели правильный пароль.')
    else:
        print('Ошибка. Вы ввели неверный пароль.')


login1 = input('Введите логин для регистрации: ')
password1 = input('Введите пароль: ')
hashing(login1, password1)

login2 = input('Введите логин для входа: ')
password2 = input('Введите пароль для проверки: ')
checking(login2, password2)
