"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносить ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования и хеш-таблиц
Можете условжнить задачу, реализовав ее через ООП
Не забудьте, что кэширование - механизм, а хеш-таблица - средство его реализации.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
import uuid
import hashlib

salt = uuid.uuid4().hex

password = input()
pass_hash = hashlib.sha256(salt.encode() + password.encode()).hexdigest()


cache = dict()


def check_url(url):
    url_salt = url.encode() + salt.encode()
    if url_salt in cache:
        print('Есть в кэше')
    else:
        # скачиваешь содержимое страницы в content
        cache[url_salt] = content