"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def substring(string, str_hash=[]):
    for i in range(2, len(string) + 1):
        str_hash.append(hash(string[1:i]))
        str_hash.append(hash(string[:i - 1]))
    return f'{string} содержит {len(set(str_hash))} уникальных подстрок'


print(substring('papa'))
print(substring('параллелепипед'))
