"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра!
ар
ара!
р
а!
"""


# воспользовался встроенной функцией hash
def leng_substr(world):
    my_set = set()
    for i in range(len(world)):
        for z in range(i, len(world)):
            my_set.add(hash(world[i:z + 1]))
    my_set.remove(hash(world))
    return len(my_set)


my_str = 'papa'
print(leng_substr(my_str))
print(leng_substr(input('Введите слово: ')))
