"""
Задание 1.

Реализуйте свои пользовательские функции, в которых реализуйте:

a) заполнение списка и словаря,
   сделайте замеры и сделайте выводы, что выполняется быстрее и почему
   И укажите сложность каждой ф-ции, которую вы применяете для заполнения.
   У этих ф-ций может быть разная сложность. Поэтому время заполнения списка и словаря может как совпадать, так и отличаться.
b) выполните набор операций и со списком, и со словарем,
   сделайте замеры и сделайте выводы, что и где выполняется быстрее и почему
   И укажите сложность ф-ций, которые вы используете для операций.
   Операцию clear() не используем.

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор для подсчета времени работы ваших пользовательских функций
И примените ее к своим функциям!

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""


from time import time

my_list = []
my_dictionary = {}
n = 10 ** 5


def time_decorator(function):
    def timer(*args, **kwargs):
        start = time()
        result = function(*args, **kwargs)
        end = time()
        print(f'Time of {function.__name__} performance equals to {end - start}')
        return result

    return timer


@time_decorator
def fill_list_append(lst, num):
    for i in range(num):
        lst.append(i)


fill_list_append(my_list, n)
print("#" * 20)

@time_decorator
def fill_list_insert(lst, num):
    for i in range(num):
        lst.insert(0, i)


fill_list_insert(my_list, n)

