"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а


Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
"""

vol = 'papa'

my_set = set()
for i in range(len(vol)):
    for j in range(len(vol[i:])):
        if hash(vol[i:j+1]) != 0:
            my_set.add(hash(vol[i:j+1]))
print(f'{vol} - {len(my_set)} уникальных подстрок')
