"""Рекурсия против цикла
Вывод чисел по убыванию, начиная с текущего и до нуля
"""


def count_cycle(i):
    """Цикл"""
    while i >= 0:
        print(i)
        i -= 1


count_cycle(3)


def count_recur(i):
    """Рекурсия"""
    print(i)
    # базовый случай (шаг завершения рекурс. вызовов)
    if i <= 0:
        return
    # рекурсивный случай (вызов ф-ции из себя)
    count_recur(i-1)


count_recur(3)

"""
1. Написать базовый случай
2. Написать шаг рекурсии
3. ПРАВИЛЬНО! определить как изменятся входные аргументы в рекурсивных вызовах
"""
