"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum_by_recursion(number):
    """
    получить сумму всех натуральных чисел от 1 до number с помощью рекурсии
    """
    if number == 1:
        return 1
    return number + get_sum_by_recursion(number - 1)


def get_sum_by_formula(number):
    """
    получение суммы всех натруальных числе от 1 до number по формуле
    """
    return int(number * (number + 1) / 2)


def ask(number):
    """
    С каждым шагом проверяет следующее число
    Пользователь должен ввести "yes" чтобы увидеть следующий шаг
    Таким образом он проверить формулу столько раз, сколько ему нужно
    """
    print(f'Проверка для n = {number}:')
    print(f'Сумма через рекурсию (1+2+...+n) = {get_sum_by_recursion(number)}')
    print(f'Сумма через формулу (n(n+1)/2) = {get_sum_by_formula(number)}')

    if input(f'Продолжить проверку для n = {number + 1}? yes/no: ') == 'yes':
        ask(number + 1)


print('Проверяем, что для любого числа, 1+2+...+n = n(n+1)/2')
ask(1)
