"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
Правой части в рекурсии быть не должно!!! Необходимо сравнить результат, который даст рекурсивная ф-ция
со значением, полученным в правой части (здесь нужно просто подставить n и подсчитать)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def numb_sum(count, numb=1):
    if count == 1:
        return numb
    else:
        return numb + numb_sum(count - 1, numb + 1)


if __name__ == '__main__':
    cnt = 5
    if numb_sum(cnt) == cnt * (cnt + 1) / 2:
        print('Уравнение верно')
    else:
        print('Уравнение неверно')
