"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum(number, step=1, summa=1.):
    new_summa = -summa / 2
    return summa if step == number else summa + get_sum(number, step + 1, new_summa)


print(get_sum(3))

while True:
    try:
        number = int(input('Введите количество элементов: '))
    except ValueError:
        print('Вы ввели не натуральное число! Повторите ввод!')
        continue

    print(f'Количество элементов: {number}, их сумма: {get_sum(number)}')
