"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum(number, step=1, amount=1.):
    new_amount = -amount / 2
    return amount if step == number else amount + get_sum(number, step + 1, new_amount)


def ask():
    """
    функция предлагает ввести данные
    """
    try:
        number = int(input('Введите количество элементов (для выходы введите "0"): '))
        if number == 0:
            return
        print(f'Количество элементов: {number}, их сумма: {get_sum(number)}')
    except ValueError:
        print('Вы ввели не натуральное число! Повторите ввод!')

    ask()


print('get_sum(3):', get_sum(3))

ask()
