"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_reversed_number(number):
    """ переворачиваем число """
    return str(number) if number < 10 else str(number % 10) + get_reversed_number(number // 10)


print(123, get_reversed_number(123))
print(1230, get_reversed_number(1230))

while True:
    try:
        number = int(input('Введите число, которое требуется перевернуть: '))
    except ValueError:
        print('Вы ввели не натуральное число! Повторите ввод!')
        continue

    print('Перевернутое число: ', get_reversed_number(number))
