"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить не нужно!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def numb_sum(numb, result=1.0):
    if numb == 1:
        return result
    else:
        return result + numb_sum(numb - 1, (result * (- 0.5)))


if __name__ == '__main__':
    numb_input = int(input('Введите колличество элементов:'))
    print(numb_sum(numb_input))
