"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def guess_number(number, attempt, attempt_cnt):
    if attempt >= attempt_cnt:
        print(f'Вы не угадали! Это число {number}')
        return

    user_number = int(input(f'Отгадайте число от 0 до 100 (попытка {attempt}): '))

    if user_number == number:
        print(f'Вы угадали! Это число {number}! Количество попыток {attempt}')
        return
    elif user_number < number:
        print(f'Число больше {user_number}')
    else:
        print(f'Число меньше {user_number}')

    guess_number(number, attempt + 1, attempt_cnt)


guess_number(random.randint(0, 100), 0, 10)
