"""
Задание 2.
Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
"""
def first_function(min_value):
    for el in min_value:
        min_el = True
        for i in min_value:
            if el > i:
                min_el = False
            if min_el:
                return el

a = (1, 3, 4, 8, 5, 9, 6)
print(first_function(a))

"""
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

def second_function(min_value):
    lst = min_value[0]
    for el in range(len(min_value)):
        if lst >= min_value[el]:
            lst = min_value[el]
    return lst

a = (1, 3, 4, 8, 5, 9, 6)
print(second_function(a))