"""
Задание 3.
Определить количество различных (уникальных) подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените вычисление хешей для подстрок с помощью хеш-функций и множества
Можно воспользоваться ф-цией hash() (см. материалы к уроку)

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


def get_unique_sub_string_count(word):
    """
    получить количество уникальных подстрок
    """

    sub_words = set()

    for i in range(len(word)):
        for j in range(i + 1, len(word) + 1):
            sub_words.add(hash(word[i:j]))

    return len(sub_words.difference({hash(word)}))


print(get_unique_sub_string_count('papa'))
