"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш.

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей.

Самый просто вариант хранения хешей - просто в оперативной памяти (в переменных).

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Обязательно усложните задачу! Добавьте сохранение хеша в файле и получение его из файла.
А если вы знаете как через Python работать с БД, привяжите к заданию БД и сохраняйте хеши там.
"""
from hashlib import sha256


def password_input(salt):
    pass_input = input('Введите пароль: ')
    hash_pass = sha256((salt + pass_input).encode('utf-8')).hexdigest()
    print(hash_pass)
    with open('hash_data', 'a') as f:
        f.write(hash_pass + '\n')


def password_check(salt):
    pass_input = input('Повторите ввод пороля: ')
    hash_pass = sha256((salt + pass_input).encode('utf-8')).hexdigest()
    print(hash_pass)
    with open('hash_data', 'r') as f:
        for el in f:
            if el == hash_pass + '\n':
                return 'Пароль введён верно'
        return 'Пароль введён неверно'


if __name__ == '__main__':
    hash_salt = 'salt123'
    password_input(hash_salt)
    print(password_check(hash_salt))
