"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение
"""
from task_1_1 import memory_time_profiler


@memory_time_profiler
def func_shell(n):
    def summ(n):
        return n if n == 0 else 1 + summ(n - 1) / -2


func_shell(5)

"""
Время выполнения: 0.23191280000000003
Используемая память: 0.00390625 MiB
Подводным камнем является то, что если профилировать рекурсивную функцию без функции-оболочки,
то замеры буту делаться не по функции в целом, а на каждый вызов. Решением является
использование внешней функции, которая и будет декорироваться.
"""
