"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

from memory_profiler import profile


def recursion(number):

    if number == 0:

        return number

    else:

        return number + recursion(number - 1)


@profile()
def wrap_recursion(function, number):

    return function(number)


wrap_recursion(recursion, 3)

'''
-----------------------------------------------------------------------------------------------------------------------
При использовании только декоратора @profile для рекурсивнйо функции, то мы получаем отдельную таблицу на каждый вызов
рекурсии.
-----------------------------------------------------------------------------------------------------------------------
А чтобы получить одну таблицу нужно "обернуть" рекурсивную функцию в другую функцию и ее (функцию с оберткой),
мы декорируем.
-----------------------------------------------------------------------------------------------------------------------
Всю аналитику можно проверить через результаты, они размещены ниже.
-----------------------------------------------------------------------------------------------------------------------
Результаты:
-----------------------------------------------------------------------------------------------------------------------
Line #    Mem usage    Increment  Occurences   Line Contents
============================================================
    19     19.5 MiB     19.5 MiB           1   @profile()
    20                                         def recursion_wrap(func, number):
    21     19.5 MiB      0.0 MiB           1       return func(number)
-----------------------------------------------------------------------------------------------------------------------
'''