"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""
from memory_profiler import profile


@profile
def wrapper(val):
    def get_sum(base):
        return 1 if base == 1 else (base % 2 * 2 - 1) * (1 / (2 ** (base - 1))) + get_sum(base - 1)

    return get_sum(val)


print(wrapper(7))

"""
При профилировнии фуркции с рекурсией, профилировка будет выполняться для каждого вызова рекурсивной
функции. Чтобы этого избежать, необходимо "обернуть" рекурсинвую функцию в другую функцию 
и делать профилировку уже для этой внешней  функции.

"""