from memory_profiler import profile

"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""


# @profile
def factorial(n):
    if n == 0:
        return 1
    else:
        return n * factorial(n - 1)


@profile
def func_shell(func, n):
    return func(n)


# print(f'{factorial(100)}')
print(f'{func_shell(factorial, 100)}')

"""
Если профилировать рекурсивную функцию то, @profile будет срабатывать для каждого вызова.
Самый простой способ этого избежать это создание оболочки и профилировать через неё.
"""