"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

from memory_profiler import profile

'''
Для примера взял задание со 2 урока, которое решали через рекурсию - Вывести на экран коды и символы таблицы ASCII, 
начиная с символа под номером 32 и заканчивая 127-м включительно. Соответственно для замера потребляемой памяти
рекурсией нужно сделать функцию-обертку.
'''


@profile
def wrapper():
    def asc_func(n=32):
        if n == 128:
            return None
        print(f"{n:5} - {chr(n)}", end=" ")
        if (n - 31) % 10 == 0:
            print(f'{n:5} - {chr(n)}')
        asc_func(n + 1)

    return asc_func()


wrapper()
