"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

from memory_profiler import profile


@profile
def factorial(n):
    if n <= 1:
        return 1
    else:
        return n * factorial(n - 1)


x = 10
factorial(x)


@profile
def wrapper():
    return factorial(x)


wrapper()

"""
    При оценке скриптов с рекурсией профилировщик подсчитывает количество использованной памяти для каждой итерации и 
указывает количество вызовов (вхождений).
    Данной ситуации можно избежать, дополнительно обернув рекурсивную функцию в обычную, и в дальнейшем вызов
профилировщика уже выполнять на функции-обертке. При этом профилировщик показывает один вызов функции и общий объем
ратраченной на неё памяти.
"""
