"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение
"""
from memory_profiler import profile


@profile
def even_odd(number, even=0, odd=0):
    '''
    профилировать будет неудобно, так как на каждый вызов будет вызываться профилировщик.
    скорее всего при последнем вызове мы получим итоговую статистику, которая получилась
    нарастающим итогом.
    думаю, что при значительном количестве вызовов что-то пойдет не так ))
    '''
    if number < 1:
        return f'Количество четных и нечетных цифр в числе равно: ({even}, {odd})'
    if number % 10 % 2 == 0:
        even += 1
    else:
        odd += 1
    return even_odd(number // 10, even, odd)


@profile
def my_func(*args):
    '''
    думаю, что решение в однократной профилировке функции-обертки
    '''
    return even_odd(*args)


print(my_func(12332224))
