"""
Задание 2.*
Предложить еще какие-либо варианты (механизмы, подходы, библиотеки, идеи)
для оптимизации памяти и
доказать!!! (наглядно, кодом) их эффективность (на примере профилировщика).
"""

"""
Мои две основные идеи: для оптимизации необходимо учиться мыслить аналитически и тщательно изучать тонкости 
языка программирование, на котором создается программа.
В пример я хотел бы использовать скрипты, которые сравнивал в первом задании: алгоритмы по подсчету простого числа, и 
по подсчету чисел Фиббоначи.
В оригинальном решете Эратосфена, мы создаем огромный список чисел, в оптимизированном обходимся без него.
В реализации алгоритма по подсчету чисел Фиббоначи, благодоря динамической типизации Python появляется возможность
создать очень оптимальное решение, всего с двуми переменными (fib_num()).
"""



