"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение
"""
from memory_profiler import profile

@profile
def func():
    def reversal(n, count=''):
        if n == 0:
            print(f'Перевернутое число: {count}')
        else:
            count += str(n % 10)
            return reversal(n // 10, count)

if __name__ == '__main__':
    func()

"""
Для замера рекурсии через profile, нужно рекурсию обернуть в другую функцию и не будет многократных вызовов.
"""