"""
Задание 2.*
Предложить еще какие-либо варианты (механизмы, подходы, библиотеки, идеи)
для оптимизации памяти и
доказать!!! (наглядно, кодом) их эффективность (на примере профилировщика)
"""


"""
У меня есть только один вариант :) 

"If you want your code to run faster,
you should probably just use PyPy."
            -- Guido van Rossum 

PyPy – интерпретатор Python, основное его достоинство это конечно, скорость,
 но так же он намного эффективней по памяти.
 В его основе заложен принцип Just-in-time compilation (JIT) - динамическая компиляция ("на лету") байт-кода
 в машинный код...
 Что то продемонстрировать не смогу, так работаю на Windows и установка PyPy, не такая простая как на Mac.
 Но если будет нужда, я определенно знаю куда мне нужно посмотреть.
"""