"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение
"""


from memory_profiler import profile

@profile
def parity(n, even=0, uneven=0):
    if n == 0:
        return f'{even, uneven}'
    elif str(n % 10) in '13579':
        uneven += 1
    else:
        even += 1
    return parity(n // 10, even, uneven)
# Рекурсию профилировать не очень эффективно, так как функция вызывается несколько раз
# Профилировщик не видит ту часть, где функция вызывает саму себя. Он замеряет и выдаёт каждый проход по функции отдельно

print(parity(int(12332312312312312)))
