"""
Задание 1.

Приведен код, который позволяет сохранить в
массиве индексы четных элементов другого массива

Сделайте замеры времени выполнения кода с помощью модуля timeit

Оптимизируйте, чтобы снизить время выполнения
Проведите повторные замеры.

Добавьте аналитику: что вы сделали и почему!!!
Без аналитики задание не принимается

И прошу вас обратить внимание, что то, что часто ошибочно называют генераторами списков,
на самом деле к генераторам отношения не имеет. Это называется "списковое включение" - list comprehension.
"""
from timeit import timeit


def func_1(nums):
    new_arr = []
    for i in range(len(nums)):
        if nums[i] % 2 == 0:
            new_arr.append(i)
    return new_arr


# Напишем другую функцию с использованием List Comprehension и ENUMERATE,
# встроенные фукции работают быстрее
def func_2(nums):
    return [s for s, num in enumerate(nums) if num % 2 == 0]


print(timeit('func_1([v for v in range(100)])', globals=globals(), number=20000))
print(timeit('func_2([t for t in range(100)])', globals=globals(), number=20000))
# 0.15706 - время выполнения первой функции
# 0.1329767 - время выполнения второй функции
