"""
Задание 1.

Приведен код, который позволяет сохранить в
массиве индексы четных элементов другого массива

Сделайте замеры времени выполнения кода с помощью модуля timeit

Оптимизируйте, чтобы снизить время выполнения
Проведите повторные замеры

Добавьте аналитику: что вы сделали и почему!!!
Без аналитики задание считается не принятым
"""

from timeit import timeit


def func_1(nums):
    new_arr = []
    for i in range(len(nums)):
        if nums[i] % 2 == 0:
            new_arr.append(i)
    return new_arr


def func_2(nums):
    new_arr = [i for i in range(len(nums)) if not nums[i] % 2]
    return new_arr


nums = [i for i in range(300)]
print(timeit("func_1(nums)", globals=globals()))
print(timeit("func_2(nums)", globals=globals()))

"""
30.593762100000003
19.6839205
Ls отрабатывает быстрее чем цикл
"""