"""
Задание 5.**

Приведен наивный алгоритм нахождения i-го по счёту
простого числа (через перебор делителей).

Попробуйте решить эту же задачу,
применив алгоритм "Решето Эратосфена" (теорию по Решету нужно искать в сети)

Подсказка:
Сравните алгоритмы по времени на разных порядковых номерах чисел:
10, 100, 1000

Опишите результаты, сделайте выводы, где и какой алгоритм эффективнее
Подумайте и по возможности определите сложность каждого алгоритма.

Укажите формулу сложности О-нотация каждого алгоритма
и сделайте обоснование результатам.
"""

"""Без использования «Решета Эратосфена»"""


def simple(r):
    count = 1
    n = 2
    while count <= r:
        t = 1
        is_simple = True
        while t <= n:
            if n % t == 0 and t != 1 and t != n:
                is_simple = False
                break
            t += 1
        if is_simple:
            if count == r:
                break
            count += 1
        n += 1
    return n


i = int(input('Введите порядковый номер искомого простого числа: '))
print(simple(i))

# """ С использованием «Решета Эратосфена»"""
#
# n = int(input('Введите порядковый номер искомого простого числа:'))
# a = []
# for i in range(226):
#     a.append(i)
# a[1] = 0
#
# i = 2
# while i <= n:
#     if a[i] != 0:
#         j = i + i
#         while j <= n:
#             a[j] = 0
#             j = j + i
#     i += 1
# a = set(a)
# a.remove(0)
# print(a)
