"""
Задание 5.**

Приведен наивный алгоритм нахождения i-го по счёту
простого числа (через перебор делителей).

Попробуйте решить эту же задачу,
применив алгоритм "Решето Эратосфена" (https://younglinux.info/algorithm/sieve)

Подсказка:
Сравните алгоритмы по времени на разных порядковых номерах чисел:
10, 100, 1000

Опишите результаты, сделайте выводы, где и какой алгоритм эффективнее
Подумайте и по возможности определите сложность каждого алгоритма.

Укажите формулу сложности О-нотация каждого алгоритма
и сделайте обоснование результатам.
"""

from timeit import timeit

i = int(input('Введите порядковый номер искомого простого числа: '))

def simple(i):
    """Без использования «Решета Эратосфена»"""
    count = 1
    n = 2
    while count <= i:
        t = 1
        is_simple = True
        while t <= n:
            if n % t == 0 and t != 1 and t != n:
                is_simple = False
                break
            t += 1
        if is_simple:
            if count == i:
                break
            count += 1
        n += 1
    return n






def eratosthenes(i):
    n = int(10000)
    sieve = set(range(2, n + 1))
    res = []
    while sieve:
        prime = min(sieve)
        res.append(prime)
        sieve -= set(range(prime, n + 1, prime))
    return res[i-1]


print(simple(i))
print (eratosthenes(i))

print(f"Время работы функции {simple.__name__} составило {timeit('simple', globals=globals())} сек.")
print(f"Время работы функции {eratosthenes.__name__} составило {timeit('eratosthenes', globals=globals())} сек.")

"""
По результам работы модуля профилирования timeit, получил такие данные:
До 10 числа:
Введите порядковый номер искомого простого числа: 10
29
Введите порядковый номер искомого простого числа: 10
29
Время работы функции simple составило 0.01699509999999993 сек.
Время работы функции eratosthenes составило 0.017685199999999845 сек.
До 100 числа:
Введите порядковый номер искомого простого числа: 100
541
Введите порядковый номер искомого простого числа: 100
541
Время работы функции simple составило 0.017014699999999827 сек.
Время работы функции eratosthenes составило 0.017547099999999816 сек.
До 1000 числа:
Введите порядковый номер искомого простого числа: 1000
7919
Введите порядковый номер искомого простого числа: 1000
7919
Время работы функции simple составило 0.01699850000000014 сек.
Время работы функции eratosthenes составило 0.01938020000000007 сек.

Исходя из полученных данных видно что решение через решето сопостовимо по времени через перебор делителей.
Хотя я не смог сделать без состовления списка поэтому решето работает медленей чем задуманно.
"""