"""
Задание 4.

Приведены два алгоритма. В них определяется число,
которое встречается в массиве чаще всего.

Сделайте профилировку каждого алгоритма через timeit

Попытайтесь написать третью версию, которая будет самой быстрой и по возможности самой лаконичной.
Сделайте замеры и опишите, получилось ли у вас ускорить задачу.

Без аналитики задание считается не принятым!
"""
from timeit import timeit

array = [1, 3, 1, 3, 4, 5, 1]


def func_1():
    m = 0
    num = 0
    for i in array:
        count = array.count(i)
        if count > m:
            m = count
            num = i
    return f'Чаще всего встречается число {num}, ' \
           f'оно появилось в массиве {m} раз(а)'


def func_2():
    new_array = []
    for el in array:
        count2 = array.count(el)
        new_array.append(count2)

    max_2 = max(new_array)
    elem = array[new_array.index(max_2)]
    return f'Чаще всего встречается число {elem}, ' \
           f'оно появилось в массиве {max_2} раз(а)'


print(func_1())
print(func_2())

# Профилировка функций с помощью timeit
print(timeit('func_1()', globals=globals()))
print(timeit('func_2()', globals=globals()))


# Своя функция для поиска числа, встречающегося в массиве чаще всего
def func_3():
    return max(array, key=array.count)


# Профилировка своей функции с помощью timeit
print(timeit('func_3()', globals=globals()))

'''
Аналитика:
Быстрая функция - func_1, т.к. используется цикл и значения сохраняются в переменные. 
Функция func_2 медленней из-за создания массива и использования функции max() + цикл.
Функция func_3 самая быстрая, т.к используется только встроенная функция max().
'''