
"""
Задание 5.**

Приведен наивный алгоритм нахождения i-го по счёту
простого числа (через перебор делителей).

Попробуйте решить эту же задачу,
применив алгоритм "Решето Эратосфена" (https://younglinux.info/algorithm/sieve)

Подсказка:
Сравните алгоритмы по времени на разных порядковых номерах чисел:
10, 100, 1000

Опишите результаты, сделайте выводы, где и какой алгоритм эффективнее
Подумайте и по возможности определите сложность каждого алгоритма.

Укажите формулу сложности О-нотация каждого алгоритма
и сделайте обоснование результатам.
"""

import math
from timeit import timeit


def simple(i):  # O(n^2)
    """Без использования «Решета Эратосфена»"""
    count = 1
    n = 2
    while count <= i:
        t = 1
        is_simple = True
        while t <= n:
            if n % t == 0 and t != 1 and t != n:
                is_simple = False
                break
            t += 1
        if is_simple:
            if count == i:
                break
            count += 1
        n += 1
    return n


def eratosthenes(n):  # O(n^2)
    sieve = list(range(int(1.5 * n * math.log(n))))
    # при значении множителя 1.5 работает начиная с n=4, т.к. значение выражения не попадает в диапазон
    sieve[1] = 0
    for i in sieve:
        if i > 1:
            for j in range(i + i, len(sieve), i):
                sieve[j] = 0
    sieve_separated = [x for x in sieve if x != 0]
    return sieve_separated[n-1]


# i = int(input('Введите порядковый номер искомого простого числа: '))
# print(simple(i))
print(
    timeit(
        "simple(1000)",
        globals=globals(),
        number=100))
print(
    timeit(
        "eratosthenes(1000)",
        globals=globals(),
        number=100))

# 5 число 1 проход
# 5.699999999997374e-06
# 1.4300000000001811e-05
# 10 число 100 проходов
# 0.0012901000000000024
# 0.0005334000000000033
# 100 число 100 проходов
# 0.172329
# 0.015961299999999984
# 1000 число 100 проходов
# 27.2620905
# 0.1621890999999991
# При нахождении первых простых чисел алгоритм simple справляется быстрее,
# при вводе бОльших значений Решето Эратосфена справляетс в сотни раз быстрее.
