"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1
Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from statistics import mean
from collections import defaultdict

company_string = input("Введите через запятую названия компаний: ")
company_list = company_string.split(',')

D_DICT = defaultdict(int)



for company in company_list:
    print(f'Для компании {company}:')
    value_list = []
    i = 1
    while i < 5:
        profit = int(input(f'Введите прибыль за {i} квартал '))
        value_list.append(profit)
        i += 1
    D_DICT[company] = mean(value_list);


average_profit = mean(D_DICT.values())

least_profit = []
max_profit = []
for company in D_DICT:
    if D_DICT[company] < average_profit:
        least_profit.append(company)
    elif D_DICT[company] < average_profit:
        max_profit.append(company)

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print(f'Компании с прибылью меньше среднего: {str(least_profit)}')
print(f'Компании с прибылью больше среднего: {str(max_profit)}')