"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

number = None

while not number or number not in range(1, 4):
    try:
        number = int(input(f'Введите целое число предприятий большее нуля (для проверки не большее трёх): '))
    except ValueError:
        print(f'Введите целое число предприятий большее нуля (для проверки не большее трёх)!')

data = []
for j in range(1, number + 1):
    Company = namedtuple(f'Company_data{j}', 'name q1 q2 q3 q4')

    a = input(f'Введите через пробел данные о предприятии №{j} (Название, прибыль за каждый квартал года):').split()
    while len(a) != 5:
        a = input(f'Введите через пробел данные о предприятии №{j} (Название, прибыль за каждый квартал года):').split()

    company_data = Company(a[0], int(a[1]), int(a[2]), int(a[3]), int(a[4]))
    data.append(company_data)

b = []
for i in data:
    b.append(i.q1 + i.q2 + i.q3 + i.q4)

average = sum(b)/number
print(average)

high = ''
low = ''

for i in data:
    if i.q1 + i.q2 + i.q3 + i.q4 > average:
        if high != '':
            high = high + ', ' + i.name
        else:
            high = high + i.name
    elif i.q1 + i.q2 + i.q3 + i.q4 < average:
        if low != '':
            low = low + ', ' + i.name
        else:
            low = low + i.name
print(f'Предприятия, с прибылью выше среднего значения: {high}\nПредприятия, с прибылью ниже среднего значения: {low}')
