"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def income():
    num = int(input("Введите количество компаний для расчёта прибыли: "))
    companies = namedtuple('company', 'name quarter_1 quarter_2 quarter_3 quarter_4')
    aver_income = {}

    for i in range(num):
        company = companies(
            name=input('Введите название компании: '),
            quarter_1=int(input('Укажите прибыль за первый квартал: ')),
            quarter_2=int(input('Укажите прибыль за второй квартал: ')),
            quarter_3=int(input('Укажите прибыль за третий квартал: ')),
            quarter_4=int(input('Укажите прибыль за четвертый квартал: '))
        )

        aver_income[company.name] = (company.quarter_1 + company.quarter_2 + company.quarter_3 + company.quarter_4) / 4

    total_aver_income = 0
    for value in aver_income.values():
        total_aver_income += value
    total_aver_income = total_aver_income / num

    for key, value in aver_income.items():
        if value > total_aver_income:
            print(f"Прибыль компании {key} - выше среднего")
        elif value < total_aver_income:
            print(f"Прибыль компании {key} - ниже среднего")
        elif value == total_aver_income:
            print(f"Прибыль компании {key} - средняя")


income()
