from collections import namedtuple
"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1
Предприятия, с прибылью ниже среднего значения: Фирма_2
"""


def min_max_val(n, m, sign):
    return sign == '>=' and ' '.join([i for i, j in n.items() if j >= m]) or\
           ' '.join([i for i, j in n.items() if j < m])


def profit_company(number_enterprises, res):
    counter = number_enterprises
    while counter > 0:
        try:
            name = input('Введите название предприятия: ')
            tmp = list(map(lambda x: int(x), input('Введите прибыль'
                                                   ' по кварталам через пробел - ').rstrip(' ').split(' ')))
            try:
                Marks = namedtuple(f'{name}', 'First Second Third Fourth')
                marks = Marks(tmp[0], tmp[1], tmp[2], tmp[3])
                res[name] = sum(marks)
                counter -= 1
            except IndexError:
                print('Введите четыре числа через пробел')
        except ValueError:
            print('Введите четыре числа через пробел')
    result = sum(res.values())/number_enterprises

    return f'Средняя годовая прибыль всех предприятий: {result} \n' \
           f'Предприятия, с прибылью выше среднего значения: {min_max_val(res, result, ">=")}\n' \
           f'Предприятия, с прибылью ниже среднего значения: {min_max_val(res, result, "<")}'


try:
    num = int(input('Введите количество предприятий для расчета прибыли: '))
    empty_dict = {}

    print(profit_company(num, empty_dict))

except ValueError:
    print('Необходимо ввести количество компаний')


