"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

org_list = []
org = namedtuple('org', 'name_org year_sum')

count_orgs = int(input('Введите количество предприятий для расчета прибыли: '))
for i in range(count_orgs):
    name_org = input('Введите название предприятия: ')
    print('через пробел введите прибыль данного предприятия')
    profits = input('за каждый квартал(Всего 4 квартала): ').split()

    year_sum = sum(list(map(int, profits)))
    org_list.append(org(name_org, year_sum))

    # print(name_org)
    # print(profits)
    # print(year_sum)

average_year_sum = sum([x.year_sum for x in org_list]) / len(org_list)
print('Средняя годовая прибыль всех предприятий:', average_year_sum)

orgs_less = [x.name_org for x in org_list if x.year_sum < average_year_sum]
orgs_great = [x.name_org for x in org_list if x.year_sum > average_year_sum]

print('Предприятия, с прибылью выше среднего значения:', ', '.join(orgs_great))
print('Предприятия, с прибылью ниже среднего значения:', ', '.join(orgs_less))
