"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


company = namedtuple('Firm', 'name profit')
company_list = []

company_num = int(input('Введите количество предприятий для расчета прибыли:'))

for i in range(company_num):
    name = input("Введите название предприятия:")
    profit = input("Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала):")

    company_list.append(company(name, sum(list(map(int, profit.split())))))


sorted_company_profit = sorted(company_list, key=lambda p: p.profit)
print(sorted_company_profit)

avg = sum(int(c.profit) for c in company_list) / company_num
print("Средняя годовая прибыль всех предприятий: ", avg)
print("Предприятия, с прибылью выше среднего значения:", [c.name for c in company_list if c.profit >= avg])
print("Предприятия, с прибылью ниже среднего значения:", [c.name for c in company_list if c.profit < avg])
