"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""


from collections import defaultdict, Counter
import statistics


def avg_margin_enterprises():
    margin_enterprises = defaultdict(float)
    count_enterprises = int(input('Введите количество предприятий для расчета прибыли: '))
    for i in range(count_enterprises):
        enterprise = input('Введите название предприятия: ')
        margin = list(map(int, input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 '
                                     'квартала): ').split()))
        margin_enterprises[enterprise] = sum(margin) / 4
        """
        не использую среднее значение через функции, т.к. прибыль в определенном квартале могла отсутствовать
        """
    avg_marg = statistics.mean(Counter(margin_enterprises).values())
    print(f'Средняя годовая прибыль всех предприятий: {avg_marg}')
    above_avg = []
    lower_avg = []
    for key, val in margin_enterprises.items():
        if val > avg_marg:
            above_avg.append(key)
        elif val < avg_marg:
            lower_avg.append(key)
    print(f'Предприятия, с прибылью выше среднего значения: \n {", ".join(above_avg)}')
    print(f'Предприятия, с прибылью ниже среднего значения: \n {", ".join(lower_avg)}')


if __name__ == '__main__':
    avg_margin_enterprises()
