"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""


from collections import defaultdict
from statistics import mean


def my_func():
    num_enterprises = int(input('\nВведите кол-во предприятий: '))
    dict_avg_profit = defaultdict(int)

    for i in range(num_enterprises):
        company_name = input("\nВведите название предприятия: ")
        input_profit = input(" Через пробел введите прибыль данного предприятия"
                                 "\n за каждый квартал (всего 4 квартала): ")
        dict_avg_profit[company_name] = mean([int(el) for el in input_profit.split(" ")])

    avg_profit = round(mean(dict_avg_profit.values()), 2)

    return f'\nСредняя годовая прибыль всех предприятий: {avg_profit}' \
           f'\nПредприятия, с прибылью выше среднего значения: ' \
           f'{", ".join([el for el in dict_avg_profit.keys() if dict_avg_profit[el] > avg_profit])}.' \
           f'\nПредприятия, с прибылью ниже среднего значения: ' \
           f'{", ".join([el for el in dict_avg_profit.keys() if dict_avg_profit[el] < avg_profit])}.'

print(my_func())
