"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import defaultdict


firms = int(input('Количество предприятий для расчета: '))

def do_budget():
    budget = defaultdict(int)
    for i in range(firms):
        firms_name = input('Введите название фирмы: ')
        budget[firms_name] = sum(list(map(int, input('через пробел введите прибыль данного предприятия: ').split())))
        budget['total_avg'] += budget[firms_name] / firms
    return budget


def get_statistic(dict):
    dict_result = defaultdict(str)
    for i in dict:
        if dict[i] < dict['total_avg']:
            dict_result['less_avg'] = i
        if dict[i] > dict['total_avg']:
            dict_result['more_avg'] = i
    return f'Средняя годовая прибыль всех предприятий: {dict["total_avg"]}\n' \
           f'Предприятия, с прибылью выше среднего значения: {dict_result["more_avg"]}\n' \
           f'Предприятия, с прибылью ниже среднего значения: {dict_result["less_avg"]}'


print(get_statistic(do_budget()))