"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


def avg_year_profit(profits_tup):
    return sum(profits_tup)/4


def total_avg_year(p_dict):
    return sum(map(avg_year_profit, list(p_dict.values())))/len(p_dict)


def more_profitable(p_dict, avg_profit):
    return [c[0] for c in p_dict.items() if avg_year_profit(c[1]) > avg_profit]


def less_profitable(p_dict, avg_profit):
    return [c[0] for c in p_dict.items() if avg_year_profit(c[1]) < avg_profit]


profits = namedtuple('Profits', 'quarter1 quarter2 quarter3 quarter4')
corps = {}

while True:
    name = input("Введите название компании: ")
    q1, q2, q3, q4 = map(int, input("Введите через пробел прибыль данного предприятия\n"
                                    "за каждый квартал(Всего 4 квартала): ").split())
    corp = profits(q1, q2, q3, q4)
    corps[name] = corp
    if input("Хотите ли вы ввести данные о прибыли для другой компании? Y/N\n") == 'N':
        break

total = total_avg_year(corps)
print("\nСредняя годовая прибыль всех предприятий: ", '%.2f' % total)
print("Предприятия, с прибылью выше среднего значения: ", ", ".join(more_profitable(corps, total)))
print("Предприятия, с прибылью ниже среднего значения: ", ", ".join(less_profitable(corps, total)))

