"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple
avg_prof = {}


def func():
    try:
        n = int(input('Введите кол-во предприятий: '))
        for i in range(n):
            company = namedtuple('firm', 'name q_1 q_2 q_3 q_4')
            data = company(
                name=input('Введите название: '),
                q_1=int(input('Введите прибыль за 1 квартал: ')),
                q_2=int(input('Введите прибыль за 2 квартал: ')),
                q_3=int(input('Введите прибыль за 3 квартал: ')),
                q_4=int(input('Введите прибыль за 4 квартал: ')),
            )

            avg_prof[data.name] = (data.q_1 + data.q_2 + data.q_3 + data.q_4)/4

        t = 0

        for el in avg_prof.values():
            t += el
        t = t / n
        print(f'Средняя годовая прибыль всех предприятий: {t}')

        for k, v in avg_prof.items():
            if v > t:
                print(f'Предприятия, с прибылью выше среднего значения: {k}')
            else:
                print(f'Предприятия, с прибылью ниже среднего значения: {k}')

    except ValueError:
        print('Введено неправильное значение!')
        func()


func()
