"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import defaultdict

n = int(input('Введите количество предприятий для расчета прибыли: '))
gain = defaultdict(list)
for i in range(n):
    key_firm = input(f'Введите название предприятия {i + 1}: ')
    firm_values = input("через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ").split()
    gain[key_firm] = firm_values

total_profit = []
for i in gain:
    total_profit.append(sum(list(map(int, gain.get(i)))))

mid_profit = sum(total_profit)/n

top_firms = []
bottom_firms = []
for key in gain:
    if sum(list(map(int, gain.get(key)))) > mid_profit:
        top_firms.append(key)
    elif sum(list(map(int, gain.get(key)))) < mid_profit:
        bottom_firms.append(key)

print(f'Средняя годовая прибыль всех предприятий: {mid_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {", ".join(top_firms)}\n'
      f'Предприятия, с прибылью ниже среднего значения: {", ".join(bottom_firms)}')