"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple, defaultdict

firms = defaultdict(int)
firm = namedtuple('name', 'proof')

n = int(input('Введите количество предприятий для расчета прибыли: '))

for i in range(n):
    firm.name = input('Введите название предприятия: ')
    firm.proof = input("через пробел введите прибыль данного предприятия \nза каждый квартал(Всего 4 квартала): ")
    firms[firm.name] = list(map(int, firm.proof.split()))

sums = [sum(proof) / len(proof) for proof in firms.values()]  # список среднего дохода фирм
avg_year = sum(sums) / len(firms)  # средний годовой доход всех фирм

print('Средняя годовая прибыль всех предприятий:', avg_year)
print('Предприятия, с прибылью ниже среднего значения:',
      *[k for k, v in firms.items() if sum(v) / len(v) < avg_year])
print('Предприятия, с прибылью выше среднего значения:',
      *[k for k, v in firms.items() if sum(v) / len(v) > avg_year])

"""
вывод
    Введите количество предприятий для расчета прибыли: 3
    Введите название предприятия: фирма 1
    через пробел введите прибыль данного предприятия 
    за каждый квартал(Всего 4 квартала): 4566 8523 1562 4856
    Введите название предприятия: фирма 2
    через пробел введите прибыль данного предприятия 
    за каждый квартал(Всего 4 квартала): 6584 7415 2365 8521
    Введите название предприятия: фирма 3
    через пробел введите прибыль данного предприятия 
    за каждый квартал(Всего 4 квартала): 7896 5214 8523 4569
    Средняя годовая прибыль всех предприятий: 5882.833333333333
    Предприятия, с прибылью ниже среднего значения: фирма 1
    Предприятия, с прибылью выше среднего значения: фирма 2 фирма 3
"""