"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


def income():
    info = {}
    comp_amount = int(input("Введите количество предприятий для расчета прибыли: "))
    Company = namedtuple('Company', ['comp_name', 'inc_1', 'inc_2', 'inc_3', 'inc_4'])
    for i in range(comp_amount):
        name = input("Введите название предприятия: ")
        inc = input("Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ")
        inc_1, inc_2, inc_3, inc_4 = inc.split(' ')
        comp = Company(name, int(inc_1), int(inc_2), int(inc_3), int(inc_4))
        info[comp.comp_name] = (comp.inc_1 + comp.inc_2 + comp.inc_3 + comp.inc_4)

    common_summ = 0
    for j in info.values():
        common_summ += j

    print(f'Средняя годовая прибыль всех предприятий: {common_summ / comp_amount}')

    for comp, inc in info.items():
        if inc > common_summ / comp_amount:
            print(f'У компании {comp} прибыль выше средней годовой')
        if inc < common_summ / comp_amount:
            print(f'У компании {comp} прибыль ниже средней годовой')
        else:
            print(f'У компании {comp} прибыль равна средней годовой')


income()
