"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

company = namedtuple('Company', 'name q1 q2 q3 q4')
companies = []

while True:
    name = input('Введите название предприятия:\n')
    q1, q2, q3, q4 = input('через пробел введите прибыль данного предприятия '
                           'за каждый квартал(Всего 4 квартала):\n').split(' ')
    decision = input('Введите пробел чтобы продолжить, любую кнопку чтобы выйти:\n')
    com = company(name, int(q1), int(q2), int(q3), int(q4))
    companies.append(com)
    if decision != ' ':
        break


mean_income = sum([q for company in companies for q in company if isinstance(q, int)]) / len(companies)
print(f'Средняя годовая прибыль всех предприятий: {mean_income}\n'
      f'Предприятия с прибылью ниже среднего:'
      f' {[c.name for c in companies if sum([c.q1 + c.q2 + c.q3 + c.q4]) < mean_income]}\n'
      f'Предприятия с прибылью выше среднего:'
      f' {[c.name for c in companies if sum([c.q1 + c.q2 + c.q3 + c.q4]) > mean_income]}\n')
