"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

amount = []
company = []
company_name = []

companies = int(input('Введите количество предприятий для расчета прибыли: '))
for i in range(companies):
    company_name.append(input('Введите название предприятия: '))
    Company = namedtuple(company_name[i], 'first second third fourth')
    a, b, c, d = map(int, input('Через пробел введите прибыль данного предприятия: ').split())
    company.append(Company(a, b, c, d))
    amount.append(sum(company[i]))
all_year_amount = sum(amount) / companies
print('Средняя годовая прибыль всех предприятий: ', all_year_amount)
for i in range(companies):
    print(f'Предприятия, с прибылью выше среднего значения: {company_name[i]}'
          if all_year_amount <= amount[i]
          else f'Предприятия, с прибылью ниже среднего значения: {company_name[i]}')
