"""
Задача 4.
Поработайте с обычным словарем и OrderedDict.
Выполните операции с каждым их них (заполнение, получение элемента) и сделайте замеры.
Опишите полученные результаты, сделайте выводы.

И есть ли смысл исп-ть OrderedDict в Python 3.6 и более поздних версиях?
"""

from collections import OrderedDict
from timeit import timeit

dct = {i: i for i in range(10000)}
order_dct = OrderedDict([(i, i) for i in range(10000)])

print('Замеры операции заполнения для словаря через timeit: ' + str(timeit(
    'dct = {i: i for i in range(20)}',
    globals=globals(), number=100000)))

print('Замеры операции заполнения для упорядоченного словаря через timeit: ' + str(timeit(
    'order_dct = OrderedDict([(i, i) for i in range(20)])',
    globals=globals(), number=100000)))

print('Замеры операции получения элемента из словаря через timeit: ' + str(timeit(
    'dct[8]',
    globals=globals(), number=100000)))

print('Замеры операции получения элемента из упорядоченного словаря через timeit: ' + str(timeit(
    'order_dct[8]',
    globals=globals(), number=100000)))

print('Замеры операции удаления элемента из словаря через timeit: ' + str(timeit(
    'dct.popitem()',
    globals=globals(), number=10000)))

print('Замеры операции удаления элемента из упорядоченного словаря через timeit: ' + str(timeit(
    'order_dct.popitem()',
    globals=globals(), number=10000)))

print('Замеры операции получения пар значений из словаря через timeit: ' + str(timeit(
    'dct.items()',
    globals=globals(), number=10000)))

print('Замеры операции получения пар значений из упорядоченного словаря через timeit: ' + str(timeit(
    'order_dct.items()',
    globals=globals(), number=10000)))

'''
Вывод:
Замеры показывают, что упорядоченный словарь работает медленнее или в лучшем случае так же, как и обычный словарь.
Использовать эту структуру в Python 3.6 и более поздних версиях не вижу смысла, с ним мы только еще больше замедлимся.

Замеры операции заполнения для словаря через timeit: 0.1805087
Замеры операции заполнения для упорядоченного словаря через timeit: 0.46865120000000005
Замеры операции получения элемента из словаря через timeit: 0.003994500000000012
Замеры операции получения элемента из упорядоченного словаря через timeit: 0.003993899999999995
Замеры операции удаления элемента из словаря через timeit: 0.0009422000000000041
Замеры операции удаления элемента из упорядоченного словаря через timeit: 0.00156909999999999
Замеры операции получения пар значений из словаря через timeit: 0.0006399999999999739
Замеры операции получения пар значений из упорядоченного словаря через timeit: 0.0006705000000000183
'''