"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

i = 0
sum_profit = 0
company_list = []
low_profit = "Предприятия, с прибылью ниже среднего значения: "
high_profit = "Предприятия, с прибылью выше среднего значения: "

num_comp = int(input("Введите количество предприятий для расчета прибыли:"))
company = namedtuple("Company", "name profit")

while i < num_comp:
    profit = 0
    company_name = input("Введите название компании:")
    profit_list = input("через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала):").split()
    for el in profit_list:
        profit += int(el)
    company_list.append(company(name = company_name, profit = profit))
    sum_profit += profit
    i += 1

avg_profit = sum_profit / num_comp
for el in company_list:
    if el.profit < avg_profit:
        low_profit += f"{el.name} "
    else:
        high_profit += f"{el.name} "

#print(company_list)
print("Средняя годовая прибыль всех предприятий:", avg_profit)
print(high_profit)
print(low_profit)
