"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from functools import reduce

companies = {}

company_count = int(input('Введите количество предприятий для расчета прибыли: '))

for _ in range(company_count):
    company_name = input('Введите название предприятия: ')
    q_profit_str = input('через пробел введите прибыль данного предприятия'
                         'за каждый квартал(Всего 4 квартала)')
    q_profit = [int(i) for i in q_profit_str.split()]
    y_profit = reduce(lambda a, b: a + b, q_profit)/len(q_profit)
    companies.update({company_name: y_profit})

print(companies)
