"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


COM = namedtuple('Company', 'name, quarters')
count_company = int(input('Введите количество предприятий для расчета прибыли: '))
companys = []
for i in range(count_company):
    company = COM(
        input("Введите название предприятия: "),
        input('через пробел введите прибыль данного предприятия \
    за каждый квартал(Всего 4 квартала): ').split()
    )
    companys.append(company)

summ_profit = 0
for i in companys:
    summ_profit += sum(map(int, getattr(i, 'quarters')))

average_profit = summ_profit / count_company
print(f"Средняя годовая прибыль всех предприятий: {average_profit}")

low_profit = []
hight_profit = []
for i in companys:
    if sum(map(int, getattr(i, 'quarters'))) < average_profit:
        low_profit.append(getattr(i, 'name'))
    else:
        hight_profit.append(getattr(i, 'name'))

print(f"Предприятия, с прибылью выше среднего значения: {' '.join(hight_profit)}")
print(f"Предприятия, с прибылью ниже среднего значения: {' '.join(low_profit)}")
