"""
1.  Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

count_company = int(input('Введите количество предприятий для расчета прибыли: '))
i = 1
arr = []
while i <= count_company:  # в цикле заполняем namedtuple, добавляем в массив
    com = namedtuple('Company', 'name quarter')
    i += 1
    company_name = input('Введите название предприятия: ')
    company_profit = input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
    arr.append(com(
        name=company_name,
        quarter=company_profit.split()
    ))


sum_profit = 0
for comp in arr:  # перебираем все компании, суммируем выручку
    sum_profit += sum([int(n) for n in comp.quarter])

big_profit = []
low_profit = []

for comp in arr:  # перебираем компании сравниваем выручку со средней по всем компаниям
    if sum([int(n) for n in comp.quarter]) < sum_profit / count_company:
        low_profit.append(comp.name)
    else:
        big_profit.append(comp.name)

print(f'Средняя годовая прибыль всех предприятий: {sum_profit / count_company}')

comma = ', '
print(f'Предприятия, с прибылью ниже среднего значения: {comma.join(low_profit)}')
print(f'Предприятия, с прибылью выше среднего значения: {comma.join(big_profit)}')