"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

import collections

while True:
    try:
        n = int(input('Введите количество компаний: '))
    except ValueError:
        print('Вы ввели недопустимое значение')
        continue
    break

companies = collections.defaultdict()
prof_comp = collections.deque()
un_prof_comp = collections.deque()
total_profit = 0
count = 4

for i in range(n):
    name = input(f'\nВведите название {i+1}й компании: ')
    profit = 0
    q = 1
    while q <= count:
        try:
            profit += float(input(f'Введите прибыль за {q}й квартал: '))
        except ValueError:
            print('Введите число.')
            continue
        q += 1
    companies[name] = profit
    total_profit += profit

mid_profit = total_profit / n
for i, item in companies.items():
    if item >= mid_profit:
        prof_comp.append(i)
    else:
        un_prof_comp.append(i)
print(f'Средняя прибыль для всех компаний составила: {mid_profit}')
print(f'Предприятия, с прибылью выше среднего значения: ')
for name in prof_comp:
    print(name)
print(f'Предприятия, с прибылью ниже среднего значения: ')
for name in un_prof_comp:
    print(name)
