"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

number_of_interprises = int(input("Введите количество компаний: "))

company = namedtuple('Company', ['name', 'quarters', 'profit'])

all_companies = set()

total_profit = 0

for i in range(number_of_interprises):
    name = input(f'Введите наименование компании: ')

    quarters = list(map(int, input('Введите прибыль через пробез за каждый квартал(всего 4 квартала): ').split()))
    profit = sum(quarters)
    comp = company(name=name, quarters=tuple(quarters), profit=profit)
    all_companies.add(comp)
    total_profit += profit


average = total_profit / number_of_interprises
print(f'Cредняя годовая прибыль всех предприятий {average}')
print(all_companies)

print("Предприятия с прибылью выше среднего заработка за год!")
for comp in all_companies:
    if comp.profit > average:
        print(f'Компания {comp.name} заработала {comp.profit}')

print("Предприятия с прибылью ниже среднего заработка за год!")
for comp in all_companies:
    if comp.profit < average:
        print(f'Компания {comp.name} заработала {comp.profit}')





