"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
import collections


def collect_companies_data():
    companies = []
    companies_number = int(input("Введите количество предприятий для расчета прибыли: "))
    for i in range(companies_number):
        comp_name = input("Введите название предприятия: ")
        profits = input("через пробел введите прибыль данного предприятия "
                        "за каждый квартал(Всего 4 квартала): ")
        try:
            company_profit = collections.namedtuple(comp_name, "q_1_profit q_2_profit q_3_profit q_4_profit")
            companies.append(company_profit(*[int(elem) for elem in profits.split(' ')]))
        except ValueError:
            print("Прибыли должны быть числовыми значениями и введены через пробел")

    return companies


def avg_company_profit(company_profit):
    pass


data = collect_companies_data()
print(*data)
