"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


def calculator_of_profits():
    n = int(input("Введите количество предприятий для расчета прибыли: "))

    profit_avg = {}
    firms = namedtuple(
        "Firms",
        "name profit")

    for i in range(n):
        name = input("Введите название предприятия: ")
        profit = [int(i) for i in input("Введите прибыли через пробел: ").split(" ")]
        firm = firms(name, profit)

        profit_avg[firm.name] = sum(firm.profit) / len(firm.profit)

    total_avg = sum(profit_avg.values()) / n

    print(f"Средняя годовая прибыль всех предприятий: {total_avg}")

    for key, val in profit_avg.items():
        if val > total_avg:
            print(f"{key} - прибыль выше среднего")
        elif val < total_avg:
            print(f"{key} - прибыль ниже среднего")
        elif val == total_avg:
            print(f"{key} - средняя прибыль")

calculator_of_profits()
