"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

company_number = int(input('Введите количетво предприятий для расчета: '))

company_list = []

company_info = namedtuple('Company', 'Name profit')

for i in range(company_number):

    name_company = input('Введите название предприятия: ')

    profit_company = list(map(float, input('Введите прибыль компании через пробел: ').split()))

    company_list.append(company_info(name_company, sum(profit_company)))

profit_avg = sum((float(name.profit) for name in company_list)) / company_number

profit_avg_max = [item.Name for item in company_list if item.profit > profit_avg]

profit_avg_min = [item.Name for item in company_list if item.profit < profit_avg]

print(f'Средняя годовая прибыль всех компаний: {profit_avg}')

print(f'Компании, с прибылью выше среднего значения: {profit_avg_max}')

print(f'Компании, с прибылью ниже среднего значения: {profit_avg_min}')
