"""
Задача 4.
Поработайте с обычным словарем и OrderedDict.
Выполните операции с каждым их них (заполнение, получение элемента) и сделайте замеры.
Опишите полученные результаты, сделайте выводы.

И есть ли смысл исп-ть OrderedDict в Python 3.6 и более поздних версиях?
"""

from collections import OrderedDict
from timeit import timeit

dict_1 = {}
o_dict_1 = OrderedDict()

def fill_fun(cur_dict):
    for i in range(10000):
        cur_dict[i] = i


def fun_d_1(cur_dict):
    cur_dict.items()


def fun_d_2(cur_dict):
    cur_dict.keys()


def fun_d_3(cur_dict):
    cur_dict[len(cur_dict)/2]



print("Заполнение словаря", timeit("fill_fun(dict_1)", globals=globals(), number=10000))
print("Заполнение упорядочного словаря", timeit("fill_fun(o_dict_1)", globals=globals(), number=10000))

print("Получение элементов словаря", timeit("fun_d_1(dict_1)", globals=globals(), number=10000))
print("Получение элементов упорядочного словаря", timeit("fun_d_1(o_dict_1)", globals=globals(), number=10000))
print("Получение ключей словаря", timeit("fun_d_2(dict_1)", globals=globals(), number=10000))
print("Получение ключей упорядочного словаря", timeit("fun_d_2(o_dict_1)", globals=globals(), number=10000))

print("Получение элемента из середины словаря", timeit("fun_d_3(dict_1)", globals=globals(), number=10000))
print("Получение элемента из середины упорядочного словаря", timeit("fun_d_3(o_dict_1)", globals=globals(), number=10000))

# Заполнение словаря 5.4686404
# Заполнение упорядочного словаря 8.2900427
# ---Заполнение упорядоченного словаря занимает больше времени---

# Получение элементов словаря 0.0009206999999999965
# Получение элементов упорядочного словаря 0.0009499999999995623
# Получение ключей словаря 0.0009668000000004895
# Получение ключей упорядочного словаря 0.0009728000000013282
# Получение элемента из середины словаря 0.0017703999999998388
# Получение элемента из середины упорядочного словаря 0.0017431999999999448
# ---Различные операции выполняются примерно за одинаковое время---

# В современных версиях питона, использовать упорядоченные словари не имеет смысла,
# так как обычные словари научились сохранять порядок, но при этом работают быстрее

