"""
Задача 3.
В соответствии с документацией Python,
deque – это обобщение стеков и очередей.
Вот основное правило: если вам нужно что-то быстро дописать или вытащить, используйте deque.
Если вам нужен быстрый случайный доступ, используйте list.

Задача: 
1) создайте простой список (list) и очередь (deque). Сделайте замеры и оцените что заполняется быстрее.
2) Выполните различные операции с каждым из объектов. Сделайте замеры и оцените, где и какие операции быстрее.

Не забудьте, что сравнивать, например, можно операцию appendleft дека и insert списка и т.д.
"""

from collections import deque
from timeit import timeit

my_list = []
deque_list = deque()


def fill_list():
    for i in range(100):
        my_list.append(i)
    return my_list


fill_list()


def fill_deque_list():
    for i in range(100):
        deque_list.append(i)
    return deque_list


fill_deque_list()

print("Время заполнения обчыного списка:", timeit("fill_list()", globals=globals(), number=10000), "сек")
print("Время заполнения deque списка:", timeit("fill_deque_list()", globals=globals(), number=10000), "сек")
print("-" * 100)
print("Время добавления элемента в начало обычного списка:",
      timeit("my_list.insert(0, 1000)", globals=globals(), number=100), "сек")
print("Время добавления элемента в начало deque списка:",
      timeit("deque_list.appendleft(1000)", globals=globals(), number=100), "сек")
print("-" * 100)
print("Время удаления первого элемента обычного списка:",
      timeit("my_list.pop(0)", globals=globals(), number=100), "сек")
print("Время удаления первого элемента deque списка:",
      timeit("deque_list.popleft()", globals=globals(), number=100), "сек")
print("-" * 100)
print("Время удаления всех элеметов обычного списка:",
      timeit("my_list.clear", globals=globals(), number=100), "сек")
print("Время удаления всех элеметов deque списка:",
      timeit("deque_list.clear", globals=globals(), number=100), "сек")

"""
Время заполнения обчыного списка: 0.162584834 сек
Время заполнения deque списка: 0.103941683 сек
----------------------------------------------------------------------------------------------------
Время добавления элемента в начало обычного списка: 0.16155544600000005 сек
Время добавления элемента в начало deque списка: 2.2942000000025775e-05 сек
----------------------------------------------------------------------------------------------------
Время удаления первого элемента обычного списка: 0.15408467999999997 сек
Время удаления первого элемента deque списка: 1.1470999999985132e-05 сек
----------------------------------------------------------------------------------------------------
Время удаления всех элеметов обычного списка: 1.2679000000015428e-05 сек
Время удаления всех элеметов deque списка: 1.3283000000030576e-05 сек

Заполнение происходит чуть быстрее у deque.
Операции добавления элемента в начало и удаления первого элемента у deque
намного превосходят по скорости операции обычных списков.
Удаление всех элементов по скорости одинаково.
"""
