"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import ChainMap


def company():
    dict_comp = {}
    name_comp = input("Введите название предприятия: ")
    profit = input("Через пробел введите прибыль данного предприятия "
                   "за каждый квартал(Всего 4 квартала): ")
    profit = profit.split()
    profit = [int(el) for el in profit]
    dict_comp.update({name_comp: profit})
    return dict_comp


cnt = int(input("Введите количество предприятий для расчета прибыли: "))
dict_company_all = ChainMap()
for i in range(cnt):
    dict_company_all.update(company())

s = 0
for el in dict_company_all.values():
    s += sum(el)

avg_profit = s / cnt
print(f"Средняя годовая прибыль всех предприятий: {avg_profit}")
print(f"Предприятия, с прибылью выше среднего значения: "
      f"{', '.join([el for el in dict_company_all.keys() if sum(dict_company_all[el]) > avg_profit])}")
print(f"Предприятия, с прибылью ниже среднего значения: "
      f"{', '.join([el for el in dict_company_all.keys() if sum(dict_company_all[el]) < avg_profit])}")
