"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

company = namedtuple('firm', ['name', 'q1', 'q2', 'q3', 'q4'])


def average(avg):
    return avg.q1 + avg.q2 + avg.q3 + avg.q4


def company_profit():
    company_list = []
    small = []
    big = []
    company_number = int(input('Введите количество предприятий для расчета прибыли: '))

    for i in range(company_number):
        comp = input('Введите название предприятия: ')
        profit = input('Через пробел введите прибыль предприятия за каждый квартал(Всего 4): ')
        company_list.append(company(comp, *map(int, profit.split())))

    avg_profit = sum(map(average, company_list)) / len(company_list)
    print(f'Средняя прибыль всех предприятий: {avg_profit}')

    for el in company_list:
        if average(el) < avg_profit:
            small.append(el.name)
        elif average(el) > avg_profit:
            big.append(el.name)

    print(f'Предприятия, с прибылью выше среднего значения: {",".join(big)}')
    print(f'Предприятия, с прибылью ниже среднего значения: {",".join(small)}')


company_profit()