"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


def income(lst):
    sum_income = 0
    for el in lst:
        sum_income += sum(el[1:])
    return sum_income / len(lst)


lst = []
count = int(input('Введите количество предприятий для расчета прибыли: '))
for _ in range(count):
    name = input('Введите название предприятия: ')
    q = input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
    company = namedtuple('Company', 'company_name quarter_1 quarter_2 quarter_3 quarter_4')
    q1, q2, q3, q4 = map(int, q.split(' '))
    lst.append(company(company_name=name, quarter_1=q1, quarter_2=q2, quarter_3=q3, quarter_4=q4))
print(f'Средняя годовая прибыль всех предприятий: '
      f'{income(lst)}')
print(f'Предприятия, с прибылью ниже среднего значения: '
      f'{", ".join(el.company_name for el in lst if sum(el[1:]) < income(lst))}')
print(f'Предприятия, с прибылью выше среднего значения: '
      f'{", ".join(el.company_name for el in lst if sum(el[1:]) > income(lst))}')
