"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


firms = {}
count = int(input('Введите количество предприятий для расчета прибыли: '))
for i in range(count):
    name = input('Введите название предприятия: ')
    Res = namedtuple('Прибыль', ['quarter1', 'quarter2', 'quarter3', 'quarter4'])
    money = input('Введите прибыль за 4 квартала через пробел: ')
    quarters = []
    for j in money.split(' '):
        quarters.append(int(j))
    firms[name] = Res(
        quarter1=quarters[0],
        quarter2=quarters[1],
        quarter3=quarters[2],
        quarter4=quarters[3]
    )

total_money = ()
for k in firms:
    total_money += firms.get(k)

average = sum(total_money) / len(firms)
print(f'Средняя годовая прибыль всех предприятий: {average}')


less_than_avg = []
more_than_avg = []
for m in firms:
    if sum(firms.get(m)) > average:
        more_than_avg.append(m)
    else:
        less_than_avg.append(m)
print(f'Предприятия, с прибылью выше среднего значения: {more_than_avg}')
print(f'Предприятия, с прибылью выше среднего значения: {less_than_avg}')
