from collections import namedtuple

"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""


def income():
    high_list = []
    low_list = []
    sum_of_income = 0
    amount_of_company = int(input('Введите количество предприятий для расчета прибыли'))
    company_list = []
    company = namedtuple('company', 'name income')
    for elem in range(amount_of_company):
        company_list.append(company(
            name=input('Введите название предприятия:'),
            income=sum(map(int, input('через пробел введите прибыль данного предприятия:').split())))
        )
        sum_of_income += company_list[elem].income
    for elements in range(len(company_list)):
        if company_list[elements].income < sum_of_income / len(company_list):
            low_list.append(company_list[elements].name)
        else:
            high_list.append(company_list[elements].name)
    return f'Предприятия, с прибылью выше среднего значения: {high_list},' \
           f'Предприятия, с прибылью ниже среднего значения:{low_list}'


print(income())
