"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def middle_profit(num):
    data = namedtuple('firm', 'Name Profit')
    arr = []
    for i in range(1, num + 1):
        name = input('Введите название фирмы: ')
        profit = input('Введите прибыль через пробел за четыре квартала: ')
        arr.append(data(name, sum(list(map(lambda x: int(x), profit.split(maxsplit=3))))))
    middle = 0
    for j in arr:
        middle += j.Profit
    middle = middle / num
    print(f'Средняя годовая прибыль всех предприятий равна: {middle}')
    upper_middle = []
    equal_middle = []
    lower_middle = []
    for k in arr:
        if k.Profit > middle:
            upper_middle.append(k.Name)
        elif k.Profit == middle:
            equal_middle.append(k.Name)
        else:
            lower_middle.append(k.Name)
    if len(upper_middle) != 0 and len(lower_middle) != 0:
        print(f"Предприятия, с прибылью выше среднего значения: {upper_middle}")
        print(f"Предприятия, с прибылью ниже среднего значения: {lower_middle}")
    if len(equal_middle) != 0:
        print(f"Предприятия, с прибылью, равной среднему значению: {equal_middle}")


num_of_companies = int(input('Введите количество компаний для расчетов: '))
print(middle_profit(num_of_companies))
