"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

RES = namedtuple('Firm', 'name first_quarter second_quarter third_quarter fours_quarter sum')


def get_res():
    name = input('Введите название предприятия '),
    fst = int(input('Введите прибыль за первый квартал '))
    snd = int(input('Введите прибыль за второй квартал '))
    trd = int(input('Введите прибыль за третий квартал '))
    fth = int(input('Введите прибыль за четвертый квартал '))
    return RES(
        name=name,
        first_quarter=fst,
        second_quarter=snd,
        third_quarter=trd,
        fours_quarter=fth,
        sum=fst + snd + trd + fth
    )


def get_firms(num):
    firms = []
    all_sum = 0
    for i in range(num):
        firm = get_res()
        firms.append(firm)
        all_sum += firm.sum
    all_sum = all_sum / num
    print(f'Средняя годовая прибыль всех предприятий = {all_sum}')
    for firm in firms:
        if firm.sum < all_sum:
            print(f'Предприятие {firm.name} имеет прибиль меньше общей среднегодовой')
        elif firm.sum > all_sum:
            print(f'Предприятие {firm.name} имеет прибиль больше общей среднегодовой')
        else:
            print(f'Предприятие {firm.name} имеет прибиль равную общей среднегодовой')


num_firms = int(input('Введите количество предприятий '))
get_firms(num_firms)
