"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def get_tuple():
    temp_tuple = namedtuple('Company', 'name first_qr second_qr third_qr fourth_qr')
    res_tuple = temp_tuple(
        name=input('Введите название предприятия '),
        first_qr=input('Введите прибыль за первый квартал '),
        second_qr=input('Введите прибыль за второй квартал '),
        third_qr=input('Введите прибыль за третий квартал '),
        fourth_qr=input('Введите прибыль за четвертый квартал ')
    )
    return res_tuple


result = {'high rate': [], 'low rate': []}
count_company = int(input('Введите кол-во предприятий '))
tup = [get_tuple() for i in range(count_company)]
sum_company = [int(i.first_qr) + int(i.second_qr) + int(i.third_qr) + int(i.fourth_qr) for i in tup]
avg_result = sum(sum_company) / count_company
for i in range(len(tup)):
    result['high rate'].append(tup[i].name) if sum_company[i] > avg_result else result['low rate'].append(tup[i].name)
print(f'Компании с высокой прибылью {result["high rate"]}')
print(f'Компании с низкой прибылью {result["low rate"]}')

