"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

quantity_enterprises = int(input('Введите количество предприятий: '))

Enterprise = namedtuple('Enterprise', 'name profit')
enterprises = []
profits = []

for i in range(quantity_enterprises):
    name = input(f'Введите название {i + 1}го предприятия: ')
    annual_profit = sum(map(int, input(
                        'Введите через пробел ежеквартальную прибыль данного предприятия за последний год: ').split()))
    profits.append(annual_profit)
    enterprise = Enterprise(name, annual_profit)
    enterprises.append(enterprise)

average_profit = sum(profits) / quantity_enterprises

less_average = [i.name for i in enterprises if i.profit < average_profit]
more_average = [i.name for i in enterprises if i.profit >= average_profit]

print(f'Предприятия, чья прибыль ниже среднего значения: {less_average}')
print(f'Предприятия, чья прибыль равна или выше среднего значения: {more_average}')
