"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""


from collections import namedtuple

number_enterprises = int(input('Введите количество предприятий для расчета прибыли: '))
res_lst = []
profit = []
for i in range(number_enterprises):
    RES = namedtuple(input('Введите название предприятия: '), 'average_profit')
    lst = list(map(int, input('через пробел введите прибыль данного предприятия'
                              ' за каждый квартал (Всего 4 квартала): ').split()))
    res_lst.append(RES(sum(lst)))
    profit.append(sum(lst))

average_profit = sum(profit) / number_enterprises

profit_max = []
profit_min = []
for i in res_lst:
    if i[0] > average_profit:
        profit_max.append(type(i).__name__)
    elif i[0] < average_profit:
        profit_min.append(type(i).__name__)

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print('Предприятия, с прибылью выше среднего значения: ', *profit_max)
print('Предприятия, с прибылью ниже среднего значения: ', *profit_min)
