"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

n = int(input('Введите количество предприятий: '))
company_tuple = namedtuple('Company', ['income_q1', 'income_q2', 'income_q3', 'income_q4'])
result = {}
for i in range(n):
    company = input('Введите название предприятия: ')
    print('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
    q1, q2, q3, q4 = map(int, input().split())
    result[company] = company_tuple(income_q1=q1, income_q2=q2, income_q3=q3, income_q4=q4)

total = ()
for company, profit in result.items():
    print(f'Годовая прибыль {company} : {sum(profit)} тыс.руб.')
    total += profit

avg_total = sum(total) / n
print(f'Средняя годовая прибыль всех предприятий: {avg_total}')

for company, profit in result.items():
    if sum(profit) > avg_total:
        print('Предприятия, с прибылью выше среднего значения:')
        print(f'{company} - {sum(profit)}')
    elif sum(profit) < avg_total:
        print('Предприятия, с прибылью ниже среднего значения:')
        print(f'{company} - {sum(profit)}')





