"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

company = namedtuple('firm', ['name', 'profit1', 'profit2', 'profit3', 'profit4'])


def average(company):
    return (company.profit1 + company.profit2 + company.profit3 + company.profit4) / 4


def analyze_company():
    company_list = []
    n = int(input('Введите количество предприятий для расчета прибыли: '))

    for i in range(n):
        name = input('Введите название предприятия: ')
        profit = input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
        company_list.append(company(name, *map(int, profit.split())))

    average_profit = sum(map(average, company_list)) / len(company_list)
    print(f'Средняя годовая прибыль всех предприятий: {average_profit}')

    less = []
    more = []

    for elem in company_list:
        if average(elem) < average_profit:
            less.append(elem.name)
        elif average(elem) > average_profit:
            more.append(elem.name)

    print(f'Предприятия, с прибылью выше среднего значения: {", ".join(more)}')
    print(f'Предприятия, с прибылью ниже среднего значения: {", ".join(less)}')


analyze_company()
