"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


def calculate():
    my_tuple = namedtuple("firm", "name profit")
    num = int(input("Введите количество предприятий для расчета прибыли: "))

    info_list = []
    min_list = []
    max_list = []
    avg_list = []
    total_profit = 0

    for i in range(num):
        name = input(f"Введите название предприятия № {i + 1}: ")
        profit = input("Через пробел введите прибыль данного предприятия за каждый квартал (всего 4 квартала): ")
        profit = sum(map(int, profit.split()))
        info = my_tuple(name, profit)
        info_list.append(info)
        total_profit += info.profit

    average = total_profit / num

    for firm in info_list:
        if firm.profit > average:
            max_list.append(firm.name)
        elif firm.profit < average:
            min_list.append(firm.name)
        else:
            avg_list.append(firm.name)

    print(f"Средняя годовая прибыль всех предприятий: {average}")
    print(f'Предприятия с прибылью выше среднего значения: {", ".join(max_list)}')
    print(f'Предприятия с прибылью ниже среднего значения: {", ".join(min_list)}')


calculate()
