"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

firms = namedtuple('firm', ['name', 'q1', 'q2', 'q3', 'q4'])


def info_firm():
    firms_list = []
    n = int(input('Введите количество фирм: '))

    for i in range(n):
        name = input(f'Название фирмы № {i + 1} - ')
        profit = input('Введите доходы за четыре квартала через пробел ')
        firms_list.append(firms(name, *map(int, profit.split())))

    average_profit = sum(map(average, firms_list)) / len(firms_list)
    print(f'Средняя годовая прибыль всех предприятий: {average_profit}')

    less_average = []
    above_average = []

    for el in firms_list:
        if average(el) < average_profit:
            less_average.append(el.name)
        elif average(el) > average_profit:
            above_average.append(el.name)

    print(
        f'Предприятия, с прибылью ниже среднего значения: {less_average}\n'
        f'Предприятия, с прибылью выше среднего значения: {above_average}')


def average(firms):
    return (firms.q1 + firms.q2 + firms.q3 + firms.q4) / 4


info_firm()
