"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple, defaultdict

company_dict = defaultdict(list)
company = namedtuple('name', 'profit')
count = int(input('Введите количество предприятий для расчета прибыли: '))
for i in range(count):
    company.name = input(f'Введите название {i+1} предприятия: ')
    company.profit = [int(i) for i in input('через пробел введите прибыль данного предприятия'
                                            ' за каждый квартал(Всего 4 квартала): ').split()]
    company_dict[company.name] = company.profit
avg_profit_company = [sum(prof) / len(prof) for prof in company_dict.values()]
avg_profit = sum(avg_profit_company) / len(avg_profit_company)

print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
print(f'Предприятия, с прибылью выше среднего значения: '
      f'{[name for name, prof in company_dict.items() if sum(prof) / len(prof) > avg_profit]}')
print(f'Предприятия, с прибылью ниже среднего значения: '
      f'{[name for name, prof in company_dict.items() if sum(prof) / len(prof) < avg_profit]}')
