"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

count = int(input('Количество компаний: '))
company = namedtuple('company', 'name profit')
companies = []
profit_sum = 0
lower = []
upper = []
for i in range(count):
    companies.append(company(input('Названий фирмы: '),
                             sum(list(map(float,
                                          input(
                                              'Прибыль фирмы за каждый квартал через пробел: ').split())))))
    profit_sum += companies[i].profit

avg_profit = profit_sum / len(companies)
for com in companies:
    if com.profit < avg_profit:
        lower.append(com.name)
    else:
        upper.append(com.name)
print(f'Средняя прибыль: {avg_profit}')
print('Предприятия, с прибылью выше среднего значения:')
for com in upper:
    print(com)
print('Предприятия, с прибылью ниже среднего значения:')
for com in lower:
    print(com)
