"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
import collections


corp = collections.defaultdict(int)
count = int(input('Введите количество предприятий: '))
for i in range(count):
    name = input('Введите название предприятия: ')
    profit = input('Введите прибыль за каждый квартал через пробел: ')
    sum_profit = sum([int(x) for x in profit.split()])
    corp[name] = sum_profit
mean = int(sum(corp.values()) / len(corp))

print('Средняя прибыль:', mean)
print('Предприятия с прибылью выше среднего:', ', '.join([x for x in corp.keys() if corp[x] > mean]))
print('Предприятия с прибылью ниже среднего:', ', '.join([x for x in corp.keys() if corp[x] < mean]))
