"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


def calc():
    companies = namedtuple('company', " name profit")
    companies_count = int(input('Введите количество предприятий: '))
    companies_lst = []

    for i in range(companies_count):
        name = input('Введите название предприятия: ')
        profit = input('Через пробел введите прибыль данного предприятия'
                       'за каждый квартал (Всего 4 квартала): ')
        companies_lst.append(companies(name, sum(map(int, profit.split()))))

    profit_avg = sum(el.profit for el in companies_lst) / companies_count

    print(f'Средняя годовая прибыль всех предприятий: {profit_avg}')
    print('Предприятия, с прибылью выше среднего значения:',
          ', '.join(el.name for el in companies_lst if el.profit > profit_avg))
    print('Предприятия, с прибылью ниже среднего значения:',
          ', '.join(el.name for el in companies_lst if el.profit < profit_avg))


calc()
