"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""


from collections import defaultdict

num = int(input('Введите количество предприятий для оценки: '))

companies = defaultdict(list)

for i in range(num):
    name = input('Введите название компании: ')
    profit = input('Через пробел введите прибыль данного предприятия а каждый квартал(Всего 4 квартала): ')
    for item in profit.split():
        companies[name].append(float(item))

average_profit = sum([sum(v) for v in companies.values()])/2

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')

print('Предприятия, с прибылью выше среднего значения:', end = ' ')
for item in [k for k, v in companies.items() if sum(v) > average_profit]:
    print(item, end=' ')
print('')

print('Предприятия, с прибылью ниже среднего значения:', end = ' ')
for item in [k for k, v in companies.items() if sum(v) < average_profit]:
    print(item, end=', ')
print('')