"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def func():
    companies = namedtuple("Company", "name period1 period2 period3 period4")
    num = int(input("Введите количество предприятий для расчёта прибыли: "))
    info = {}

    for i in range(num):
        firm = companies(name=input("Введите название фирмы:"),
                         period1=int(input("Введите прибыль за первый квартал")),
                         period2=int(input("Введите прибыль за второй квартал")),
                         period3=int(input("Введите прибыль за третий квартал")),
                         period4=int(input("Введите прибыль за четвёртый квартал")))

        info[firm.name] = (firm.period1 + firm.period2 + firm.period3 + firm.period4) / 4

    total = 0
    for i in info.values():
        total += i
    total /= num
    print('Средняя годовая прибыль всех фирм - ', total)

    for key, value in info.items():
        if value > total:
            print(key, " - фирма с повышенной прибылью")
        elif value < total:
            print(key, " - фирма с пониженной прибылью")
        else:
            print(key, " - фирма со сбалансированной прибылью")


print(func())
