"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

import collections

def func1(ntuple):
    result = (ntuple.profit1 + ntuple.profit2 + ntuple.profit3 + ntuple.profit4) / 4
    return result

def func2():
    company_list = []
    n = int(input('Введите количество предприятий для расчета прибыли '))

    for i in range(n):
        name = input('Введите название предприятия ')
        profit = input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала) ')
        company_list.append(ntuple1(name, *map(int, profit.split())))

    average_profit = sum(map(func1, company_list)) / len(company_list)
    print(f'Средняя годовая прибыль всех предприятий {average_profit}')

    less = []
    more = []

    for elem in company_list:
        if func1(elem) < average_profit:
            less.append(elem.name)
        elif func1(elem) > average_profit:
            more.append(elem.name)

    print(f'Предприятия, с прибылью выше среднего значения: {", ".join(more)}')
    print(f'Предприятия, с прибылью ниже среднего значения: {", ".join(less)}')


ntuple1 = collections.namedtuple('company', ['name', 'profit1', 'profit2', 'profit3', 'profit4'])


func2()