"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


COMPANY = namedtuple('Company_profit', 'company_name profit')


def input_company():
    name = input('Введите название компании: ')
    prof = input(f'Введите доход за квартал: ').split()
    return COMPANY(company_name=name, profit=sum([int(_) for _ in prof]))


count_company = int(input('Введите количество компаний: '))
company_list = [input_company() for _ in range(count_company)]
average_profit = sum(_.profit for _ in company_list) / count_company
above = [_.company_name for _ in company_list if _.profit > average_profit]
below = [_.company_name for _ in company_list if _.profit < average_profit]

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {above}')
print(f'Предприятия, с прибылью ниже среднего значения: {below}')
