"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import defaultdict, deque

num_company = int(input('Введите количество предприятий для расчета прибыли: '))
company_dict = defaultdict(int)
for i in range(num_company):
    name_company = input('Введите название предприятия: ')
    profit = input('Через пробел введите прибыль данного предприятия за каждый квартал (Всего 4 квартала): ')
    profit_comp = sum(list(map(int, profit.split(' '))))
    company_dict[name_company] = profit_comp

average_profit = sum(company_dict.values())/len(company_dict)
above_avr_comp = deque([])
below_average = deque([])

for key, val in company_dict.items():
    if val > average_profit:
        above_avr_comp.append(key)
    else:
        below_average.append(key)

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {" ".join(above_avr_comp)}')
print(f'Предприятия, с прибылью ниже среднего значения: {" ".join(below_average)}')