"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple
try:
    f_сount = int(input('Введите количество предприятий для расчета прибыли: '))
except ValueError:
    print('Не корректный ввод количества предприятий')
    exit()
my_list = []
profits = {}
avg_profit = 0
for i in range(f_сount):
    f_name = input('Введите название предприятия: ')
    try:
        fst_, snd_, frd_, fth_ = input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ').split(' ')
    except ValueError:
        print('Не корректный ввод прибыли')
        exit()
    else:
        FIRM = namedtuple(f'{f_name}', 'fst snd frd fth')
        FIRM_PARTS = FIRM(
            fst=int(fst_),
            snd=int(snd_),
            frd=int(frd_),
            fth=int(fth_)
        )
        profits[f_name] = FIRM_PARTS.fst + FIRM_PARTS.snd + FIRM_PARTS.frd + FIRM_PARTS.fth

for val in profits.values():
    avg_profit += val
avg_profit /= f_сount
print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
print(f'Предприятия, с прибылью выше среднего значения:')
for key, val in profits.items():
    if val > avg_profit:
        print(key, end=' ')
print(f'\nПредприятия, с прибылью ниже среднего значения:')
for key, val in profits.items():
    if val < avg_profit:
        print(key, end=' ')
