#!/usr/bin/env python3

from collections import namedtuple

"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

Company = namedtuple('Company', ['name', 'profit'])


def get_company() -> Company:
    return Company(
        name=input(f'Введите название предприятия: '),
        profit=sum(map(int, input(f'Введите прибыль предприятия через пробел: ').split()))
    )


def main():
    count = int(input('Введите количество предприятий: '))
    companys = [get_company() for _ in range(count)]
    avg_profit = sum([x.profit for x in companys]) / count

    avg_max_companys = ", ".join([x.name for x in list(filter(lambda x: float(x.profit) > avg_profit, companys))])
    avg_min_companys = ", ".join([x.name for x in list(filter(lambda x: float(x.profit) < avg_profit, companys))])

    print(
        f"Средняя годовая прибыль всех предприятий: {avg_profit}\n"
        f"Предприятия, с прибылью выше среднего значения: {avg_max_companys}\n"
        f"Предприятия, с прибылью ниже среднего значения: {avg_min_companys}\n"
    )


if __name__ == '__main__':
    main()
