"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

i = int(input('Введите количество предприятий: '))
companies = []
n = 1
while n <= i:
    company = input('Введите название предприятия: ')
    profit = input('Через пробел введите прибыль данного предприятия за каждый квартал: ')
    card = namedtuple('company_card', 'company summary_profit')
    comp_tuple = card(
        company=company,
        summary_profit=sum(int(i) for i in profit.split(' '))
    )
    companies.append(comp_tuple)
    n += 1
summary = 0
for prof in companies:
    summary += prof.summary_profit
avg_prof = summary / i
more = []
less = []
for comp in companies:
    if comp.summary_profit >= avg_prof:
        more.append(comp.company)
    else:
        less.append(comp.company)
print(f'Средняя годовая прибыль всех предприятий: {avg_prof}')
print(f'Предприятия, с прибылью выше среднего значения: {", ".join(more)}')
print(f'Предприятия, с прибылью ниже среднего значения: {", ".join(less)}')

