"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
import collections


def company(valued):
    dic = {}
    while valued != 0:
        plus = ''
        if len(dic) != 0:
            plus = 'другого '
        named = input(f'Введите название {plus}предприятия: ')
        four_income = input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
        lst_income = four_income.split(' ')
        for i in range(len(lst_income)):
            lst_income[i] = int(lst_income[i])
        Income_company = collections.namedtuple(f'{named}', ['income_for_1_year'])
        all_info = Income_company(income_for_1_year=sum(lst_income))
        dic.update({named: all_info.income_for_1_year})
        valued -= 1

    lst_max = []
    lst_min = []
    for value in dic.values():
        if value > round(sum(dic.values())/2):
            lst_max.append()
        else:
            lst_min.append(value)

    return print(lst_max, lst_min)


print(company(int(input('Введите количество предприятий для расчета прибыли: '))))

# return f'Средняя годовая прибыль всех предприятий: {round(sum(dic.values()) / 2)}\n' \
#        f'Предприятия, с прибылью выше среднего значения: {value}\n' \
#        f'Предприятия, с прибылью ниже среднего значения: {value}'