"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def get_org_params():
    """
    Сбор данных по организациям от пользователя.
    :return: namedtuple
    """
    org = namedtuple('Organizations', 'id name year_profit')
    org_list = list()
    org_count = int(input("Введите количество предприятий для расчета прибыли: "))
    print(org_count)

    if org_count == 0:
        return

    for x in range(org_count):
        org_name = input("Введите название предприятия: ")
        print(org_name)
        year_profit = input("Через пробел введите прибыль данного предприятия за каждый "
                            "квартал(Всего 4 квартала): ")
        print(year_profit)
        org_list.append(
            org(
                id=x + 1,
                name=org_name,
                year_profit=sum([int(e) if e.isdigit() else e for e in year_profit.split(" ")])
            )
        )

    return org_list


def calc_avg_profit(org_data):
    """
    Рассчёт средней годовой прибыли всех предприятий.
    :param org_data:
    :return: int
    """
    return sum([x.year_profit for x in org_data]) / len(org_data)


orgs = get_org_params()
if orgs:
    avg_p = calc_avg_profit(orgs)
    print(f"Средняя годовая прибыль всех предприятий: {avg_p}")
    print("Предприятия, с прибылью выше среднего значения: ", *[x.name for x in orgs if x.year_profit > avg_p])
    print("Предприятия, с прибылью ниже среднего значения: ", *[x.name for x in orgs if x.year_profit < avg_p])
else:
    print("С данными что-то не так!")

