"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import Counter


all_company = {}
for i in range(int(input('Введите количество компаний:'))):
    name_company = input('Введите название компании:')
    one_company = Counter(a=int(input('первый квартал:')),
                          b=int(input('второй квартал:')),
                          c=int(input('третий квартал:')),
                          f=int(input('четвертый квартал')))
    all_company[name_company] = one_company
sum_company = 0
for k, v in all_company.items():
    sum_c = sum([value for key, value in v.items()])
    sum_company += sum_c

medium_income = sum_company / len(all_company)
print(medium_income)

for k, values in all_company.items():
    if sum([value for key, value in values.items()]) > medium_income:
        print(f'Предприятия, с прибылью выше среднего значения:{k}')
    else:
        print(f'Предприятия, с прибылью ниже среднего значения: {k}')
