"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

my_var = "Company"
n = int(input("Введите количество предприятий: "))
companies = namedtuple(my_var, "name period_1 period_2 period_3 period_4")
profit_aver = {}

for i in range(n):
    company = companies(
        name=input("\nВведите название предприятия: "), period_1=int(
            input("Введите прибыль за 1 квартал: ")), period_2=int(
            input("Введите прибыль за 2 квартал: ")), period_3=int(
            input("Введите прибыль за 3 квартал: ")), period_4=int(
            input("Введите прибыль за 4 квартал: ")))

    profit_aver[company.name] = (
        company.period_1 + company.period_2 +
        company.period_3 + company.period_4) / 4

total_aver = 0
for value in profit_aver.values():
    total_aver += value
total_aver = total_aver / n

print(f'\nСредняя годовая прибыль всех предприятий: {total_aver}')

for key, value in profit_aver.items():
    if value > total_aver:
        print(f"Предприятия, с прибылью выше среднего значения: {key}")
    elif value < total_aver:
        print(f"Предприятия, с прибылью ниже среднего значения: {key}")
    elif value == total_aver:
        print(f"{key}: предприятия равны ")

