"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import defaultdict


def companies_profit():
    companies = defaultdict(list)
    num = int(input('Введите количество предприятий для расчета прибыли: '))
    avg_profit = 0
    company_status = defaultdict(list)

    for i in range(num):
        company = input('Введите название предприятия: ')
        profit = list(map(int, input('через пробел введите прибыль данного предприятия '
                                     'за каждый квартал(Всего 4 квартала):').split( )))
        companies[company].extend(profit)
        avg_profit += sum(profit) / (4 * num)

    for k, v in companies.items( ):
        if sum(v) / 4 < avg_profit:
            company_status['below average'].append(k)
        else:
            company_status['above average'].append(k)

    print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
    print(f'Предприятия, с прибылью выше среднего значения: {company_status["above average"]} \n'
          f'Предприятия, с прибылью ниже среднего значения: {company_status["below average"]}')


if __name__ == '__main__':
    companies_profit()
