"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
import collections
year_aver = 0
profit_dict = collections.defaultdict(list)
firms_num = int(input('Введите количество предприятий для расчета прибыли:'))
for i in range(firms_num):
    key = input('Введите название предприятия:')
    q_profits = (input("через пробел введите прибыль данного предприятия\n"
    "за каждый квартал(Всего 4 квартала):")).split()
    all_profit = sum(( float(i) for i in q_profits))
    profit_dict[key].append(q_profits)
    profit_dict[key].append(all_profit)
    year_aver += all_profit
year_aver = year_aver / firms_num
for key, profit in profit_dict.items():
    if profit[1] < year_aver:
        print(f'Прибыль фирмы {key} меньше средней.')
    elif profit[1] > year_aver:
        print(f'Прибыль фирмы {key} больше средней.')
    else:
        print(f'Прибыль фирмы {key} равна средней.')
