"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def average_profit():
    COMPANY = namedtuple("Company", "Comp_name quarter1 quarter2 quarter3 quarter4")
    number = int(input('Введите количество компаний: '))
    profit_of_companys = dict()
    profit = 0
    for el in range(number):
        name = input('Введите название предприятия: ')
        quarters = \
            input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ').split(' ')
        COMP = COMPANY(name, *quarters)
        new_quarters = [int(i) for i in quarters]
        years_profit = sum(new_quarters)
        profit += years_profit
        profit_of_companys[COMP.Comp_name] = years_profit
    profit = profit / number
    print(f'Средняя годовая прибыль всех предприятий: {profit}')
    for el in profit_of_companys:
        if profit_of_companys[el] > profit:
            print(f'Предприятие, с прибылью выше среднего значения: {el}')
        else:
            print(f'Предприятие, с прибылью ниже среднего значения: {el}')


average_profit()

