"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

import collections

# создаем шаблон кортежа
firm_template = collections.namedtuple('firm', 'id name profit1 profit2 profit3 profit4 total_profit')
# список предприятий
firm_list = []

cnt = int(input('Введите количество предприятий для расчета прибыли: '))
for i in range(1, cnt + 1):
    name = input('Введите название предприятия: ')
    list_income = list(map(int, input(
        'Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ').split()))
    # заполняем шаблон данными
    v_firm = firm_template(i, name, *list_income, sum(list_income))
    print(v_firm)
    firm_list.append(v_firm)

#  print(f'Список предприятий: {firm_list}')
s = sum(map(lambda i: i.total_profit, firm_list)) / cnt
print(f'Средняя годовая прибыль всех предприятий: {round(s, 2)}')
h_list = list(filter(lambda i: i.total_profit >= s, firm_list))
h = ','.join(map(lambda i: i.name, h_list))
print(f'Предприятия, с прибылью выше среднего значения: {h}')
l_list = list(filter(lambda i: i.total_profit < s, firm_list))
l = ','.join(map(lambda i: i.name, l_list))
print(f'Предприятия, с прибылью ниже среднего значения: {l}')
