"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import Counter 


def inter_fabric(count_f,i = 0, fabrisc = Counter({})): 
    
if i == count_f:
    min_fab = []
    max_fab = []
    print(fabrisc)
    mid = sum(fabrisc.values())/count_f
    print(f"Среднегодовая прибыль всех предприятий: {mid}")
    for key, vals in list(fabrisc.items()): 
        if vals > mid:
            max_fab.append(key)
        else:
            min_fab.append(key)
    print(f"Предприятия, с прибылью выше среднего значения {max_fab}")
    print(f"Предприятия, с прибылью ниже среднего значения {min_fab}")
else:
    fabric_name = input('Введите название предприятия: ')
    fabric_frofit = input('через пробел введите прибыль данного предприятия: ')
    year_profit = sum(list(map(lambda x: int(x), fabric_frofit.split())))
    fabrisc.update({fabric_frofit:year_profit})
    i = i+1
        inter_fabric(count_f, i, fabrisc)
    
        

inter_fabric(int(input('Введите количество предприятий: ')))