"""
Задача 3.
В соответствии с документацией Python,
deque – это обобщение стеков и очередей.
Вот основное правило: если вам нужно что-то быстро дописать или вытащить, используйте deque.
Если вам нужен быстрый случайный доступ, используйте list.

Задача: 
1) создайте простой список (list) и очередь (deque). Сделайте замеры и оцените что заполняется быстрее.
2) Выполните различные операции с каждым из объектов. Сделайте замеры и оцените, где и какие операции быстрее.

Не забудьте, что сравнивать, например, можно операцию appendleft дека и insert списка и т.д.
"""
from collections import deque

d = deque([0] * 1000000)
while d:
    d.popleft()
    if len(d) % 100 == 0:
        print(len(d))

lst = [0] * 1000000
while lst:
    lst.pop(0)
    if len(lst) % 100 == 0:
        print(len(lst))

"""
Все элементы в списке размещаются в памяти последовательно, поэтому, 
если  удалить какой-либо элемент, все последующие элементы  
смещяются на одну позицию влево, поэтому время, необходимое для удаления или вставки 
элемента в начале списка, пропорционально длине списка. Deque, с другой стороны, 
специально сконструирован, чтобы обеспечить быструю вставку или удаление на конце либо 
"""
