"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

comps = []
comp = namedtuple('comp', ['name', 'i', 'ii', 'iii', 'iv'])

for s in range(int(input('Введите количество предприятий для расчета прибыли: '))):
    n = input('Введите название предприятия: ')
    i, ii, iii, iv = [int(x) for x in input('через пробел введите прибыль данного предприятия за каждый квартал(Всего '
                                            '4 квартала): ').split()]
    comps.append(comp(n, i, ii, iii, iv))
av_pr = 0  # Среднегодовая
pr_pr = []  # Список с годовыми прибылями компаний
for k in range(len(comps)):
    pr_pr.append(comps[k].i + comps[k].ii + comps[k].iii + comps[k].iv)
    av_pr += (comps[k].i + comps[k].ii + comps[k].iii + comps[k].iv) * 0.5
print(f'Средняя годовая прибыль всех предприятий: {av_pr}')
print(
    'Предприятия с прибылью выше среднего '
    f'значения: {" ".join([comps[l].name for l in range(len(pr_pr)) if pr_pr[l] > av_pr])}')
print(
    'Предприятия с прибылью ниже среднего '
    f'значения: {" ".join([comps[l].name for l in range(len(pr_pr)) if pr_pr[l] < av_pr])}')
