"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import defaultdict


income_table = defaultdict(list)
amount_company = int(
    input('Введите количество предприятий для расчета прибыли: '))

for i in range(amount_company):
    company_name = input('Введите название предприятия: ')
    income = map(int, input('Через пробел введите прибыль данного предприятия \
за каждый квартал (Всего 4 квартала): ').split())
    income_table[company_name] = sum(income)

avg_inc = sum(income_table.values()) / amount_company
more_avg = []
less_avg = []

for name, inc in income_table.items():
    if inc > avg_inc:
        more_avg.append(name)
    else:
        less_avg.append(name)


print(f'Средняя годовая прибыль всех предприятий: {avg_inc}.')
print(f'Предприятия, с прибылью выше среднего значения: {more_avg}.')
print(f'Предприятия, с прибылью ниже среднего значения: {less_avg}.')
