"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


def profit_calc():
    BUSINESS = namedtuple('saler', 'firm_name profit_1 profit_2 profit_3 profit_4')
    quantity_firms = int(input('Введите количество фирм'))
    year_profit = {}
    for el in range(quantity_firms):
        info = BUSINESS(
            firm_name=input('Введите название предприятия: '),
            profit_1=int(input('Введите прибыль за первую четверть')),
            profit_2=int(input('Введите прибыль за вторую четверть')),
            profit_3=int(input('Введите прибыль за третью четверть')),
            profit_4=int(input('Введите прибыль за четвертую четверть')))
        year_profit[info.firm_name] = info.profit_1 + info.profit_2 + info.profit_3 + info.profit_4
    mid_profit = sum(year_profit.values())/len(year_profit)
    print(f'Средняя прибыль всех предприятий: {mid_profit}')
    for key, value in year_profit.items():
        if value > mid_profit:
            print(f'Прибыль предприятия {key} выше среднего значения')
        if value < mid_profit:
            print(f'Прибыль предприятия {key} ниже среднего значения')
        if value == mid_profit:
            print(f'Прибыль предприятия {key} равна среднему значению')


profit_calc()
