"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

COMP = namedtuple('company', 'name q_1 q_2 q_3 q_4')
comp_d = {}
try:
    numb_firm = int(input('Введите количесивр фирм: '))

    for i in range(numb_firm):
        company = COMP(
            name=input('Введите название компании: '),
            q_1=int(input('Введите прибыль за первый квартл: ')),
            q_2=int(input('Введите прибыль за второй квартл: ')),
            q_3=int(input('Введите прибыль за трейтий квартл: ')),
            q_4=int(input('Введите прибыль за четвертый квартл: '))
        )
        comp_d[company.name] = (company.q_1 + company.q_2 + company.q_3 + company.q_4) / 4
except ValueError:
    print('Ошибка ввода данных')

average = sum(comp_d.values()) / numb_firm
more_aver = [k for k in comp_d if comp_d[k] > average]
les_aver = [k for k in comp_d if comp_d[k] < average]
print(f'Средняя годовая прибыль всех предприятий: {average:.2f}\n'
      f'Предприятия, с прибылью выше среднего значения: {", ".join(more_aver)}\n\n'
      f'Предприятия, с прибылью ниже среднего значения: {", ".join(les_aver)}')
