"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import defaultdict

avg_profit = 0
i = 1

firm_count = int(input('Введите количество предприятий: '))

firm_dict = defaultdict(list)


while i <= firm_count:
    firm_name = input(f'Введите название фирмы : ')

    income = input(' Через запятую "," введите прибыль за 4 кварталла ').split(',')
    if len(income) != 4:
        print('Неверный ввод. Нужно ввести прибыль за 4 квартала.')
        continue

    firm_dict[firm_name] = list(map(float, income))

    avg_profit += sum(firm_dict[firm_name])
    i = i + 1

average_profit = round(avg_profit / firm_count, 2)

top_firm = [name for name in firm_dict if sum(firm_dict[name]) > average_profit]
worst_firm = [name for name in firm_dict if sum(firm_dict[name]) < average_profit]

print(f'Средняя годовая прибыль всех предприятий: {average_profit}\n'
      f'Предприятия, с прибылью выше среднего значения: {", ".join(top_firm)}\n'
      f'Предприятия, с прибылью ниже среднего значения: {", ".join(worst_firm)}')