"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
# 1 n^2 - дважды перебор?
def func_1():
    list_1 = [1, 4, 122, 112]
    min_val = 0
    for n in list_1:
        for j in list_1:
            if j >= n:
                min_val = n

    print(min_val)

func_1()
# Итог, я не понял как это сделать без без сорт и мин, либо можно без двойного for, не понимаю зачем оно тут

# 2

def func_2():
    list_1 = [1, 4, 122, 112]  # O(1)
    min_val = list_1[-1]  # O(1)
    for n in list_1:  # O(n)
        if min_val >= n:  # O(1)
            min_val = n  # O(1)

    print(min_val)
# Сложность # O(n)

func_2()








