# Для своего примера я использовала словари и классы.Простой  и наглядный пример птимизации памяти.
import sys

my_object = {'x': 1, 'y': 2, 'z': 3}


class Point:
    #
    def __init__(self, x, y, z):
        self.x = x
        self.y = y
        self.z = z


ob_class = Point(1, 2, 3)

print(f'Использование обычного словаря: {sys.getsizeof(my_object)}')  # 232
print(f'Использование экземпляра класса Point: {sys.getsizeof(ob_class.__dict__)}')  # 104


# Вывод
# Словарь экземпляра класса занимает меньше места в оперативной памяти,
# что обычный словарь, что и требовалось доказать
