"""
Задание 4.
Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.
Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована. А если нет, то польз-лю нужно предложить ее пройти.
Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход, который вы придумаете, например, реализовать словарь.
"""
# Функция 1                                                                 Общая сложность строки
def entrance():
    user_login = input('Введите логин: ')                                   #O(1)
    try:
        user_data = users[user_login]                                       #O(1)
    except:
        print('Такой пользователь не зарегистрирован')                      #O(1)
    else:
        password = input('Введите пароль: ')                                #O(1)
        if user_data[0] == password:                                        #O(1)
            if user_data[1]:                                                #O(1)
                print('Вы успешно авторизовались в системе')                #O(1)
            else:
                print('Ваш аккаунт не актививрован\nАктивировать?')         #O(1)
                input('да/нет: ') #далее может быть функция для активации   O(1)
        else:
            print('Пароль не верный')                                       #O(1)
#Общая сложность O(1)

def entrance2():
    user_login = input('Введите логин: ')                                   #O(1)
    try:
        user_data = users2[user_login]                                      #O(1)
    except:
        print('Такой пользователь не зарегистрирован')
    else:
        password = input('Введите пароль: ')                                #O(1)
        if user_data[0] == password:                                        #O(1)
            if len(user_data) < 2:                                          #O(1)
                print('Вы успешно авторизовались в системе')                #O(1)
            else:
                print('Ваш аккаунт не актививрован\nАктивировать?')         #O(1)
                input('да/нет: ') #далее может быть функция для активации   O(1)
        else:
            print('Пароль не верный')                                       #O(1)
#Общая сложность O(1)

users = {
        'user1': ['sdkjasdfiu', True],
        'user2': ['2345ef', False],
        'user3': ['t776gdfgh', True],
        'user4': ['4651654', True]
         }
users2 = {
        'user1': ['sdkjasdfiu'],
        'user2': ['2345ef', False],
        'user3': ['t776gdfgh'],
        'user4': ['4651654']
         }

entrance()
entrance2()


