"""
Задание 3.
Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
"""
info = {'comp1': 1000, 'comp2': 2000, 'comp3': 500, 'comp4': 1500}

#Алгоритм 1                                 Общая сложность строки кода
comp = ''                                   #O(1)
max_profit = 0                              #O(1)
for i in info.keys():                       #O(n)
    current_key = i                         #O(1)
    current_profit = info[i]                #O(1)
    if current_profit > max_profit:         #O(1)
        comp = i                            #O(1)
        max_profit = current_profit         #O(1)
print(comp, max_profit)                     #O(1)
# Общая сложность O(n)

#Алгоритм 2
comp = ''                                   #O(1)
max_profit = sorted(info.values())[-1]      #O(nlog(n))
for i in info.keys():                       #O(n)
    if max_profit == info[i]:               #O(1)
        comp = i                            #O(1)
print(comp, max_profit)                     #O(1)
# Общая сложность O(n)

#Так как, оба решения имеют итоговую сложность O(n) (линейны), то они равнозначны при их оценке по критерию O-большое