"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
"""

def min1(lst_obj):              #Сложность O(n^2)
    min = lst_obj[0]
    for i in lst_obj:
        for j in lst_obj:
            if j < i and j < min:
                min = j
                break
    return min

def min2(lst_obj):              #Сложность O(n)
    min = lst_obj[0]
    for i in lst_obj[1:]:
        if i < min:
            min = i
    return min
