""" Эркуру домашнее задание 1 Задача 2

Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

#1 функция
def check_min(lst_obj):
    """цикл в цикле, поиск минимального значения через сравнение
    """
    for j in (lst_obj): 
        for i in (lst_obj):
            if j<= i:
               i_min = j
            else 
               i_min = i
return i_min

#сложность O(N)*O(N) = O(N^2)

#2 функция
def check_min(lst_obj):
    """поиск максимального значения в одном цикле  """
    max_j = lst_obj[0]

    for j in (lst_obj): 
    	if max_j < j:
    		max_j = j
return max_j