"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
import random
import time


def my_timer(callback):
    """Функция секундомер, для подсказки"""
    def my_tmp(*args, **kwargs):
        start = time.perf_counter_ns()
        res = callback(*args, **kwargs)
        print("Время выполнения функции:", f'{(time.perf_counter_ns() - start)/(10**6):.03f}', 'мс')
        return res
    return my_tmp


@my_timer
def check_1(lst_obj):
    """Функция сравнивает каждое число из списка со всеми числами из списка.
    Переменные:
    :param: lst_obj = my_lst - список чисел
    :return: min number from my_list
    * сложность функции O(n**2)
    """
    min_n = lst_obj[0]
    for n in lst_obj:                   # O(n)
        for i in lst_obj:               # O(n)
            if n < min_n <= i:          # O(1)
                min_n = n               # O(1)
    return min_n                        # O(1)


@my_timer
def check_2(lst_obj):
    """
    Функция сравнивает два числа из списка и запоминает наименьшее из все сравнений
    :param lst_obj: - список чисел
    :return: min number from my_list
    * сложность функции O(n)
    """
    min_n = lst_obj[0]
    for i in lst_obj:       # O(n)
        if i < min_n:       # O(1)
            min_n = i       # O(1)
    return min_n            # O(1)


my_lst = random.sample(range(-100000, 100000), 5000)
# my_lst = [84, -98, -21, 17, 20, -8, -79, 51, 8, 25]
# my_lst = [-29, -33, -39, 54, -27, -8, 44, -4, 6, -81]
print(my_lst, '\n')
print('1. min number:', check_1(my_lst), '\n')
print('2. min number:', check_2(my_lst), '\n')
