"""
Задание 1.
Для каждой из трех функций выполнить следующее:
1) для каждого выражения вместо !!! укажите сложность этого выражения.
2) определите сложность каждой функции в целом.
Сложность нужно определять только там, где указаны символы !!!
Примечание:
Прошу вас внимательно читать ТЗ и не выполнять все пункты.
"""

import random


#############################################################################################
def check_1(lst_obj):
    """Функция должна создать множество из списка.
    Алгоритм 3:
    Создать множество из списка
    Сложность: O(n).
    """
    lst_to_set = set(lst_obj)  # O(len....) => O(n)
    return lst_to_set  # O(1)


#############################################################################################
def check_2(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.
    Алгоритм 1:
    Проходимся по списку и для каждого элемента проверяем,
    что такой элемент отстутствует
    в оставшихся справа элементах
    Сложность: O(n**2).
    """
    for k in range(len(lst_obj)):          # O(1)+O(n)
        if lst_obj[k] in lst_obj[k+1:]:    # O(n**2)
            return False                   # O(1)
    return True                            # O(1)


#############################################################################################
def check_3(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.
    Алгоритм 2:
    Вначале выполним для списка сортировку, далее, сравниваем элементы попарно
    Если присутствуют дубли, они будут находиться рядом.
    Сложность: O(n log n)
    """
    lst_copy = list(lst_obj)                 # O(1)
    lst_copy.sort()                          # O(n log n)
    for i in range(len(lst_obj) - 1):        # O(1)+O(n)
        if lst_copy[i] == lst_copy[i+1]:     # O(1)
            return False                     # O(1)
    return True                              # O(1)


#############################################################################################
# c:\users\user\appdata\local\programs\python\python39\lib\site-packages
# (Lesson 1) C:\Users\user\Documents\Geekbrains\IV unit - Python ALG\Lesson 1>
# зачистить Path windows от Pylint
s = 0


for j in (50, 500, 1000, 5000, 10000):
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)

    s += 1
    print(s, len(lst), lst)

print('answer 1', check_1(lst))
print('answer 2', check_2(lst))
print('answer 3', check_3(lst))
