"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

# 1. Сложность алгоритма : O(n) - линейная"""


def smallest_find(lst):
    smallest_num = lst[0]  # O(1)
    for i in lst:  # O(n)
        if i < smallest_num:  # O(1)
            smallest_num = i  # O(1)
    return smallest_num  # O(1)


# 2. Сложность алгоритма : O(n^2) - квадратичная."""


def smallest_find_2(lst):  # O(1)
    for i in range(len(lst)):  # O(n)
        is_smallest = True  # O(1)
        for j in range(i, len(lst)):  # O(n)
            if lst[i] > lst[j]:  # O(1)
                is_smallest = False  # O(1)
                break  # O(1)
        if is_smallest:  # O(1)
            return lst[i]  # O(1)
    return lst[-1]  # O(1)


lst = [15, 16, 17, 19]
lst_2 = [15, 10, 7, 1, -5]
print(smallest_find(lst))
print(smallest_find_2(lst))
print(smallest_find(lst_2))
print(smallest_find_2(lst_2))