
"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

# O(n)


def min_value_1(n):
    low = n[0]                      # O(1)
    for i in n:                     # O(n)
        if i < low:                 # O(1)
            low = i                 # O(1)
    return low                      # O(1)

# O(n**2)


def min_value_2(n):
    new_lst = []                    # O(1)
    while n:                        # O(n)
        minimum = n[0]              # O(1)
        for i in n:                 # O(n)
            if i < minimum:         # O(1)
                minimum = i         # O(1)
        new_lst.append(minimum)     # O(1)
        n.remove(minimum)           # O(n)
    return new_lst[0]               # O(1)


lst = [65, 40, 90, 66, 112, 11, 9342, 214, 65, 234]

print(min_value_1(lst))
print(min_value_2(lst))
# +
