"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
list_users = {
    'pol1' : ( 'qwerty', True),
    'pol2' : ('1234asd', True),
    'pol3' : ('zxcv', False)
}

#O(n)
def authentication1(user_name, user_passwd, lst):
        for key, val in lst.items():
            if key == user_name:
                if val[1] == True:
                    if val[0] == user_passwd:
                        return "Добро пожаловать"
                    else:
                        return "Пароль не верен"
                else:
                    return "Пользователь не активен. Пройдите активацию"

        return "Пользователь не найден"


#O(1)
def authentication2(user_name, user_passwd, lst):
    if lst.get(user_name):
        if lst[user_name][0] == user_passwd and lst[user_name][1] == True:
            return "Добро пожаловать"
        elif lst[user_name][0] == user_passwd and lst[user_name][1] != True:
            return "Пользователь не активен. Пройдите активацию"
        elif lst[user_name][0] != user_passwd:
            return "Пароль не верный"
        else:
            "Пользователя не существует"





print(authentication1('pol2', '1234asd', list_users))
print(authentication2('pol3', 'zxcv', list_users))
