"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
data = {
    'Sten': ['123', True],
    'Vik': ['456', True],
    'Karl': ['789', False],
    'Sem': ['000', False]
}
data2 = {
    'Mila': ['123', True],
    'Kate': ['456', True],
    'Sarah': ['789', False],
    'Olga': ['000', False]
}


# Сложность O(1)
def auth_1(name, passw):
    if name not in data:                                          # O(1) - очень надеюсь что это так, в списке это O(N)
        return "Пользователь не найден."                                    # O(1)
    elif passw != data[name][0]:                                            # O(1)
        return "Пароль не верен. Попробуйте еще раз."                       # O(1)
    elif data[name][1]:                                                     # O(1)
        return "Вход разрешен."                                             # O(1)
    else:
        return "Учётная запись не активирована. Подтвердите через e-mail."  # O(1)


# Сложность O(n)
def auth_2(name, passw):
    for i in data2.keys():                                                  # O(n) т.к. цикл
        if i != name:                                                       # O(1)
            continue                                                        # O(1)
        elif passw != data2[i][0]:                                          # O(1)
            return "Пароль не верен. Попробуйте еще раз."                   # O(1)
        elif data2[name][1]:                                                # O(1)
            return "Вход разрешен."                                         # O(1)
        else:
            return "Учётная запись не активирована. Подтвердите через e-mail."  # O(1)
    return "Пользователь не найден."                                        # O(1)


print("Введите свой логин и пароль")
login = input('Логин: ')
password = input('Пароль: ')
print(auth_1(login, password))
print(auth_2(login, password))

"""
Первое решение эффективнее, т.к. константная сложность лучше линейной
"""