"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


def check_min_1(list_obj):
    """Сложность функции O(N**2)"""
    min_number = list_obj[0]  # O(1)
    for i in range(len(list_obj)):  # O(N)
        for j in list_obj:  # O(N)
            if list_obj[i] < j and list_obj[i] < min_number:  # O(1)
                min_number = list_obj[i]  # O(1)
    return min_number  # O(1)


def check_min_2(list_obj):
    """Сложность функции O(N)"""
    min_number = list_obj[0]  # O(1)
    for i in range(len(list_obj)):  # O(N)
        if list_obj[i] < min_number:  # O(1)
            min_number = list_obj[i]  # O(1)
    return min_number  # O(1)


test_list = [5, 6, 99, 126, 9, 2, 8, 9]

print(check_min_1(test_list))
print(check_min_2(test_list))
