"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""


# O(n)


def min_value(list_1):

    min_val = list_1[0]  # O(1)

    for el in range(len(list_1) - 1):  # O(n)
        if list_1[el] < min_val:  # O(n)
            min_val = list_1[el]  # O(1)
    return min_val  # O(1)


# O(n ^ 2)


def min_value_2(list_2):

    minimal = list_2[0]

    for el in list_2:
        if el < minimal:
            minimal = el
    return minimal


my_list = [78, 85, 64, 55, 5, 2, 7]
print(min_value(my_list))
print(min_value_2(my_list))
