"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

USERS_LST = ({'name': 'Василий', 'passwd': '111', 'activate': 0},
             {'name': 'root', 'passwd': '54321', 'activate': 0},
             {'name': 'admin', 'passwd': '9852665ffd_vnn_22JJ', 'activate': 0})


"""
Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.
"""


def autorization(tup):                              # O(n)
    name = (input('Введите имя пользователя:\n'))   # O(1)
    password = (input('Введите пароль:\n'))         # O(1)
    activate_index = 0                              # O(1)

    for i in range(len(tup)):                       # O(n)
        if name == tup[i]['name'] and password == tup[i]['passwd']:     # O(1) 4 действия
            tup[i]['activate'] = 1                  # O(1) 2 действия
            activate_index = i                      # O(1)
            break                                   # O(1)

    if tup[activate_index]['activate'] == 1:                                                            # O(1)
        print(f'Прошла авторизация пользователя: {tup[activate_index]["name"]}. Приветствуем Вас!')     # O(1)
    else:                                                                                               # O(1)
        print(f'Неверно введены данные (имя пользователя или пароль).\n'
              f'Введите верные данные или пройдите авторизацию.')                                       # O(1)





def autorization_2(tup):
    name = (input('Введите имя пользователя:\n'))
    password = (input('Введите пароль:\n'))
    activate_index = 0
    names_list = [el['name'] for el in tup]

    if name in names_list:                                                                  # O(n)
        index = names_list.index(name)

    if tup[activate_index]['activate'] == 1:
        print(f'Прошла авторизация пользователя: {tup[activate_index]["name"]}. Приветствуем Вас!')
    else:
        print(f'Неверно введены данные (имя пользователя или пароль).\n'
              f'Введите верные данные или пройдите авторизацию.')

autorization_2(USERS_LST)