"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
# Cложность функции - линейная O(n)
def authentication_1(data, user, pswd):
    for el in data:
        if el == user:
            if data[el]['password'] == pswd:
                if data[el]['activation']:
                    return print('Аутентификация успешна! Доступ к ресурсу предоставлен!')
                else:
                    return print('Учетная запись не активирована! Пройдите активацию!')
            else:
                return print('Пароль не верный! Доступ к ресурсу запрещен!')
    return print(f'Пользователя {user} не существует! Доступ к ресурсу запрещен!')


# Cложность функции - константная O(1)
def authentication_2(data, user, pswd):
    if  data.get(user):
        if data[user]['password'] == pswd:
            if data[user]['activation']:
                print('Аутентификация успешна! Доступ к ресурсу предоставлен!')
            else:
                print('Учетная запись не активирована! Пройдите активацию!')
        else:
            print('Пароль не верный! Доступ к ресурсу запрещен!')
    else:
        print(f'Пользователя {user} не существует! Доступ к ресурсу запрещен!')


"""Второй вариант эффективнее, так как в нем общая сложность константная О(1)"""



storage_data = {'login1': {'password': '6789', 'activation': False},
                'login2': {'password': '12345', 'activation': True},
                'login3': {'password': '1234', 'activation': True},
                'login4': {'password': '11111', 'activation': False}
               }

authentication_1(storage_data, 'login1', '6789')
authentication_2(storage_data, 'login3', '1234')