"""
Задание 6.
Задание на закрепление навыков работы с очередью

Реализуйте структуру "доска задач".

Структура должна предусматривать наличие несольких очередей задач, например,
1) базовой, откуда задачи берутся, решаются и отправляются в список решенных
2) очередь на доработку, когда нерешенные задачи из первой очереди отправляются
на корректировку решения

После реализации структуры, проверьте ее работу на различных сценариях

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


class QueueClass:
    def __init__(self):
        self.elems = []

    def is_empty(self):
        return self.elems == []

    def to_queue(self, item):
        self.elems.insert(0, item)

    def from_queue(self):
        return self.elems.pop()

    def size(self):
        return len(self.elems)


def task_board(tasks_lst):
    tasks_queue_obj = QueueClass()
    tasks_to_modify = QueueClass()
    done = []

    for task in tasks_lst:
        tasks_queue_obj.to_queue(task)
        tasks_to_modify.to_queue(tasks_queue_obj.from_queue())
        done.append(tasks_to_modify.from_queue())

    return done


tasks = ["task 1", "task 2", "task 3", "task 4", "task 5", "task 6", "task 7"]
print(task_board(tasks))
