""" Домашняя работа Дармограй Полины
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

def func1(list): # Сложность такого алгоритма: O(n^2) - квадратичная.
    min = list[0] # O(1)
    for i in list: # O(n)
        for j in list: # O(n)
            if i < min or j < min: # O(1)
                if i < j: # O(1)
                    min = i # O(1)
                else: # O(1)
                    min = j # O(1)
    return min # O(1)

def func2(list): # Сложность такого алгоритма: O(n) - линейная.
    min = list[0] # O(1)
    for i in list: # O(n)
        if min > i: # O(1)
            min = i # O(1)
    return min # O(1)


numbers = [1, 2, 3, 4, 5, 0, 6, 9]
print(func1(numbers))
print(func2(numbers))
