"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

def min_num(lst: list):                                 # O(N^2)
    for i in range(len(lst)-1):                         # O(N)
        for j in range(len(lst)-i-1):                   # O(N)
            if lst[j] > lst[j+1]:                       # O(1)
                lst[j], lst[j+1] = lst[j+1], lst[j]     # O(1)
    return lst[0]                                       # O(1)


def min_find(lst: list):            # O(N)
    min_i = 0                       # O(1)
    for i in range(1, len(lst)):    # O(N)
        if lst[i] < lst[min_i]:     # O(1)
            min_i = i               # O(1)
    return lst[min_i]               # O(1)

print(min_num([9, 2, 3, 3, 6, 7]))
print(min_find([9, 2, 3, 3, 6, 7]))