"""
Задание 5.
Задание на закрепление навыков работы со стеком

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим стеком порогового значения.
Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
для реализации этой задачи.

После реализации структуры, проверьте ее работу на различных сценариях

Подсказка:
Отдельне стопки можно реализовать через:
1) созд-е экземпляров стека (если стопка - класс)
или
2) lst = [[], [], [], [],....]

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


class StackClass:
    def __init__(self):
        self.elems = []

    def polka(self):
        return self.elems

    def get_val(self):
        return self.elems[len(self.elems) - 1]  # Размер полки с тарлеками

    def is_empty(self):
        return self.elems == []

    def push_in(self, elem):  # Полка заполнена - новый массив(полка) + тарелка. Иначе + тарелка
        if self.is_empty() or len(self.get_val()) >= 5:  # Полка вмещает 5 тарелок
            self.elems.append([])
            self.get_val().append(elem)
        else:
            self.get_val().append(elem)

    def pop_out(self):
        self.get_val().pop()
        if self.get_val() == []:
            del self.elems[len(self.elems) - 1]


SC_OBJ = StackClass()
for i in range(21):
    SC_OBJ.push_in(i)
print(SC_OBJ.polka())

for i in range(2):
    SC_OBJ.pop_out()
print(SC_OBJ.polka())

print(SC_OBJ.is_empty())

for i in range(19):
    SC_OBJ.pop_out()
print(SC_OBJ.is_empty())
