"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
lst = [2, 1, 45, 23, 11, 67, 27, 7, 87, 61, 42, 9, 13, 99]

def min_quadratic(lst):
    """
    O(n^2)
    """
    for i in lst:               # O(n)
        min = True              # O(1)
        for j in lst:           # O(n)
            if i > j:           # O(1)
                min = False     # O(1)
        if min:
            return i            # O(1)

def min_linear(lst):
    """
    O(n)
    """
    min = lst[0]        # O(1)
    for i in lst:       # O(n)
        if i < min:     # O(1)
            min = i     # O(1)
    return min          # O(1)

min_quadratic = min_quadratic(lst)
print(f'квадратичная сложность - {min_quadratic}')

min_linear = min_linear(lst)
print(f'линейная сложность - {min_linear}')