"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

"""Первое решение эффективнее, т.к. алгорит имеет линейную сложность """


# 1 О(n)

company = {'A': 3.75, 'B': 44.2, 'C': 12.4, 'D': 44.5, 'E': 10.1}

income_company = {}

while len(income_company) < 3:
    max_value = 0
    for key, value in company.items():
        if max_value < value:
            max_value = value
            key_max_value = key
    max_value = company.pop(key_max_value)
    income_company.setdefault(key_max_value, max_value)

print(income_company)


# 2 O(n*log(n))

company = {'A': 3.75, 'B': 44.2, 'C': 12.4, 'D': 44.5, 'E': 10.1}
income = sorted(list(company.items()), key=lambda tup: tup[1], reverse=True)[:3]
print(income)


