"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

# Первый вариант с O(n^2)
def search(lst):
    for i in lst:
        min_idx = True
        for j in lst:
            if i > j:
                min_idx = False
        if min_idx:
            return i


# Второй вариант с O(n)
def search(lst):
    min_idx = lst[0]
    for i in lst:
        if i < min:
            min_idx = i
    return min_idx
