"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
import random


# 1) сложность O(n^2)
def lst_min_1(lst):
    min_value = lst[0]  # O(1)
    for i in lst:  # O(n)
        for j in lst:  # O(n)
            if min_value > i < j:  # O(1)
                min_value = i  # O(1)
    return min_value  # O(1)


# 2) Сложность O(n)
def lst_min_2(lst):
    min_value = lst[0]  # O(1)
    for i in lst:  # O(n)
        if i < min_value:  # O(1)
            min_value = i  # O(1)
    return min_value  # O(1)


lis = [random.randint(0, 1000) for i in range(10)]
print(f'Сложность O(n^2): {lst_min_1(lis)}\nСложность O(n): {lst_min_2(lis)}')
