"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

'''
'''

company_d = {'Sapple': 399999, 'Fonor': 188888, 'Zamzung': 300009, 'Miaomi': 200009}
print(company_d)

# N1
from collections import Counter

company_d = {'Sapple': 399999, 'Fonor': 188888, 'Zamzung': 300009, 'Miaomi': 200009}
c = Counter(company_d)

for el in c.most_common(3):  # O(N)
    print(el[:1:])
    # print(el[:1:], end='')
print(c.most_common(3))

# N2
company_list = {'Sapple': 399999, 'Fonor': 188888, 'Zamzung': 300009, 'Miaomi': 200009}
print(sorted(company_list.keys(), reverse=True)[:3])  # O(N)

# N3
from operator import itemgetter

company_l = [('Sapple', 399999), ('Fonor', 188888), ('Zamzung', 300009), ('Miaomi', 200009)]
c = sorted(company_l, key=itemgetter(1), reverse=True)  # O(N)

print(c[:3])

""" 
Думаю, что вариант №2 подходит лучше, так как нет нужды добавлять что-либо.

"""