"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

"""
    Сложность: O(N^2).
"""
def find_min_1(lst_obj):
    for i in range(len(lst_obj)):
        is_min = true
        for j in range(len(lst_obj) - i - 1):
            if lst_obj[i] > lst_obj[i + j + 1]:
                is_min = false
        if is_min:
            return lst_obj[i]
    return lst_obj[-1]
   


"""
    Сложность: O(N).
"""
def find_min_2(lst_obj):
    min = lst_obj[0]
    for i in range(len(lst_obj) - 1):
        if min > lst_obj[i+1]:
            min = lst_obj[i+1]
    return min
