"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

import random

for j in (50, 500, 1000, 5000):
    random_list = random.sample(range(-100000, 100000), j)


def min_search_1(input_list):
    """
    Сложность O(n^2)
    """
    result = input_list[0]    # O(1)
    for i in input_list:      # O(n)
        result = i            # O(1)
        for j in input_list:  # O(n)
            if result > j:    # O(1)
                result = j    # O(1)
    return result


def min_search_2(input_list):
    """
    Сложность O(n)
    """
    result = input_list[0]    # O(1)
    for i in input_list:      # O(n)
        if i < result:        # O(1)
            result = i        # O(1)
    return result


print(min_search_1(random_list))
print(min_search_2(random_list))
