"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
l = [5, 10, 3, 7, 1, 10, 0]


def minimal_1(lst):       # сложность ф-ции O(n^2) - квадратичная
    m = 0                 # O(1) - константная
    for i in lst:         # O(n) - линейная
        for j in lst:     # O(n) - линейная
            if i > j:     # O(1) - константная
                break     # O(1) - константная
            else:         # O(1) - константная
                m = i     # O(1) - константная
    return m              # O(1) - константная


print(minimal_1(l))


def minimal_2(lst):             # сложность ф-ции O(n) - линейная
    minim = lst[0]              # O(1) - константная
    for i in range(len(lst)):   # O(n) - линейная
        if minim > lst[i]:      # O(1) - константная
            minim = lst[i]      # O(1) - константная
    return minim                # O(1) - константная


print(minimal_2(l))

