"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


def min_from_lst1(lst):         #O(n^2)
    min_a = None                #O(1)
    for i in range(len(lst)):   #O(n)
        for j in lst:           #O(n)
            if lst[i] > j:      #O(1)
                min_a = j       #O(1)
    return min_a                #O(1)


def min_from_lst2(lst):         # O(n)
    min_a = lst[0]              # O(1)
    for i in lst:               # O(n)
        if i < min_a:           # O(1)
            min_a = i           # O(1)
    return min_a


lst1 = (12, 10, 5, 13, 3, 20)
print(min_from_lst1(lst1))      # O(1)
print(min_from_lst2(lst1))      # O(1)