"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

def list_min(lst):  # O(n^2)
    for i in lst:                              # O(n)
        min_value = True                       # O(1)
        for k in lst:                          # O(n)
            if i > k:                          # O(1)
                min_value = False              # O(1)
            if min_value:                      # O(1)
                return i                       # O(1)


# с курса автоматизации на питоне, разрешили делать по одному варианту функции