"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

from random import randint
# квадратичная
def mimimal_in_list(lst):
    for i in lst:
        minimal = True
        for k in lst:
            if i > k:
                minimal = False
        if minimal:
            return i

# линейная
def finding_the_minimum(lst):
    minimal = lst[0]
    for i in lst:
        if i < minimal:
            minimal = i
    return minimal


lst1 = [randint(0, 100) for i in range(20)]