"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


def sort_v1(input_l: list):
    """
        Сложность: O(n^2).
    """
    for i in range(len(input_l)-1):  # O(n)
        for j in range(1,len(input_l)):  # O(n)
            if input_l[j] < input_l[i]:  # O(1)
                tmp = input_l[i]  # O(1)
                input_l[i] = input_l[j]  # O(1)
                input_l[j] = tmp  # O(1)
    return input_l[0]  # O(1)


print(f"Результат первой функции:{sort_v1([1, 3, -2, 10, -3, 0])}")


def sort_v2(input_l: list):
    """
        Сложность: O(n).
    """
    min_num = input_l[0]  # O(1)
    for i in range(len(input_l)):  # O(n)
        if input_l[i] <= min_num:  # O(1)
            min_num = input_l[i]  # O(1)
    return min_num  # O(1)


print(f"Результат второй функции:{sort_v2([1, 3, -2, 10, -3, 0])}")
