"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

########################################################################
# Первый алгоритм
# Сложность: O(n^2)

lst = [12, 2, 7, 10, -5, 9]

mins = lst[0]
for i in lst:
    if i < mins:
        mins = i

print(mins)

########################################################################
# Второй алгоритм
# Сложность: O(n)
lst = [12, 2, 7, 10, -5, 9]

min_num = min(lst)
print(min_num)
