"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
def top3_1(my_dict):
    # O(N^2)
    my_list = list(my_dict.items())            # O(N)
    le = len(my_list)                          # O(1)
    for i in range(le - 1):                    # O(N)
        for j in range(i + 1, le):             # O(N^2)
            if my_list[i][1] > my_list[j][1]:  # O(1)
                t = my_list[i]                 # O(1)
                my_list[i] = my_list[j]        # O(1)
                my_list[j] = t                 # O(1)
    return dict(my_list[-3:])                  # O(N)


def top3_2(my_dict):
    # O(N log N)
    my_list = sorted(my_dict.items(), key=lambda x: x[1])  # O(N log N)
    return dict(my_list[-3:])                              # O(N)


print(top3_1({'TNT': 5000, 'CTC': 2500, 'HBO': 6000, 'FOX': 4000, 'MATCH': 3000}))
print(top3_2({'TNT': 5000, 'CTC': 2500, 'HBO': 6000, 'FOX': 4000, 'MATCH': 3000}))
