""" Домашнее задание к уроку №1 курс Алгоритмы и структуры данных на Python
    студент: Максим Сапунов Jenny6199@yandex.ru
    27.05.2021
"""


#    Задание 5.
#    Задание на закрепление навыков работы со стеком
#    Реализуйте структуру "стопка тарелок".
#    Мы можем складывать тарелки в стопку и при превышении некоторого значения
#    нужно начать складывать тарелки в новую стопку.
#    Структура должна предусматривать наличие нескольких стеков.
#    Создание нового стека происходит при достижении предыдущим стеком порогового значения.
#    Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
#    для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
#    для реализации этой задачи.
#    После реализации структуры, проверьте ее работу на различных сценариях
#    Подсказка:
#    Отдельне стопки можно реализовать через:
#    1) созд-е экземпляров стека (если стопка - класс)
#    или
#    2) lst = [[], [], [], [],....]
#    Примечание: в этом задании вспомните ваши знания по работе с ООП
#    и опирайтесь на пример урока
#    Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
#    Задание творческое. Здесь нет жестких требований к выполнению.


class Stack:
    """docstring"""

    stack_db = []
    stack_part = []

    def __init__(self, boarder_of_stack):
        self.boarder_of_stack = boarder_of_stack

    def stack_is_empty(self):
        """ Проверяет наличие элементов в базе данных стэка"""
        return True if (len(self.stack_db) == 0) else False

    def push_to_stack(self, box):
        """Добавить данные в стэк"""
        pass


if __name__ == '__main__':
    v1 = Stack(5)
    v1.push_to_stack('box')
    print(v1.stack_db)
