"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""
# Сложность:O(n^2)

def min_list(lst):
    for i in range(0, len(lst) - 1):            # O(n)
        for j in range(i + 1, len(lst)):        # O(n)
            if lst[j] < lst[i]:                 # O(1)
                lst[i], lst[j] = lst[j], lst[i] # O(1)
    return print(lst[0])                        # O(1) + O(1)

min_list([8,8,5,3,9,5,885,1])

# Сложность:O(n)
def min_list2(lst):
    n = float('+inf')       # O(1)
    for i in lst:           # O(n)
        if i < n:           # O(1)
            n = i           # O(1)
    return print(n)         # O(1) + O(1)

min_list2([8,8,5,3,9,5,885,1])
