"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
# 1. Применяем встроенную функцию sorted(), которая имеет сложность O(nlogn) - линейно-логарифмическую, следовательно,
# весь код имеет линейно-логарифмическую сложность.

companies = [['Yandex', 30000000], ['Mail.ru', 20000000], ['GeakBrains', 10000000], ['Gazprom', 50000000],
             ['Rosneft', 40000000]]

# companies_sort = sorted(companies, key=lambda x: x[1], reverse=True)[:3]
#
# print(companies_sort)

# 2. Применяем цикл for in, который имеет сложность O(n) - линейная, следовательно,
# весь код имеет линейную сложность.

res = []
for comp in companies:
    res.append(str(comp[1]) + comp[0])

total = []
for ind in range(3):
    temp_ = max(res)
    total.append(temp_)
    res.remove(temp_)

print(total)
