"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
data_c = {
    'company_1': 5000,
    'company_2': 15000,
    'company_3': 1000,
    'company_4': 8000,
}
#O(7)

for i in range(3): #O(3)
    a = max(data_c.values()) #O(1)
    b = (list(data_c.keys())[list(data_c.values()).index(a)])# O(2)
    print(i + 1, b) #O(1)
    data_c.pop(b) #O(1)
