"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.
"""

from random import randint


# Сложность O(n^2) - квадратичная, вложенные циклы
def find_min_1(sequence):
    for el_1 in sequence:                      # O(n) - линейная
        is_min = True                          # O(1) - константная, присваивание
        for el_2 in sequence:                  # O(n) - линейная
            if el_2 < el_1:                    # O(1) - константная
                is_min = False                 # O(1) - константная
                break                          # O(1) - константная
        if is_min:                             # O(1) - константная
            return el_1                        # O(1) - константная


# Сложность O(n) - линейная, 1 проход по элементам
def find_min_2(sequence):
    min_el = sequence[0]                       # O(1) - константная
    for i in range(1, len(sequence)):          # O(n) - линейная
        if sequence[i] < min_el:               # O(1) - константная
            min_el = sequence[i]               # O(1) - константная
    return min_el                              # O(1) - константная


if __name__ == '__main__':

    # Список из 10 целых чисел от -100 до 100
    lst = [randint(-100, 100) for i in range(0, 10)]
    print(lst)

    print(find_min_1(lst))
    print(find_min_2(lst))
    # проверка
    print(min(lst))
