"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
import random


def find_min1(lst):
    """
    Алгоритмическая сложность - O(N^2)
    """
    for i in lst:   # O(N)
        min = i # O(1)
        for j in lst:   # O(N)
            if j < min: # O(1)
                min = j # O(1)
        if min == i:    # O(1)
            return i    # O(1)


def find_min2(lst):
    """
    Алгоритмическая сложность - O(N)
    """
    min = lst[0]  # O(1)
    for i in lst:  # O(N)
        if i < min:  # O(1)
            min = i  # O(1)
    return min  # O(1)


random_smpl = random.sample(range(-10000, 10000), 30)
print(min(random_smpl))
print(find_min1(random_smpl))
print(find_min2(random_smpl))
