"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


import random


# O(n^2)
def min_el_n2(l):
    min = l[0]                  # O(1)
    for i in range(len(l)):     # O(n)
        for el in l:            # O(n)
            if el < min:        # O(1)
                min = el        # O(1)
    return min                  # O(1)


# O(n)
def min_el_n(l):
    min = l[0]                  # O(1)
    for el in l:                # O(n)
        if el < min:            # O(1)
            min = el            # O(1)
    return min                  # O(1)


lst = random.sample(range(100), 20)
print(lst)
print(min_el_n2(lst))
print(min_el_n(lst))
