"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

num_array = [1, 5, 10, 3, 7, 9, 5, 2, 99, 14, 10, 100]


# O(n^2) - квадратичная
def min_in_list1(num_array):
    for i in num_array:
        min_check = 0 # также здесь можно использовать булевы функции True и False вместо 0 и 1
        for j in num_array:
            if j < i:
                min_check = 1
        if min_check == 0:
            return i


# O(N) - линейная
def min_in_list2(num_array):
    min_num = num_array[0]
    for i in num_array:
        if i < min_num:
            min_num = i
    return min_num


print(num_array)
print(min_in_list1(num_array))
print(min_in_list2(num_array))
