"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

company_cost = {
    'Apple': 999566,
    'Samsung': 978298,
    'Yandex': 152589,
    'MSI': 1548780,
    'Intel': 687167,
    'AMD': 6558846

}

# Вариант 1. Сложность O(N log N)
print(sorted(company_cost.values())[3:])

# Вариант 2. Сложность O(N2)
cout = 0
while cout < 3:  # O(N)
    a = [k for k, v in company_cost.items() if v == max(company_cost.values())]  # O(N)
    a1 = ''.join(a)  # O(N)
    company_cost.pop(a1)
    print(a1)  # O(1)
    cout += 1

"""
п1. 2 способа реализации первый - сортировка, второй - через цикл
п2. Сложность во втором случае оказалась квадратичной, а в первом линейно-логарифмической.
п.3.В первом случае код более лаконичный и выполниться быстрее чем во втором. 
"""
