"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

companies = {
    'aaa': 1000,
    'bbb': 10000,
    'ccc': 3000,
    'ddd': 8000,
    'eee': 5000,
    'fff': 3000,
    'ggg': 7000,
    'hhh': 2500,
    'iii': 4000,
    'jjj': 1000
}

"""Самым эффективным решением будет 1е, т.к. оно имеет наименьшую сложность при выполнении и
не меняет исходное хранилище(словарь)"""


# O(N) - линейная сложность
def max3(var):
    max3_var = {}           # O(1) - константная
    dictionary = var        # O(1) - константная
    for i in range(3):      # O(N) - линейная
        def comp(j):        # O(1) - константная
            return j[1]     # O(1) - константная

        max_var = max(dictionary.items(), key=comp)     # O(1) - константная
        del dictionary[max_var[0]]                      # O(1) - константная
        max3_var[max_var[0]] = max_var[1]               # O(1) - константная
    return max3_var                                     # O(1) - константная


print(max3(companies))


# O(N^2) - квадратичная
def max3_of_comp(var):
    for i in range(len(var)):                           # O(N) - линейная
        min_val = i                                     # O(1) - константная
        for j in range(i + 1, len(var)):                # O(N) - линейная
            if var[min_val][1] < var[j][1]:             # O(N) - линейная
                min_val = j                             # O(1) - константная
        var[i], var[min_val] = var[min_val], var[i]     # O(1) - константная
    return var[0:3]                                     # O(1) - константная


comp_list = list(companies.items())                     # O(N) - линейная
for i in max3_of_comp(comp_list):                       # O(N) - линейная
    print(i[0], ':', i[1])
