
"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""

                                            # n**2 + 4 = O(n**2)
def min_num1(list):
    num = list[0]                               # 1
    for i in list:                              #
        for j in list:                          # n**2
            if j < i and j < num:               # 1
                num = j                         # 1
    return f'result func min_num1: "{num}".'    # 1

                                            # n + 5 = O(n)
def min_num2(list):
    if len(my_list) > 0:                        # 1
        num = list[0]                           # 1
        for i in my_list:                       # n
            if i < num:                         # 1
                num = i                         # 1
    return f'result func min_num2: "{num}".'    # 1


my_list = [3, 4, 3, 5, 6, 3, 4, 4, 5]
print(min_num1(my_list))
print(min_num2(my_list))
