"""
Задание 5.
Задание на закрепление навыков работы со стеком

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим стеком порогового значения.
Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
для реализации этой задачи.

После реализации структуры, проверьте ее работу на различных сценариях

Подсказка:
Отдельне стопки можно реализовать через:
# 1) созд-е экземпляров стека (если стопка - класс)
# 2) lst = [[], [], [], [],....]
"""

# Сделал стек списка, кратное трем.

from time import sleep


class StackMe:
    step = 3

    def __init__(self):
        self.list = []
        self.new_list = []

    def add_number(self, number):
        self.list.append(number)
        while len(self.list) > StackMe.step:
            self.new_list.append(self.list[:StackMe.step])
            self.list = self.list[StackMe.step:]

    def get_list(self):
        return self.new_list + self.list


a = StackMe()
# генерирую список. Добавляю и вывожу в цикле.
for i in range(27):
    a.add_number(i)
    sleep(0.5)
    print(a.get_list())
