"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
company = {
    'g': 2342,
    'a': 54,
    'c': 3453,
    'z': 233
}
#O(n)
def max3(lst):
    l_max = {}
    lst = dict(lst)
    for i in range(3):
        maxim = max(lst.items(), key=lambda ans: ans[1])
        del lst[maxim[0]]
        l_max[maxim[0]] = maxim[1]
    return l_max

print(max3(company))
#O(n log n)
def log_max(lst):
    direc_of_list = list(lst.items())
    direc_of_list.sort(key=lambda i: i[1], reverse=True)
    for i in range(3):
        print(direc_of_list[i][0],':', direc_of_list[i][1])

print(log_max(company))
'''лучше первый вариант, так как у него самая маленькая вычеслительная сложность '''
