"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
companies = {
    'apple': 1450430500,
    'microsoft': 1240321555,
    'BBC': 300000000,
    'HP': 1132143213,
    'lenovo': 908432432
}
########################################################################
# Первый алгоритм
# Сложность: O(n)
num = list(companies.values())
num.sort()
print(num[-3:])

########################################################################
# Второй алгоритм
# Сложность: O(n log n)
lst = []
for i in companies.values():
    lst.append(i)
lst.sort()
print(lst[-3:])


"""
Итак, вывод: первый способ будет очевидно лучше и легче,
тут мы сразу сортируем значения нового списка,
и получаем результат.
Во втором же способе мы все элементы поочереди добавляем в новый список,
поэтому он не так эффективен как первый.
"""