"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

company_dict = {
    'Samsung': 20000,
    'Geekbrains': 3000,
    'Google': 53000,
    'Amazon': 95000,
    'Tesla': 13000,
    'Apple': 41000
}
# способ 1 - O(n log n) - линейная-логарифмическая из за функции sorted()
# способ красивый и короткий, легко читается, но работает дольше
print(sorted(company_dict.items(), reverse=True, key=lambda element: element[1])[:3])

# способ 2 - O(n) линейный из за функции max() - этот спобоб предпочтительнее так как он быстрее
temp_dict = company_dict
max_dict = {}
for i in range(3):
    key_max, value_max = max(temp_dict.items(), key=lambda element: element[1])
    max_dict[key_max] = value_max
    del temp_dict[key_max]

print(max_dict)
