"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

firms = {
    "Horns" : "100000",
    "H&K" : "200000",
    "Gardener" : "249000",
    "Warner" : "248000",
    "Bros" : "315000",
    "Hadson" : "260000",
    "Watsons" : "400000",
    "Ratchet" : "415000"}
print(firms)
result = sorted(firms, key=firms.get, reverse=True)[:3]
print(result)
list_firms = list(firms.items())
list_firms.sort(key=lambda i: i[1])
for i in list_firms:
    print(i[0], ':', i[1])

