"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

# Сложность O(n²), где n = len(lst)
def minimal_1(lst):
    
    for element_1 in lst:
        is_minimal = True
        for element_2 in lst:
            is_minimal = element_1 <= element_2 and is_minimal
        if is_minimal:
            return element_1

# Сложность O(n), где n = len(lst)
def minimal_2(lst):
    minimal = lst[0]
    for element in lst:
        if minimal > element:
            minimal = element
    return minimal

lst = [10, 23, 5, 7, 22]
print(minimal_1(lst))
print(minimal_2(lst))
