"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
import random


# 0(n)
def min_value(lst):
    min_el = lst[0] if lst else None
    for i in lst:
        if i < min_el:
            min_el = i
    return min_el


# O(n^2)
def min_value_v2(lst):
    for i in lst:
        min_el = True
        for j in lst:
            if j < i:
                min_el = False
        if min_el:
            return i


my_list = random.sample(range(0, 500), 10)
print(my_list)
print(min_value(my_list))
print(min_value_v2(my_list))
