"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

from random import randint


# Генерация тестовых данных
storage_list = list

company_name_list = ['ООО Буренушка', 'ООО Главдорстрой', 'ООО ЧебурекиCo', 'ООО Новый день', 'ООО Атаман', 'ООО ТК']

for company in company_name_list:
    company_structure = dict(name=company, profit=randint(0, 15000))
    storage_list.append(company_structure)

print(storage_list)


