"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""

my_list = [5, 104, 12, 3, 2, 4]

# O(n^2)

def find_min(input_list):
    for v in input_list:
        for other in input_list:
            if v > other:
                break
        else:
            min_value = v
    return min_value

print(find_min(my_list))

# O(n)

def find_min(input_list):
    min_value = input_list[0]
    for v in input_list:
        if v < min_value:
            min_value = v
    return min_value

print(find_min(my_list))

