"""
Задание 7.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)

Примечание:
Вам не нужно писать код с нуля. Вам нужно доработать пример с урока.
"""


from task_16 import DequeClass


'''
для возможности проверки на "палиндром с пребелом" поседством функции pal_checker()
достаточно из исходной строки, передаваемой для проверки, через .replace(" ", "") пробелы удалить. 
удобнее всего, на мой взгляд, сделать перед помещением строки в DequeClass
кроме этого, я считаю, необходимо привести все символы к нижнему регистру - в палиндромах встречаются имена и названия
сделать это удобно в этом же месте, добавив к методу .replace() метод .lower() 
(ещё бы и знаки пунктации убрать...)
'''


def pal_checker(string):
    dc_obj = DequeClass()

    ''' добавить исправления в код  проще всего в следующей строке: '''
    for el in string.replace(" ", "").lower():
        dc_obj.add_to_rear(el)

    still_equal = True

    while dc_obj.size() > 1 and still_equal:
        first = dc_obj.remove_from_front()
        last = dc_obj.remove_from_rear()
        if first != last:
            still_equal = False

    return still_equal


for palindrom in ("молоко делили ледоколом",
                  "радар",
                  "топот",
                  "а роза упала на лапу Азора",
                  "Аргентина манит негра",
                  "Я иду съ мечемъ судия",
                  "Арбуз влетел в зубра"
                  ):

    print(pal_checker(palindrom))