"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

import random

my_list = random.sample(range(100), 10)
print(my_list)


def my_func1(lst):  # O(n) - линейная сложность
    min_el = lst[0]  # O(1) - константная сложность
    for i in lst:  # O(n) - линейная сложность
        if i < min_el:  # O(1) - константная сложность
            min_el = i  # O(1) - константная сложность
    return min_el


result1 = my_func1(my_list)
print(result1)

new_list = random.sample(range(100), 10)
print(new_list)


def my_func2(lst):  # O(n**2) - квадратичная сложность
    for el1 in lst:  # O(n) - линейная сложность
        x = False  # O(1) - константная сложность
        for el2 in lst:  # O(n) - линейная сложность
            x = True if el2 < el1 else x  #
        if not x:  # O(1) - константная сложность
            return el1  # O(1) - константная сложность


result2 = my_func2(new_list)
print(result2)
