"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""


def get_min_number(lst):
    """
        Функция вовзращает минимальное значение для списка

        Алгоритм 1:
        Создаем переменную, в которую положим первый элемент списка
        Итеррируемся по списку, сравнивая каждый элемент со всеми элементами списка
        По окончанию итеррации каждого элемента списка со всеми остальными элементами списка возвращаем результат

        Сложность: O(n^2) - квадратичная
        """
    min_numb = lst[0]              # O(1) - константная
    for num in lst:                # O(n) - линейная
        temp_min = num             # O(1) - константная
        for number in lst:         # O(n) - линейная
            if number < num:       # O(1) - константная
                temp_min = number  # O(1) - константная
        if min_numb > temp_min:    # O(1) - константная
            min_numb = temp_min    # O(1) - константная
    return min_numb                # O(1) - константная


def get_min_numb(lst):
    """
    Функция вовзращает минимальное значение для списка

    Алгоритм 2:
    Создаем переменную, в которую положим первый элемент списка
    Итеррируемся по списку, сравнивая каждый следуюший элемент
    Меньший элемент присваиваем переменной
    По окончанию итеррации по всем элементам спска возвращаем результат

    Сложность: O(n) - линейная
    """
    min_numb = lst[0]              # O(1) - константная
    for i in range(1, len(lst)):   # O(n) - линейная
        if lst[i] < min_numb:      # O(n) - линейная
            min_numb = lst[i]      # O(1) - константная
    return min_numb                # O(1) - константная


my_lst = [5, 1, 3, 2, 9, 3]
print(get_min_numb(my_lst))
