"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""
# O(n^2)
def list_min2(list):
    for i in list:
        l_min = True
        for k in list:
            if i > k:
                l_min = False
    if l_min:
        return i


# O(n)
def list_min(list):
    l_min = list[0]
    for i in list:
        if i < min:
            l_min = i
        return min

list1 = [1, 4, 34]

print(list_min2(list1))
print(list_min(list1))
