"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
# Тяжелее вторая функция, так как они обе линейные, но у второй доминанта в два раза больше.


def autent_func1(login, password):              # Сложность функции: O(n) линейная
    if not login in users.keys():               # O(n)
        return 'Пользователь не найден'         # O(1)
    elif password != users.get(login)[0]:       # O(1)
        return 'Неверный пароль'                # O(1)
    elif not users.get(login)[1]:               # O(1)
        return 'Сначала активируйте аккаунт'    # O(1)
    else:
        return 'Вы допущены к ресурсу'          # O(1)


def autent_func2(login, password):              # Сложность функции: O(n)линейная
    counter = 0                                 # O(1)
    for i in users.keys():                      # O(n)
        if login == i:                          # O(1)
            counter += 1                        # O(1)
    if counter == 0:                            # O(1)
        return 'Пользователь не найден'         # O(1)
    if password != users.get(login)[0]:         # O(1)
        return 'Неверный пароль'                # O(1)
    elif not users.get(login)[1]:               # O(1)
        return 'Сначала активируйте аккаунт'    # O(1)
    else:
        return 'Вы допущены к ресурсу'          # O(1)


users = {'Katya': ['12345qwerty', True], 'duke': ['qwerty12345', False]}

print(autent_func1(input('Введите login '), input('Введите пароль ')))
print(autent_func2(input('Введите login '), input('Введите пароль ')))

print(type(users.keys()))


