"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

# O(n^2)
def find_min_list_1(temp_list):
    temp_min = temp_list[0]             # O(1)
    for i in temp_list:                 # O(n)
        for j in temp_list:             # O(n)
            if j < i and temp_min > j:  # O(1)
                temp_min = j            # O(1)
    return temp_min                     # O(1)


# O(n)
def find_min_list_2(temp_list):
    temp_min = temp_list[0]             # O(1)
    for i in temp_list:                 # O(n)
        if i < temp_min:                # O(1)
            temp_min = i                # O(1)
    return temp_min                     # O(1)


test_list = [9, 5, 1, 7, 3, 4, 2, 8, 6]
print(find_min_list_1(test_list))
print(find_min_list_2(test_list))
