"""
Задание 1.

Для каждой из трех функций выполнить следующее:

1) для каждого выражения вместо !!! укажите сложность этого выражения.
2) определите сложность каждой функции в целом.

Сложность нужно определять только там, где указаны символы !!!

Примечание:
Прошу вас внимательно читать ТЗ и не выполнять все пункты.
"""

import random


#############################################################################################
def check_1(lst_obj):
    """Функция должна создать множество из списка.

    Алгоритм 3:
    Создать множество из списка

    Сложность: O(len(lst_obj).
    """
    lst_to_set = set(lst_obj)  # 0(len(lst_obj))
    return lst_to_set  # 0(1)


#############################################################################################
def check_2(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 1:
    Проходимся по списку и для каждого элемента проверяем,
    что такой элемент отстутствует
    в оставшихся справа элементах

    Сложность: O(n**2).
    """
    for j in range(len(lst_obj)):          # 0(n)
        if lst_obj[j] in lst_obj[j+1:]:    # 0(1+n)
            return False                   # 0(1)
    return True                            # 0(1)


#############################################################################################
def check_3(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 2:
    Вначале выполним для списка сортировку, далее, сравниваем элементы попарно
    Если присутствуют дубли, они будут находиться рядом.

    Сложность: O(n log n)
    """
    lst_copy = list(lst_obj)                 # 0((lst_obj))
    lst_copy.sort()                          # 0(n log n)
    for i in range(len(lst_obj) - 1):        # 0(n)
        if lst_copy[i] == lst_copy[i+1]:     # 0(1)
            return False                     # 0(1)
    return True                              # 0(1)

#############################################################################################


for j in (50, 500, 1000, 5000, 10000):
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)

print(check_1(lst))
print(check_2(lst))
print(check_3(lst))
