"""
Задание 3.
Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Задание творческое. Здесь нет жестких требований к выполнению.
"""

companies = {
    'one': 1234,
    'two': 3454567,
    'three': 55,
    'four': 1,
    'five': 999,
    'six': 111,
    'seven': 29793487349857
}
'''
1-е решение. Сложность: O(N log N)
'''

sorted_values = sorted(companies.values())[::-1]
sorted_companies = {}

for i in sorted_values[0:3]:
    for k in companies.keys():
        if companies[k] == i:
            sorted_companies[k] = companies[k]
            break

print(sorted_companies)

'''
2-е решение. Сложность: О(N)
'''

sorted_companies = {}
max_key = 0
for i in range(3):
    max_value = 0
    for key in companies:
        if companies[key] > max_value:
            max_key = key
            max_value = companies[key]
    sorted_companies.update({max_key: max_value})
    companies.pop(max_key)
print(sorted_companies)

'''
Эффективнее будет второе решение, так как оно имеет сложность О(N) - линейную.
'''