"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

lst_obj = [8, 41, 9, 11, 74, 31, 8, 99, 45, 24]


def quadratic_search(lst_obj):  # квадратичная
    min_value = lst_obj[0]  # константная
    for i in lst_obj:  # линейная
        for j in lst_obj:  # линейная
            if i < j and i < min_value:  # константная
                min_value = i  # константная
    return min_value  # константная


def linear_search(lst_obj):  # линейная
    min_value = lst_obj[0]  # константная
    for i in lst_obj:  # линейная
        if min_value > i:  # константная
            min_value = i  # константная
    return min_value  # константная


print(linear_search(lst_obj))
print(quadratic_search(lst_obj))
