"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


# O(n^2)
def min_list(some_list):
    for x in some_list:
        val_min = True
        for y in some_list:
            if x > y:
                val_min = False
        if val_min:
            return x


# O(n)
def min_list_fast(some_list):
    t = some_list[0]
    for x in some_list:
        if t > x:
            t = x
    return t


lst = [10, 51, 61, 122, 67, 11, 33, 6, 11, 6, 22, 19, 31, 532]
print(min_list(lst))
print(min_list_fast(lst))
