"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
'''Сложность первой задачи  O(1) так как мы просто получаем значение'''

my_dict = {'Gazprom': 10000, 'Bashneft': 5000, 'Gazmyas': 2000, 'MTS': 7000}


result = sorted(my_dict, key=my_dict.get, reverse=True)[:3]
print(f' TOP - 3', result)

# -------------------------------------------------------------------------------------

'''Сложность второй задачи  0(1)'''
for i in range(3):
    k = max(my_dict, key=my_dict.get)
    print(k, my_dict.pop(k))

'''Два способа одинаково ээфективны и имеют короткое решение'''
