"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""


def search_min(lst_obj):  # O(n^2)
    for i in lst_obj:
        is_min = True
        for n in lst_obj:
            if i > n:
                is_min = False
                break
        if is_min:
            return i


def search_min_2(lst_obj):    # O(n)
    _min = lst_obj[0]
    for i in lst_obj:
        if i < _min:
            _min = i
    return _min
