import random

"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


def mymin_linear(lst_obj):
    # O(n)
    min_val = lst_obj[0]  # O(1)

    for element in lst_obj[1:]:  # O(n) + O(n) = O(n)
        if min_val <= element:  # O(1)
            continue
        min_val = element  # O(1)
    return min_val


def mymin_sqr(lst_obj):
    # O(n^2)
    min_val = lst_obj[0]  # O(1)

    for i in lst_obj:  # O(n)
        for j in lst_obj:  # O(n)
            if i > j and min_val > j:  # O(1) + O(1) = O(1)
                min_val = j  # O(1)
    return min_val


lst = [random.randint(-500, 500) for i in range(30)]
print(mymin_sqr(lst))
print(mymin_linear(lst))
print(min(lst))

