"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


def min1(lst):  # n^2
    for i in lst:
        check = 1
        for k in lst:
            if i > k:
                check = 0
        if check:
            return i


def min2(lst):  #n
    minx = lst[0]
    for i in lst:
        if i < minx:
            minx = i
    return minx


print(min1([5, 2, 5, 2, 6, 1, 0, -1]))
print(min2([5, 2, 5, 2, 6, 1, 0, 8]))