"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

# Первое решение завязано на переборе элементов и их сравнения. Его сложность - О(N^3)

import collections


def registration():

    login = input("Напишите логин")
    password = input("Напишите пароль")
    activate = input("Напишите 'ДА', если хотите активировать страницу (без кавычек):")
    all_information = ("Yana", "123", "ДА")

    new_lst = list()
    new_lst.append(login)
    new_lst.append(password)
    new_lst.append(activate)

    count = 0

    for i in new_lst:
        for j in all_information:
            if i == j:
                count += 1
    if count == 3:
        print("Вы успешно зашли в систему")
    else:
        print("Что-то пошло не так")


print(registration())


# Прототип этого решения я нашла в интернете, иузучила принцип работы Counter
# (при надобности, могу позже описать его принцип). Сложность алгоритма - О(N)


def second_registration():

    second_login = input("Напишите логин")
    second_password = input("Напишите пароль")
    second_activate = input("Напишите 'ДА', если хотите активировать страницу (без кавычек):")
    all_second_information = ("Yana", "123", "ДА")

    new_second_lst = list()
    new_second_lst.append(second_login)
    new_second_lst.append(second_password)
    new_second_lst.append(second_activate)

    if collections.Counter(all_second_information) == collections.Counter(new_second_lst):

        print("Вы успешно зашли в систему")

    else:

        print("Что-то пошло не так")


print(second_registration())
