"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

companies = {'Intel': 240999,
             'Sony': 109330,
             'Samsung': 98298,
             'HP': 579332,
             'Apple': 984101,
             'Dell': 73456,
             'Oracle': 98222,
             'EPAM': 895234,
             'Google': 111098,
             'EY': 77546}

def variant_1(dict):
    max_three = []
    for i in sorted(dict.values(), reverse=True)[:3]:
        for x, n in dict.items():
            if i == n:
                max_three.append(x)
    return max_three

# Сложность O(n^3)


def variant_2(dict):
    max_three = list(dict.items())
    max_three.sort(key=lambda i: i[1], reverse=True)
    return max_three[:3]

# Сложность O(NlogN)



print(variant_1(companies))
print(variant_2(companies))
