"""
Задание 1.

Для каждой из трех задач выполнить следующее:

1) для каждой инструкции рядом в комментарии определите сложность этой инструкции
2) определите сложность алгоритма в целом

укажите сложность непосредственно в этом файле
точки, где нужно поработать вам, отмечены знаком '!!!'
Не забудтье оценить итоговую сложность каждого из трех алгоритмов.

Примечание:
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

import random


#############################################################################################
def check_1(lst_obj):
    """Функция должна создать множество из списка.

    Алгоритм 3:
    Создать множество из списка

    Сложность: O(1) + O(n) = O(n).
    """
    lst_to_set = set(lst_obj)  # сложность операции присваивания О(1), сложность операции set(..) О(len(..)) => O(n).
    return lst_to_set  # сложность операции return О(1)


#############################################################################################
def check_2(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 1:
    Проходимся по списку и для каждого элемента проверяем,
    что такой элемент отстутствует
    в оставшихся справа элементах

    Сложность: O(n**2), поскольку имеем линейный поиск в списке (О(n)) для каждого элемента в цикле for (тоже O(n)).
    """
    for j in range(len(lst_obj)):          # O(n), т.к. не можем заранее знать длину списка
                                           # (несмотря на то, что сложность len(lst_obj) равна О(1))
        if lst_obj[j] in lst_obj[j+1:]:    # O(n), т.к. это обычный (линейный) поиск в списке
            return False                   # O(1) - сложность операции return
    return True                            # O(1) - сложность операции return


#############################################################################################
def check_3(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 2:
    Вначале выполним для списка сортировку, далее, сравниваем элементы попарно
    Если присутствуют дубли, они будут находиться рядом.

    Сложность: O(1) + O(NlogN) + O(N) = O(NlogN)
    """
    lst_copy = list(lst_obj)                 # О(1) - операция присваивания
    lst_copy.sort()                          # О(NlogN)
    for i in range(len(lst_obj) - 1):        # O(N), т.к. не можем заранее знать длину списка
        if lst_copy[i] == lst_copy[i+1]:     # O(1), т.к. просто сравнение двух элементов
            return False                     # O(1)
    return True                              # O(1)

#############################################################################################


for j in (50, 500, 1000, 5000, 1000):
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)

print(check_1(lst))
print(check_2(lst))
print(check_3(lst))
