"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

lst = [1, 2, 3, -5, 4, 5, 0, -3]


# сложность О(n**2) - квадратичная

def my_min2(list):
    if len(list) == 0:  # O(1)
        return None  # O(1)
    result = list[0]  # O(1)
    for i in list:  # O(n)
        answer = True  # O(1)
        for j in list:  # O(n)
            if i > j:  # O(1)
                answer = False  # O(1)
        if answer:  # O(1)
            result = i  # O(1)
    return result  # O(1)


print(my_min2(lst))


# сложность О(n) - линейная

def my_min1(list):
    if len(list) == 0:  # O(1)
        return None  # O(1)
    result = list[0]  # O(1)
    for i in range(1, len(list)):  # O(n)
        if list[i] < result:  # O(1)
            result = list[i]  # O(1)
    return result  # O(1)


print(my_min1(lst))
