"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

companies = {'apple': 234000,
             'samsung': 120000,
             'inditex': 28000,
             'lenta': 9060,
             'amazon': 560000,
             'google': 89000,
             'facebook': 74000,
             'microsoft': 450000,
             'tesla': 810000,
             'IBM': 4000}

# сложность O(n log n)
sorted_companies = dict(sorted(companies.items(), key=lambda item: item[1], reverse=True)[:3])
print(sorted_companies)

# сложность O(n)
max_value = 0
company_name = ''
top_three = {}

companies_copy = dict(companies)
for i in range(3):
    for key, value in companies_copy.items():
        if value > max_value:
            max_value = value
            company_name = key
    top_three[company_name] = max_value
    del companies_copy[company_name]
    max_value = 0
print(top_three)

# эффективнее решение со сложностью O(n), так как имеет минимальное количество операций
