""" Домашнее задание к уроку №1 курс Алгоритмы и структуры данных на Python
    студент: Максим Сапунов Jenny6199@yandex.ru
    28.05.2021
"""

#    Задание 6.
#    Задание на закрепление навыков работы с очередью
#    Реализуйте структуру "доска задач".
#    Структура должна предусматривать наличие несольких очередей задач, например,
#    1) базовой, откуда задачи берутся, решаются и отправляются в список решенных
#    2) очередь на доработку, когда нерешенные задачи из первой очереди отправляются
#    на корректировку решения
#    После реализации структуры, проверьте ее работу на различных сценариях
#    Примечание: в этом задании вспомните ваши знания по работе с ООП
#    и опирайтесь на пример урока
#    Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
#    Задание творческое. Здесь нет жестких требований к выполнению.


class Queue:
    """ Простое представление очереди """

    def __init__(self):
        """" Конструктор класса"""
        self.queue = []

    def new_task(self, task: str):
        """ Добавление задачи в очередь."""
        self.queue.insert(0, task)

    def next_task(self):
        """ Получить задачу из очереди. """
        return self.queue.pop() if self.are_some_tasks() else '!Нет текущих задач!'

    def are_some_tasks(self):
        """ Проверяет наличие задач в очереди. """
        return True if self.queue != [] else False


def test_queue():
    """ тестирующая функция для класса очереди"""
    v1 = Queue()
    v1.new_task('Подпереть землянку')
    v1.new_task('Залатать корыто')
    v1.new_task('Закинуть невод')
    print(v1.queue)
    for i in range(4):
        print(v1.next_task())


if __name__ == '__main__':
    test_queue()

    waiting_task = Queue()
    completed_task = Queue()
    not_full_task = Queue()
