"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
def activate (login, mydict): # O(1)
    print('Проверка активации')
    if mydict.get (login)[1] == 0: # O(1)
        if (input ('Необходимо пройти активацию ')).lower () == 'y': # O(1)
            return 1
        else:
            return 0
    return 1

def login_to_web(login, mydict): # O(N)
    if login in mydict.keys(): # O(N)
        if activate(login, mydict) == 1: #O(1)
            mydict[login][1] = 1 #O(1)
            if (input('Введите пароль: ') == mydict.get(login)[0]): #O(1)
                return 'Вэлком'
            else:
                return 'Пароль не совпадает'
        else:
            print('Активация не пройдена, вход в ресурс невозможен')
    else:
        print('Нет такого пользователя')
    return 0

def check_pass (login, mydict): #O(1)
    if (input ('Введите пароль: ') == mydict.get (login)[0]): #O(1)
        return 1
    else:
        return 0

my_dict = {'Cool_boy': ['Andrey', 1],
           'Billy_boy':['Bill_Geyts', 0],
           'Teddy':['Bear_Paddington', 0],
           'Lucky':['Al_Pacino', 1],
           'Heardy_punch':['Anastasyay', 0],}


    print('Способ 1') #O(N)
    print(login_to_web(input('Введите логин:  '), my_dict)) #O(N)
    print('Способ 2') #O(1)
    login_web = input('Введите логин:  ') #O(1)
    if my_dict [login_web][1] == 0: #O(1)
        if activate(login_web,my_dict) == 1 & check_pass(login_web,my_dict) == 1: #O(1)
            print('Вход выполнен')
        else:
            print ('Вход не выполнен')



