"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""


# O(N^2)

def sort(n):
    for i in range(0, len(n) - 1):  # O(n)
        for j in range(i + 1, len(n)):  # O(n)
            if n[j] < n[i]:  # O (log N)
                n[i], n[j] = n[j], n[i]  # O(1)


n = [2, 7, 8]
sort(n)
print(n[0])


# O(N)
def min(a):
    b = a[0]  # O(1)
    for el in a:  # O(n)
        if el < b:  # O(log N)
            el = b  # O(1)
    return b  # O(1)


print(min([2, 3, 4]))