"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


# Сложность O(n^2)
random_nums = [24, 56, 12, 3, 11]


def selection_min_of_nums(nums):
    for i in range(len(nums)):                    # O(n)
        lowest_value = i                          # O(1)
        for j in range(i + 1, len(nums)):         # O(n)
            if nums[j] > nums[lowest_value]:      # O(1)
                lowest_value = j                  # O(1)
        return lowest_value


print(selection_min_of_nums(random_nums))

# Сложность O(n)

x = [2, 4, 1, 6]


def my_min_num(nums):
    low = nums[0]     # O(1)
    for i in nums:    # O(n)
        if i < low:   # O(1)
            low = i   # O(1)
    return low        # O(1)


print(my_min_num(x))
