"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
annual_profit = {
    'Hyundai': 80000000,
    'BMW': 356700000,
    'Nissan': 56000000,
    'Honda': 128000000,
    'Chrysler': 40000000,
    'Ford': 78000000,
    'Daimler': 56000000,
    'VW': 77000000,
    'Toyota': 112000000
}


"""
Вариант решения 1. Сложность: O(n^2), квадратичная.
Не элегантна на вид и более затратна по времени, 
чем Вариант2.
"""
srt_values = sorted(annual_profit.values(), reverse=True)
srt_profit = []
for v in srt_values:
    for k in annual_profit.keys():
        if annual_profit[k] == v:
            srt_profit.append((k, v))

print(srt_profit[:3])

"""
Вариант решения 2. Сложность: O(n log n), линейно-логарифмическая (sorted).
менее затратен по времени, более элегантен, соответственно,
более предпочтителен.
"""
a = sorted(annual_profit.items(), key=lambda item: item[1], reverse=True)

print(a[:3])

