"""
Задание 5.
Задание на закрепление навыков работы со стеком

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим стеком порогового значения.
Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
для реализации этой задачи.

После реализации структуры, проверьте ее работу на различных сценариях

Подсказка:
Отдельне стопки можно реализовать через:
# 1) созд-е экземпляров стека (если стопка - класс)
# 2) lst = [[], [], [], [],....]
"""


class Stack:
    def __init__(self):
        self.stack = []
        self.lst = []

    def push(self, item):
        self.stack.append(item)
        if len(self.stack) > 2:
            self.lst.append(self.stack)
            self.stack = []


s = Stack()

s.push(1)
s.push(1)
s.push(1)
s.push(1)
s.push(2)
s.push(4)
s.push(5)
s.push(5)
s.push(5)
s.push(5)

print(s.stack)

print(s.lst)

