"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
list = [2, 5, -4, 6, 8, 9, 4, 2, 3, -3]

def min_1(list): # линейная
    min_num = list[0]
    for i in list[1:]:
        if i < min_num:
            min_num = i
    return min_num

def min_2(list):  # квадратичная
    for i in list:
        flag = True
        for j in list:
            if i > j:
                flag = False
        if flag:
            min_num = i
    return min_num

print(min_1(list))
print(min_2(list))


