"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

def find_max(data_dict):          # O(N)
    kmax = None
    vmax = -1
    for k,v in data_dict.items(): # O(N)
        if v > vmax:              # O(1)
            vmax = v              # O(1)
            kmax = k              # O(1)
    return kmax, vmax             # O(1)

def find_leaders_1(data_dict):       # Сложность O(N)
    leaders = {}                     # O(1)
    kmax, vmax = find_max(data_dict) # O(N)
    leaders[kmax] = vmax             # O(1)
    data_dict.pop(kmax)              # O(1)
    kmax, vmax = find_max(data_dict) # O(N)
    leaders[kmax] = vmax             # O(1)
    data_dict.pop(kmax)              # O(1)
    kmax, vmax = find_max(data_dict) # O(N)
    leaders[kmax] = vmax             # O(1)
    data_dict.pop(kmax)              # O(1)
    return leaders                   # O(1)


data = {
    '1 Ltd': 12345.67,
    '2 Ltd': 56789.01,
    '3 Ltd': 67890.12,
    '4 Ltd': 23456.78,
    '5 Ltd': 89012.34,
    '6 Ltd': 34567.89,
    '7 Ltd': 45678.90,
    '8 Ltd': 78901.23,
    '9 Ltd': 90123.45
}

print(find_leaders_1(data))
