"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

def min(lst):
    min_val = lst[0]  # O(1)
    for e in lst:  # O(n)
        if min_val > e:  # O(1)
            min_val = e  # O(1)
    return min_val  # O(1)



def min_alt(lst):
    min_val = lst[0]
    for e in lst:
        for el in lst:
            if e > el:
                if el < min_val:
                    min_val = el
    return min_val


lst = [99, 9, 5, 99, 8, 11, -1, 32, 555, 6, 22, 5, 56236, 6]
print(min(lst))
print(min_alt(lst))