"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

def find_min_value(my_list):  # Сложность: O(n)
    one_value = my_list[0]
    for i in my_list:
        if i < one_value:
            one_value = i
    return one_value


def find_min_value_2(my_list):  # Сложность: O(n^2)
    min_value = 0
    for i in my_list:
        for j in my_list:
            if j < i:
                min_value = j
    return min_value


test_list = [9, 2, 5, 8, 1]

print(find_min_value(test_list))
print(find_min_value_2(test_list))
