"""
Задание 7.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
"""

# Здесь происходит импорт файла, который был в примерах, он никак не изменен, так что на проверку отправлен только этот.
# Не стала прикреплять тот, потмоу что изменен только этот (добавлена функция уборки пробелов).

from task_16 import DequeClass


def pal_checker(string):
    dc_obj = DequeClass()

    s = ''
    for i in string:
        if i != ' ':
            s += i
    print(s)
    for el in s:
        dc_obj.add_to_rear(el)

    still_equal = True

    while dc_obj.size() > 1 and still_equal:
        first = dc_obj.remove_from_front()
        last = dc_obj.remove_from_rear()
        if first != last:
            still_equal = False

    return still_equal
