"""
Задание 2.

Реализуйте два алгоритма.
"""

def get_min1(lst):
    """
    Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
    В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
    Сложность такого алгоритма: O(n^2) - квадратичная.

    Сложность: O(n^2) - Квадратичная.
    """
    m = lst(0)
    for i in range(len(lst)):       # O(n) - Линейная
        for j in range(len(lst)):   # O(n) - Линейная
            if lst(i) < lst(j):
                m = lst(i)          # O(1) - константная
    return m                        # O(1) - константная


def get_min2(lst):
    """
    Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
    Сложность такого алгоритма: O(n) - линейная.

    Сложность: O(n) - Линейная.
    """
    m = lst(0)
    for i in range(len(lst)):       # O(n) - Линейная
        if m < i:
            m = i                   # O(1) - Константная
    return m                        # O(1) - Константная


"""
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
