"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
from random import randint


# алгоритм первый O(n^2)
def find_min1(lst):
    for i in lst:  # O(n)
        min_num = True  # O(1)
        for j in lst:  # O(n)
            if j < i:  # O(1)
                min_num = False  # O(1)
        if min_num:  # O(1)
            return i  # O(1)


# алгоритм второй O(n)
def find_min2(lst):
    min_num = lst[0]  # O(1)
    for i in lst:  # O(n)
        if i < min_num:  # O(1)
            min_num = i  # O(1)
    return min_num  # O(1)


numbers = [randint(0, 100) for i in range(10)]
print(numbers)
print(find_min1(numbers))
print(find_min2(numbers))
