"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

company = {
    'globalink': 12580,
    'philips': 531580,
    'hp': 271343,
    'lg': 1301111,
    'sony': 74800593,
    'samsung': 18702,
    'apple': 4583197,
    'midea': 8723491,
    'bosh': 5246158,
    'gorenje': 595231
}
# 1) Сложность O(n log n)
list_d = sorted(company.items(), key=lambda x: x[1], reverse=True)
for i in range(3):
    print(f'{list(list_d[i])[0]} : {list(list_d[i])[1]}')

# 2) Сложность O(n)
cp_dict = company.copy()
for i in range(3):
    maxim = max(cp_dict.items(), key=lambda it: it[1])
    print(list(maxim))
    del cp_dict[maxim[0]]

# 3) Лучший вариант линейной сложности. Потому что ее сложность зависит
#    только от размера входных данных.  И нет сортировки.
#
