"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

row = [1, 2, 3, 4, 5]

"""
O (n^2) Квадратичная 
"""


def getmin(m):
    answer = m[0]
    for i in m:
        if i < answer:
            answer = i
    return answer


getmin(row)

"""
O(n) - Линейная
"""

m = [n for n in row if all(n <= i for i in row)]

print(m)

