"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.


Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

""" Первый алгоритм. Сложность:  N * N * 1 + 1 + 1 = N^2 Квадратичная сложность """


def task_1(list_obj):
    for x in range(len(list_obj)):                                          # O(N)
            for y in range(x + 1, len(list_obj)):                           # O(N)
                if list_obj[x] < list_obj[y]:                               # O(1)
                    list_obj[x], list_obj[y] = list_obj[y], list_obj[x]     # O(1)
    return list_obj[-1]                                                     # O(1)


task_1(list_obj=[5, 2, 3, 7, 9, 12, 1])


""" Второй алгоритм. Сложность = N * 1 + 1 + 1 = N линейная сложность """


def task_2(list_obj):
    for x in range(len(list_obj) - 1):                                      # O(N)
        if list_obj[x] < list_obj[x + 1]:                                   # O(1)
            list_obj[x], list_obj[x + 1] = list_obj[x + 1], list_obj[x]     # O(1)
    return list_obj[-1]                                                     # O(1)


task2_1(list_obj=[5, 2, 3, 7, 9, 12, 1])