"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""
from random import randint


def search_min_1(my_list):          # Итого: O(n^2)
    for i in my_list:               # O(n)
        minimum = True              # O(1)
        for j in my_list:           # O(n)
            if i > j:               # O(n)
                minimum = False     # O(1)
        if minimum:                 # O(1)
            return i                # O(1)


def search_min_2(my_list):              # Итого: O(n)
    minimum = my_list[0]                # O(1)
    for i in range(1, len(my_list)):    # O(n)
        if my_list[i] < minimum:        # O(n)
            minimum = my_list[i]        # O(n)
    return minimum                      # O(n)


rnd = [randint(1, 99) for i in range(5)]
print(rnd)
print(f'O(n^2): {search_min_1(rnd)}')
print(f'O(n)):  {search_min_2(rnd)}')
