"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

list_user = [56, 5, 58, 9, 96, 36, 2, 15, 10]


def complexity_quadrotic(list_min, min_number):    # первый алгоритм. Квадратичная сложность O(n^2)
    for i in list_min:
        min_number = i
        for j in list_min:
            if i < j and i < min_number:
                min_number = i
            if j < i and j < min_number:
                min_number = j
    print('Минимальное значение: ', min_number, sep='')


def complexity_linear(list_min):    # второй алгоритм. Линейная сложность O(n)
    result = list_min[0]
    for i in list_min:
        if i < result:
            result = i
    print(f'Минимальное значение: {result}')


complexity_linear(list_user)
complexity_quadrotic(list_user, 0)
