"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

import operator

company_dict = {
            'comp_1': 500,
            'comp_2': 200,
            'comp_3': 3000,
            'comp_4': 400,
            'comp_5': 987,
            'comp_6': 1000,
            'comp_7': 10
}

sorted_company = sorted(company_dict.items(), key=operator.itemgetter(1))
top_company = sorted_company[(len(sorted_company)-3)::]

print(top_company)

'''
В голову пришло только одно решение данной задачи. На мой взгляд, оно довольно простое,
так как выполняется минимум операций. Сортировка списка, а затем срез с получением последних трех
элементов словаря. Сложность такого алгоритма - линейная.
'''
