"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
def find_min_1(lst):  # сложность алгорима - квадратичная, ибо вложенность  
    elem_min = lst[0]
    for index in range(len(lst)): # O(n)
        for elem_second in lst[index + 1 : ]: # O(n-1)
            if lst[index] > elem_second:
                elem_min = elem_second
    return elem_min

def find_min_2(lst):  # сложность алгоритма - линейная
    elem_min = lst[0]
    for index in range(len(lst)-1): # O(n)
        if lst[index] > lst[index+1]: # коснтанта
                elem_min = lst[index+1] 
    return elem_min

N = 20
lst = [i for i in range(N)]
# print(lst)

print('ф-ция 1, min =', find_min_1(lst))
print('ф-ция 2, min =', find_min_2(lst))
