"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


def max_profit_1(companies_dict):
    """
    В плане сложности неплохое решение: O(Nlog(N))
    """

    sort_list = []
    for profit in sorted(companies_dict.items(), key=lambda x: x[1], reverse=True):  # O(Nlog(N))
        sort_list.append(profit)  # O(1)
    return sort_list[:3]  # O(1)


from collections import Counter


def max_profit_2(companies_dict):
    """
    Более простое решение как мне кажется. Могу ошибаться в плане сложности, но мне кажется O(Log(N))
    """
    sort_dict = dict(Counter(companies_dict).most_common(3))
    return sort_dict


companies = {'Intel': 345000,
             'AMD': 400000,
             'NVIDIA': 500000,
             'ATI': 120000,
             'Telbel': 13000,
             'Gideon': 43200}
print(max_profit_1(companies))
print(max_profit_2(companies))
