"""
Задание 3.
Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Задание творческое. Здесь нет жестких требований к выполнению.
"""
comp = {
    'Walmart': 6670,
    'Sinopec': 5845,
    'Volkswagen': 14322,
    'Toyota': 16982,
    'BP': 9383
}

def search(lst): #O(n)
    n = {}
    dlst = dict(lst)
    for i in range(3):
        mlst = max(dlst.items(), k=lambda k: k[1])
        del dlst[mlst[0]]
        n[mlst[0]] = mlst[1]
    return n

dlst = list(comp.items()) #O(nlogn)
dlst.sort(key=lambda k: k[1], reverse=True)
for i in range(3):
    print(dlst[i][0])

