"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

import random

# Сложность O(n)

def min1(x: list) -> int:
    minimal = x[0]
    for i in range(1, len(x)):
        minimal = minimal if minimal < x[i] else x[i]
    return minimal

# ****

# Сложность O(n^2)

def min2(lst: list):
    for i in range(len(lst)-1):
        for x in range(len(lst)-i-1):
            if lst[x] > lst[x+1]:
                lst[x], lst[x+1] = lst[x+1], lst[x]
    return lst[0]


randomnum = [random.randint(0, 100) for i in range(10)]
print(randomnum)
print(min1(randomnum))
print(min2(randomnum))