"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

"""
Первое решение эффективнее. Несмотря на то, что сложность в данной ситуации одинаковая, 
словари по умолчанию работают быстрее, т.к.  доступ к элементу получают по ключу, а не по позиции.
"""

# 1 O(n^2)

users = {'Apple45': 'password'}
login_u = input('Ваше имя: ')
password_u = input('Ваш пароль: ')
if login_u in users.keys():
    expected_password = users[login_u]
    if expected_password == password_u:
        print('Приветствую тебя!')
    else:
        print('Неверный пароль или имя пользователя!')

else:
    print('Ваше имя пользователя не найдено, хотите пройти регистрацию?')

# 2 O(n^2)

users = [
    {'name': 'Kirill', 'password': '1234'},
    {'name': 'Lena', 'password': '5678'},
]
user_list = []
for i in range(len(users)):
    user_list.append(users[i]['name'])


def log_check():
    name_input = input("Пожалуйста, введите имя пользователя: ")
    if name_input in user_list:
        dict_index = user_list.index(name_input)
        password_input = input("Пожалуйста, введите пароль:")
        if password_input == users[dict_index]['password']:
            print('Приветствую тебя!')
        else:
            print('Неверный пароль или имя пользователя!')
    else:
        print('Ваше имя пользователя не найдено, хотите пройти регистрацию?')


while True:
    log_check()
