"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

def find_min(lst):
    """ Difficult: O(n^2)"""

    for i in lst:  # O(n)
        my_bool = False
        for j in lst:  # O(n)
            if i < j:  # O(1)
                my_bool = True
            else:
                my_bool = False
        if my_bool:
            return i


lst = [11, 55, 32, 4, 7]
print(find_min(lst))

###################################################################################

def find_min_2(el):
    """Difficult: O(n) """
    param = el[0]
    for i in el:  # O(1)
        if param > i:  # O(1)
            param = i
    return param

lst = [31, 52, 25 , 78]
print(find_min_2(lst))