"""
Задание 6.
Задание на закрепление навыков работы с очередью

Реализуйте структуру "доска задач".

Структура должна предусматривать наличие несольких очередей задач, например,
1) базовой, откуда задачи берутся, решаются и отправляются в список решенных
2) очередь на доработку, когда нерешенные задачи из первой очереди отправляются
на корректировку решения

После реализации структуры, проверьте ее работу на различных сценариях

"""

from collections import deque

q = deque()

q.append('eat')
q.append('sleep')
q.append('work')

print(q)

# список решенных задач
def resolved():
    resolved_list = [q.popleft()]
    return resolved_list

# Очередь на доработку
def revision():
    revision_list = [q.popleft()]
    return revision_list



