"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
#1 O(NlogN)
coin = { 'Apple': 100, 'Samsung': 99, 'Sony': 98, 'Xiaomi': 97}
def min_cin(coin):
    delit = min(coin, key=coin.get)
    del coin[delit]
    print(coin)
min_cin(coin)

#2 O(N)
coin2 = { 'Apple': 100, 'Samsung': 99, 'Sony': 98, 'Xiaomi': 97}
def min_cin1(coin2):
    list_coin2 = dict(coin2)
    ch_max = {}
    for i in range(3):
        max_max = max(list_coin2.items(), key = lambda i: i[1])
        del list_coin2[max_max[0]]
        ch_max[max_max[0]] = max_max[1]
    return ch_max
min_cin1(coin2)
