""" Домашняя работа Дармограй Полины
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
list = [['1st', 100000], ['2nd', 150000], ['3rd', 30000], ['4th', 140000], ['5th', 1000000], ['6th', 200500]]

def func1(main_list): # O(n)
    max = 0 # O(1)
    med = 0 # O(1)
    min = 0 # O(1)
    for i in main_list: # O(n)
        if i[1] > max: # O(1)
            max = i[1] # O(1)
        elif i[1] > med: # O(1)
            min = med # O(1)
            med = i[1] # O(1)
    return(max, med, min) # O(1)

def func2(main_list): # O(N log N)
    list_n = [] # O(1)
    for i in main_list: # O(n)
        list_n.append(i[1]) # O(1)
    list_n.sort # O(N log N)
    return(list_n[0:3]) # O(3)

print(func1(list))
print(func2(list))

# Первое решение будет лучше т.к. его общая сложность меньше второго.
