"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


# 2 решение более эффективное, потому что не нужно проходить по всем элементам и добавлять их в новый список.

# Сложность O(n log n)

data = {'Gazprom': 25, 'Sberbank': 2, 'MTS': 15, 'Megafon': 10, 'VEON': 5}
lst = []
for el in data.values():
    lst.append(el)
lst.sort()
print(lst[-3:])


#  Сложность O(n)

data_2 = {'Gazprom':25, 'Sberbank':2, 'MTS': 15, 'Megafon': 10, 'VEON': 5}

val = list(data_2.values())
val.sort()
print(val[-3:])
