"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

users = [
    {'login': 'Tritium', 'password': '12345678', 'is_active': False},
    {'login': 'Harry_Potter', 'password': 'Expelliarmus', 'is_active': False},
    {'login': 'Ivanov', 'password': 'Ivanov1', 'is_active': False}
]


def login(log, passwd):
    """
    Алгоритм 1.
    Сложность O(N^2)
    """
    user_list = [user['login'] for user in users]

    while log not in user_list:
        log = input('Ошибка в имени пользователя. Попробуйте еще раз: ')
    for user in users:
        if user['login'] == log:
            while user['password'] != passwd:
                passwd = input('Пароль неверен. Попробуйте еще раз: ')
            user['is_active'] = True
            return 'Аутентификация пройдена'


def login_second(log, passwd):
    """
    Алгоритм 2.
    Сложность O(N)
    """
    user_list = {user['login']: user['password'] for user in users}
    while log not in user_list or passwd != user_list[log]:
        if log not in user_list:
            log = input('Ошибка в имени пользователя. Попробуйте еще раз: ')
        else:
            passwd = input('Пароль неверен. Попробуйте еще раз: ')
    return 'Аутентификация пройдена'


print(login('Tritiumь', '12345678'))
print(login_second("Tritiumm", '123456789'))

"""
Эффективнее решение номер 2: 
- меньшая алгоритмическая сложность;
- понятнее;
- компактнее.
"""
