"""
Задание 7.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
"""

def check_text(text):
    clear_text = ''
    for i in text:
        if i.isalpha():
            clear_text += i
    return clear_text

def polindrom(text):
    for i in range(len(text)//2):
        if text[i] != text[-i-1]:
            return f'не полиндром'
    return f'полиндром'

print(polindrom(check_text('шалаш')))


