"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""

import random


# O(n^2) - квадратичная
def search_min_n2(lst):
    for i in range(len(lst)):
        for j in range(len(lst)):
            if lst[i] < lst[j]:
                lst[j], lst[i] = lst[i], lst[j]
    return lst[0]


# O(n) - линейная.
def search_min_n(lst):
    min_val = lst[0]
    for i in range(len(lst)):
        if min_val > lst[i]:
            min_val = lst[i]
    return min_val


lst = [el for el in random.sample(range(-100, 100), 20)]

print(search_min_n(lst))
print(search_min_n2(lst))