"""
Задание 3.
Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Задание творческое. Здесь нет жестких требований к выполнению.
"""
# Второе решение лучше и короче, так как мы не добавляем значение в новый список => не создаем переменную и не используем аppend
# Сложность O(n^2)
company = {
    'Rosneft': 1,
    'Lukoil': 2,
    'Surgutneftegaz': 3,
    'Bashkirneft': 4,
    'Gazpromneft': 5
}
lst = []  # O(len(...))
for k in company.values():  # O(n)
    lst.append(k)  # O(1)
print(*lst[-3:])  # O(1)

# Сложность O(n)
company_2 = {'Rosselhoz': 1, 'Sberbank': 2, 'MTS': 3, 'VTB': 4, 'Alpha': 5}
val = [el for el in company_2.values()]  # O(n)
print(*val[-3:])  # O(1)