"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать где какая сложность.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
# O(n^2) - квадратичная


a = [47, 2121, 11, 33, 44, 88, 17, 5]


def sort_1(a):
    n = len(a)
    for i in range(n):
        for j in range(n - 1):
            if a[j] > a[j + 1]:
                a[j], a[j + 1] = a[j + 1], a[j]


sort_1(a)
print(a[0])
# -------------------------------------------------------------------------------------

# O (n) - линейная

my_list = [47, 2121, 11, 33, 44, 88, 17, 5]


def func_min(my_list):
    el_min = my_list[0]
    for el in my_list:
        if el < el_min:
            el_min = el
    return el_min


print(func_min(my_list))
