"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
data_dict = {'Apple': 55256, 'Microsoft': 39240, 'Alphabet': 34343,
             'Walmart': 14881, 'Pfizer': 16273, 'Saudi Aramco': 88211}


# Difficult: O(n)
def find_max(lst):
    """Difficult: O(n) """
    result_dict = dict()
    for _ in range(3):  # O(1)
        el = max(lst, key=lst.get)  # O(n)
        result_dict[el] = lst[el]  # O(1)
        lst.pop(el)
    return result_dict


print(find_max(data_dict))

#############################################################################################


def find_max_2(dct):
    """ Difficult: O(n^2)
    Это решение менее эффективно, по причине квадратичной сложности
    """
    result_dct = {}
    list_value = list(dct.values())
    for _ in range(3):
        param = 0
        for i in list_value:  # O(n)
            if param < i:
                param = i
        list_value.remove(param)
        for key in dct.keys():  # O(n)
            if dct[key] == param:  # O(1)
                result_dct[key] = dct[key]
    return result_dct


print(find_max_2(data_dict))