"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
info = {"User1": ["password", True], "User2": ["password", True], "User3": ["password", False], "User4": ["password", False]}

# O(n)
def func1(data, login, password):
    for i in data: #O(n)
        if login == i and password == data[i][0]: #O(n)
            if data[i][1] == False: #O(n)
                return "Пройдите активацию учетной записи" # O(1)
            else:
                return "Пользователь авторизован" # O(1)




# O(n)
def func2(info, login, password):
    passwords = []  # O(1)
    activations = []  # O(1)
    for i in list(info.values()):  # O(n)
        passwords.append(i[0])  # O(1)
        activations.append(i[1])  # O(1)
    if login not in list(info.keys()) or password not in passwords:  # O(n)
        return 'Неверный логин или пароль'  # O(1)
    elif info[login][1]:
        return 'Пользователь авторизован'  # O(1)
    else:
        return 'Пройдите активацию учетной записи'  # O(1)

print(func1(info, "User1", 'password'))
print(func1(info, "User4", 'password'))


print(func2(info, "User1", 'password'))
print(func2(info, "User4", 'password'))
print(func2(info, "User5", 'password'))