"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""
# O(N^2)
def min_value1(list):
    for i in list:
        min_value = True
        for j in list:
            if j < i:
                min_value = False
                break
        if min_value:
            return i

def min_values2(list):
    min_value = list[0]
    for i in range(1, len(list)):
        if list(i) < min_value:
            min_value = list(i)
    return min_value