"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

company = {'aaa': 1500, 'bbb': 1000, 'ccc': 1200, 'ddd': 1800, 'eee': 500, 'ggg': 1800}

# 1 решение. Сложность линейно логарифмическая O(n log n)
comp_1, comp_2, comp_3 = sorted(company, key=lambda x: company[x], reverse=True)[:3]
print(f'1ая - {comp_1}, 2ая - {comp_2},3ья - {comp_3}')

# 2 решение. Сложность квадратичная O(n^2)
values_comp = sorted(company.values())[-3:]
comps = []
for i, z in company.items():
    if z in values_comp:
        comps.append(i)
print(f'Компании с самой большой прибылью: {" ".join(comps)}.')

"""
Сложность первого решения линейно логарифмическая, сложность второго квадратичная. Первое решение
проще, так как не происходит лишнего цикла-перебора по словарю, необходимое значение вычисляется во время 
первого перебора. Во втором же решении проходит перебор по ключ-значение словарю, .
"""