"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

# Эффективнее решение 1, т.к. в нем осуществляется меньшее количество действий, поэтому
# оно должно отрабатывать быстрее (по времени)

def auth_version_1(log, passw):

    # Сложность О(N)

    if log in storage.keys():                                   # O(N)
        if passw == str(storage[log][0]):                       # O(1)
            if not storage[log][1]:                             # O(1)
                print('Необходимо пройти аутентификацию!')      # O(1)
            else:
                print('Добро пожаловать!')                      # O(1)
        else:
            print('Вы ввели неверный пароль!')                  # O(1)
    else:
        print('Вы ввели неверный логин!')                       # O(1)


def auth_version_2(log, passw):

    # Сложность О(N)

    flag = False                                                # O(1)
    for stor_log, stor_params in storage.items():               # O(N)
        if log == stor_log:                                     # O(1)
            flag = True                                         # O(1)
            if passw == str(stor_params[0]):                    # O(1)
                if stor_params[1]:                              # O(1)
                    print('Добро пожаловать!')                  # O(1)
                else:
                    print('Необходимо пройти аутентификацию!')  # O(1)
            else:
                print('Вы ввели неверный пароль!')              # O(1)

    if not flag:                                                # O(1)
        print('Вы ввели неверный логин!')                       # O(1)


storage = {'Vasya': (123456, True), 'Petya': ('qwerty', True), 'Alice': ('ycs523gdas', False),
           'Bob': ('nbcmnxzbc', True), 'Eve': ('bczv27632cs', False)}

login = input('Введите логин: ')
password = input('Введите пароль: ')

auth_version_1(login, password)
auth_version_2(login, password)