"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""



# system_info_dict = {'login': [password, activ_boolean]}
system_info_dict = {'Alex': ['qwerty', 1],
                'Sam': ['q', 0],
                'Sveta': ['qw', 1]
                }


def authorization(system_info, login, password):  # O(1) - константная сложность
    try:
        value_list = system_info.get(login)  # O(1) 
        # print(value_list)
        print('Проверка...\n')
        if password == value_list[0]:
            print('Авторизация пройдена')
            if value_list[1]:
                print('Вы допущены к ресурсу\n')
            else:
                print('Выша учетка не активирована. \nПожалуйста, пройдите активацию вашей учетной записи.\n')
        else:
            print('Неверный пароль\n')
    # except:
    #   print("Логина нету в базе")
    except Exception as e:
        print(f"Логина нету в базе, ошибка: {e}")


def authorization_2(system_info, login, password):  # O(n) - линейная
    print('Проверка...')
    for key, value in system_info.items():  # O(n)
        if key == login:
            if password == value[0]:
                print('Авторизация пройдена')
                if value[1]:
                    print('Вы допущены к ресурсу\n')
                else:
                    print('Выша учетка не активирована. \nПожалуйста, пройдите активацию вашей учетной записи.\n')
                break
            else:
                print('Неверный пароль\n')
    else:
        print('Вы не зарегестрированы\n')


user_login = 'Sveta'
user_password = 'qw'
print(f"Введен логин: {user_login} и пароль: {user_password}\n")
authorization(system_info_dict, user_login, user_password)

authorization_2(system_info_dict, user_login, user_password)

# 3) сделайте вывод, какое решение эффективнее и почему
# первое решение эффективнее, тк его сложность - константная, что меньше чем у 2ого решения, где сложность линейная
# этого удалось добиться, используя встроенный ф-ции работы со словарем
