"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
# 1. Сложность: O(N log N) - линейно-логарифмическая
company_dict = {'Nike': 10000, 'Adidas': 55322, 'Reebok': 24699, 'Puma': 23425, 'Asics': 32222}
my_list = list(company_dict.items()) # O(N)
my_list.sort(key = lambda index: index[1]) # O(NlogN)
print(my_list[:3])  # O(N)

# 2. Сложность: O(N) - линейная
from operator import itemgetter
company_dict = {'Nike': 10000, 'Adidas': 55322, 'Reebok': 24699, 'Puma': 23425, 'Asics': 32222}

def get_max(data, count):
    maximum = [(k, data[k]) for k in data] # O(N)
    maximum = sorted(maximum, key=itemgetter(1), reverse=True) # O(N)
    return dict(maximum[:count]) # O(N)

print(get_max(company_dict,3))
