"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов  2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

database = {'Com_1': 262525,
            'Com_2': 243244,
            'Com_3': 245678,
            'Com_4': 254654,
            'Com_5': 253454}

def max_value_1(base):
    values = []
    for i in base.values():
        values.append(i)
    values.sort()
    values = values[-3:]
    com_list = []
    for i in base:
        if base[i] in values:
            com_list.append(i)
    return com_list
'''Сложность, думаю, О(n). Линейная. Чем длиннее словарь, тем дольше, но шагов всегда столько, сколько элементов'''

def max_value_2(base):
    com_list = []
    for _ in range(3):
        for i in base:
            flag = True
            for j in base:
                if base[i] < base[j]:
                    flag = False
            if flag:
                com_list.append(i)
                del base[i]
                break
    return com_list
'''Сложность O(n**2) квадратичная, так как для вычисления максимального значения каждый элемент 
сравнивается с каждым элементом'''
# наверное так

print(max_value_1(database))
print(max_value_2(database))

'''эффективнее первое решение, так как меньше операций, при одинаковых входящих данных'''