"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

users = {'user_1': {'password': 'wkf21nk', 'activation': True},
         'user_2': {'password': 'polkqq567', 'activation': True},
         'user_3': {'password': 'AWFxvmz', 'activation': False},
         'user_4': {'password': '1000zxc', 'activation': False},
         'user_5': {'password': 'qwerty1', 'activation': True}}

users_2 = {'user_1': ['wkf21nk', True],
           'user_2': ['polkqq567', True],
           'user_3': ['AWFxvmz', False]}


# 1 решение, Сложность: О(N) - линейная
def auth_1(dict, user_name, user_password):
    for key, value in dict.items():  # О(N) - линейная
        if key == user_name:  # О(1) - константная
            if value['password'] == user_password and value['activation']:  # О(1) - константная
                return "Добро пожаловать"  # О(1) - константная
            elif value['password'] == user_password and not value['activation']:  # О(1) - константная
                return "Пройдите активацию"  # О(1) - константная
            elif value['password'] != user_password:  # О(1) - константная
                return "Пароль неверный"  # О(1) - константная
    return "Пользователь не найден"  # О(1) - константная


print(auth_1(users, 'user_1', 'wkf21nk'))
print(auth_1(users, 'user_2', 'qwerty'))
print(auth_1(users, 'user_3', 'AWFxvmz'))


# 2 решение, Сложность: О(1) - константная
def auth_2(dict):
    login = input("Login: ")                        # О(1) - константная
    if dict.get(login) and dict[login][1] == 1:     # О(1) - константная
        passw = input("Password: ")                 # О(1) - константная
        if dict[login][0] == passw:
            print("Добро пожаловать")               # О(1) - константная
        else:
            print("Пароль неверный")                # О(1) - константная
    elif dict.get(login) and dict[login][1] == 0:   # О(1) - константная
        print("Пройдите активацию")                 # О(1) - константная
    else:
        print("Пользователь не найден")             # О(1) - константная


print(auth_2(users_2))

# Второй вариант эффективнее, т.к. константная функция быстрее, чем линейная
