"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

# Сложность O(n)
def aut(users, username, userpass):
    for key, value in users.items():
        if key == username:
            if value['пароль'] == userpass and value['аутентификация']:
                return "Доступ разрешен"
            elif value['пароль'] == userpass \
                    and not value['аутентификация']:
                return "Учетная запись не активна! Пройдите активацию!"
            elif value['password'] != userpass:
                return "Введен не верный пароль"

    return "Такого пользователя не существует. Пройдите активацию"


# Сложность O(1)
def aut(users, username, userpass):
    if users.get(username):
        if users[username]['пароль'] == userpass \
                and users[username]['аутентификация']:
            return "Доступ разрешен"
        elif users[username]['пароль'] == userpass \
                and not users[username]['activation']:
            return "Учетная запись не активна! Пройдите активацию!"
        elif users[username]['пароль'] != userpass:
            return "Введен не верный пароль"
    else:
        return "Такого пользователя не существует. Пройдите активацию"


"""Второй метод лучше, т.к. сложность О(1) лучше"""
