"""
Задание 1.

Для каждой из трех функций выполнить следующее:

1) для каждого выражения вместо !!! укажите сложность этого выражения.
2) определите сложность каждой функции в целом.

Сложность нужно определять только там, где указаны символы !!!

Примечание:
Прошу вас внимательно читать ТЗ и не выполнять все пункты.
"""

import random


#############################################################################################
def check_1(lst_obj):
    """Функция должна создать множество из списка.

    Алгоритм 3:
    Создать множество из списка

    Сложность: линейная.
    """
    lst_to_set = set(lst_obj)  # O(n) - линейная
    return lst_to_set  # O(1) - константа


#############################################################################################
def check_2(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 1:
    Проходимся по списку и для каждого элемента проверяем,
    что такой элемент отстутствует
    в оставшихся справа элементах

    Сложность: линейная.
    """
    for j in range(len(lst_obj)):  # O(n) - линейная
        if lst_obj[j] in lst_obj[j + 1:]:  # O(n) - линейная
            return False  # O(1) - константа
    return True  # O(1) - константа


#############################################################################################
def check_3(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.

    Алгоритм 2:
    Вначале выполним для списка сортировку, далее, сравниваем элементы попарно
    Если присутствуют дубли, они будут находиться рядом.

    Сложность: Квадратичная
    """
    lst_copy = list(lst_obj)  # O(n) - линейная
    lst_copy.sort()  # O(nlogn) - линейно-логарифмическая
    for i in range(len(lst_obj) - 1):  # O(n) - линейная
        if lst_copy[i] == lst_copy[i + 1]:  # O(n) - линейная (так как вложенный - то O(n^2) - квадратичная)
            return False  # O(1) - константа
    return True  # O(1) - константа


#############################################################################################

# Сложность - линейная

for j in (50, 500, 1000, 5000, 10000):  # O(n) - линейная
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)  # O(n) - линейная( (с) Victor Stinner

print(check_1(lst))  # O(1) - константа
print(check_2(lst))  # O(1) - константа
print(check_3(lst))  # O(1) - константа
