"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

ф-ции min() и sort() не исп-ем!
"""
spis = [2, 5, 10, 11, 15, 0]
def min_ch(spis):
    k = 10**10
    for i in spis:
        for j in spis:
            if i < j and i < k:
                k = i
            elif j < i and j < k:
                k = j
    print(k)
min_ch(spis)

#Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
#Сложность такого алгоритма: O(n) - линейная.

spis = [2, 5, 10, 11, 15, 0]
def min_ch(spis):
    k = 10**10
    for i in spis:
        if k > i:
            k = i
    print(k)
min_ch(spis)
