"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""
import random


def min_val_n(lst_in):
    min_num = lst_in[0]
    for el in lst_in[1:]:
        if el < min_num:
            min_num = el
    return min_num


def min_val_n2(lst_in):
    for el in lst_in:
        is_min = True
        for num in lst_in:
            if num < el:
                is_min = False
        if is_min:
            return el


# lst = list()
lst = random.sample(range(1, 20), 5)
print(min_val_n2(lst), lst)
print(min_val_n(lst), lst)
