"""
Задание 6.
Задание на закрепление навыков работы с очередью

Реализуйте структуру "доска задач".

Структура должна предусматривать наличие нескольких очередей задач, например,
1) базовой, откуда задачи берутся, решаются и отправляются в список решенных
2) очередь на доработку, когда нерешенные задачи из первой очереди отправляются
на корректировку решения

После реализации структуры, проверьте ее работу на различных сценариях

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""


class BordTask:
    def __init__(self):
        self.base = []
        self.checkup = []
        self.completed = []

    def is_empty(self):
        return self.base == []


    def to_queue_base(self, item): # Добавляем в базовую очередь
        self.base.insert(0, item)

    def take_task(self):
        self.base.pop()

    def to_checkup(self):
        self.checkup.self.base.pop()


    def size(self):
        return len(self.elem)
