"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

"""Решение 1. Алгоритм: создать словарь и отсортировать по значениям
    Самая трудоемкая операция: сортировка
    Сложность алгоритма: n log n"""

companies_income = dict({'Apple': 1000000, 'Samsung': 90, 'Huawei': 90999,
                         'PayPal': 0, 'MAC': 100000000, 'Tesla': 99999,
                         'Yandex': 10, 'Uber': 99, 'Google': 1000})

sorted_tuples = sorted(companies_income.items(), key=lambda item: item[1], reverse=True)
for i in range(3):
    print(sorted_tuples[i][0])
print()
"""Решение 1. Алгоритм: отсортировать словарь по значениям
    Самая трудоемкая операция: сортировка
    Сложность алгоритма: О(n ^ 2)"""


def bubble_sort(lst: list) -> list:
    for i in range(len(lst) - 1):
        for j in range(len(lst) - 1 - i):
            if lst[j] < lst[j + 1]:
                lst[j], lst[j + 1] = lst[j + 1], lst[j]
    return lst


sorted_values = bubble_sort(list(companies_income.values()))[:]
sorted_dict = dict()
for i in sorted_values:
    for k in companies_income.keys():
        if companies_income[k] == i:
            sorted_dict[k] = companies_income[k]
            break
for key in sorted_dict:
    print(key)

"""
1 Решение будет лучше, потому что во-первых, используется быстрая сортировка
nlogn, а во вторых не пересоздается словарь заново
Во втором решении помимо квадратичного пузырька присутствует квадратичное
создание нового словаря"""