""" Домашняя работа Дармограй Полины
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
system_data = [['login', 'password', True],['nlogin', 'npassword', False]]

def func1(list): # O(n)
    login = input('Введите логин: ') # O(1)
    password = input('Введите пароль: ') # O(1)
    for i in list: # O(n)
        if login == i[0] and password == i[1] and i[2] is True: # O(1)
            print('Вы успешно авторизованы.') # O(1)
            break # O(1)
        else: # O(1)
            print('Пройдите активацию учетной записи или создайте ее.') # O(1)
            break # O(1)

def func2(list): # O(n)
    login = input('Введите логин: ') # O(1)
    password = input('Введите пароль: ') # O(1)
    list_n = [login, password] # O(1)
    for i in list: # O(n)
        if list_n == i[0:2]: # O(2)
            if i[2] is True: # O(1)
                print('Вы успешно авторизованы.') # O(1)
                break # O(1)
        else: # O(1)
            print('Пройдите активацию учетной записи или создайте ее.') # O(1)
            break # O(1)


func2(system_data)

# Сложность решений одинакова поэтому нельзя выделить одно из них.