"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
import random


def base():
    data = {}
    for i in range(1, 10):
        key = 'Компания' + str(i)
        value = random.randint(100, 10000)
        data[key] = value
    return data

#1ый вариант
def top3(data):
    my_list = sorted(company.values())[-3:]  # O(n log n)
    return my_list  # O(1)


#2ой вариант
def top3_2(data):
    my_list = [] # O(1)
    for val in company.values(): # O(n)
        my_list.append(val)  # O(1)
    my_list.sort()       # O(n log n)
    return my_list[-3:] # O(1)


company = base()   # O(1)
print(top3(company))
print(top3_2(company))
""" Меньше циклов - быстрее
"""