"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""
companies = {'firm1': 30000, 'firm2': 40000, 'firm3': 15000, 'firm4': 100000, 'firm5': 60000}


# Решение 1 O(N log N)
def top3_1():
    top_companies = {}
    sorted_companies = sorted(companies, key=companies.get, reverse=True) # O(N log N)
    for i in sorted_companies[:3]:
        top_companies[i] = companies.get(i)
    print(top_companies)

# Решение 2 # O(N log N)

def top3_2():
    top_companies = {}
    temp = list(sorted(companies.values(), reverse=True)[:3]) # O(N log N)
    for i in temp:
        for key, value in companies.items():
            if value == i:
                top_companies[key] = value
    print(top_companies)

top3_1()
top3_2()

