"""
Задание 5.
Задание на закрепление навыков работы со стеком

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим стеком порогового значения.
Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
для реализации этой задачи.

После реализации структуры, проверьте ее работу на различных сценариях

Подсказка:
Отдельне стопки можно реализовать через:
1) созд-е экземпляров стека (если стопка - класс)
или
2) lst = [[], [], [], [],....]

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

class StackPlate:

    def __init__(self):
        self.stack = [[]]

    def push_in(self, plate):
        if len(self.stack[-1]) < 10:
            self.stack[-1].append(plate)
            print(f'{len(self.stack[-1])} высота стопки')
        else:
            print(f'достигнута максимальная высота стопки {len(self.stack[-1])}  \n '
                  f'Начинаем складывать тарелки в новую стопку')
            self.stack.append([])
            self.stack[-1].append(plate)
            print(f'{len(self.stack[-1])} высота стопки')

    def push_out(self):
        if len(self.stack[-1]) > 0:
            self.stack[-1].pop()
        else:
            self.stack.pop()
            self.stack[-1].pop()

