import random


#############################################################################################
def check_1(lst_obj):
    """Функция должна создать множество из списка.
    Алгоритм 3:
    Создать множество из списка
    Сложность: !!!.
    """
    lst_to_set = set(lst_obj)        # !!!  O(n)
    return lst_to_set                # !!!  O(n)
                                     # Общая сложность 0(2n) - линейная

#############################################################################################
def check_2(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.
    Алгоритм 1:
    Проходимся по списку и для каждого элемента проверяем,
    что такой элемент отстутствует
    в оставшихся справа элементах
    Сложность: !!!.
    """
    for j in range(len(lst_obj)):          # 0(n)
        if lst_obj[j] in lst_obj[j+1:]:    # 0(n^2)
            return False                   # 1
    return True                            # 1
#0(n + n^2 + 1)



#############################################################################################
def check_3(lst_obj):
    """Функция должная вернуть True, если все элементы списка различаются.
    Алгоритм 2:
    Вначале выполним для списка сортировку, далее, сравниваем элементы попарно
    Если присутствуют дубли, они будут находиться рядом.
    Сложность: !!!
    """
    lst_copy = list(lst_obj)                     # o(n)
    lst_copy.sort()                              # o(n Log n)
    for i in range(len(lst_obj) - 1):            # o(n)
        if lst_copy[i] == lst_copy[i + 1]:       # 0(n)
            return False                         # 0(1)
    return True                                  # 0(1)


# O(3n + n * logN + 1)

#############################################################################################


for j in (50, 500, 1000, 5000, 10000):
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)

print(check_1(lst))
print(check_2(lst))
print(check_3(lst))