"""
Задание 2.
Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов

lst = [1, 10, 8, 3, 67, 33]
y = min(lst)
print(y) # Сложность: O(n)

lst.sort()
min = lst[0]
print(min) # Сложность: O(nlog n)

"""
# Считаем наименьшим 1-ый эл-т. Отсортируем список от меньшего к большему.
# Если в процессе сортировки находится эл-т меньше 1-го, то они меняются местами.
def list_sort(num):
    # Цикл перебора отсортированных индексов значений списка
    for i in range(len(num)):# !!! O(n)
        lowest_value_index = i # Присваиваем наименьшему первому элементу индекс i # !!! O(1)
        # Цикл перебирает остальные (несортированные) элементы начиная с i + 1
        for j in range(i + 1, len(num)): # !!! O(n)
            if num[j] < num[lowest_value_index]:# Если для эл-та с индексом j это верно, то # !!! O(1)
                lowest_value_index = j # Говорич, что наименьший элемент, несортированной части, имеет индекс j # !!! O(1)
        # Имеем вложенный цикл со сложностью O(n) в цикл O(n), т.е. имеем сл-ть O(n^2) - ДОМИНАНТ
        # Этот наименьший элемент меняем с первым в списке
        num[i], num[lowest_value_index] = num[lowest_value_index], num[i]# !!! O(1)
# !!! Имеем 2 вложенных линейных O(n) цикла
num = [12, 8, 3, 20, 11]
list_sort(num)
print(num)
print("Наименьший эл-т списка равен: ", num[0])

"""
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
"""

def list_min(num_1):
    smallest = num_1[0] # Говорим, что певый эл-т списка минимальный #!!! O(1)
# Ищем наименьшее значение
    for i in num_1: #!!! O(n) - ДОМИНАНТ
        if i < smallest:#!!! O(1)
            smallest = i#!!! O(1)
    return smallest#!!! O(1)
num_1 = [48, 52, 23, 41, 32]
print("Наименьший эл-т списка равен: ",  list_min(num_1))




