
"""
Задание 4. # 22:20 - В решённых примерах Вебинара 2
Для этой задачи:
1) придумайте 2-3 решения (не менее двух)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся ЛОГИН, ПАРОЛЬ и ОТМЕТКА ОБ АКТИВАЦИИ учетной записи.
Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Задание творческое. Здесь нет жестких требований к выполнению.
"""

# Общая сложность O(n)
def authorization1(users, user_name, user_password):
    # Обход - поиск ключа
    for key, value in users.items(): # !!! Имеем цикл for A in B: след-но O(n)- ДОМИНАНТ
        if key == user_name:# !!! Имеем присваивание (==) след-но O(1)
            if value['password'] == user_password and value['activation']:# Так же O(1)
                return "Добро пожаловать! Доступ к ресурсу предоставлен"
            elif value['password'] == user_password \
                    and not value['activation']: # Так же O(1)
                return "Учетная запись не активна! Пройдите активацию!"
            elif value['password'] != user_password: # Так же O(1)
                return "Пароль не верный"

    return "Данного пользователя не существует"


# общая сложность O(1) - Нет цикла. Остольное идентично предыдущему, сл-но O(1)
def authorization2(users, user_name, user_password):
    if users.get(user_name):
        if users[user_name]['password'] == user_password \
                and users[user_name]['activation']:
            return "Добро пожаловать! Доступ к ресурсу предоставлен"
        elif users[user_name]['password'] == user_password \
                and not users[user_name]['activation']:
            return "Учетная запись не активна! Пройдите активацию!"
        elif users[user_name]['password'] != user_password:
            return "Пароль не верный"
    else:
        return "Данного пользователя не существует"


"""Вторая реализация будет намного эффективнее,
так как в ней не используется цикл,
поиск в словаре по ключу имеет сложность O(1)"""


my_users = {'user1': {'password': '11111', 'activation': True},
            'user2': {'password': '11111', 'activation': False},
            'user3': {'password': '11111', 'activation': True},
            'user4': {'password': '11111', 'activation': False}
            }

print(authorization2(my_users, 'user6', '1111'))
