"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Не забудьте указать сложность каждого из двух алгоритмов. Для лучшего закрепления темы
можете определить и указать сложность еще и у каждого выражения этих двух алгоритмов.
Примечание:
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Постарайтесь не использовать ф-ции min() и sort() и другие ф-ции!
Подход должен быть максимально алгоритмическим.
"""


# 1 вариант квадратичная сложность O(n**2)
def minimum_value_1(list_1):
    minimum_number_1 = list_1[0]
    for i in list_1:
        for j in range(list_1.index(i) + 1, len(list_1) - 1, 1):
            if minimum_number_1 > list_1[j]:
                minimum_number_1 = list_1[j]
    return minimum_number_1


lst = [500, 800, 1, 456, 25, 1001]
print(minimum_value_1(lst))


# 1 вариант линейная сложность O(n)
def minimum_value_2(list_2):
    minimum_number_2 = list_2[0]
    for i in list_2:
        if i < minimum_number_2:
            minimum_number_2 = i
    return minimum_number_2


print(minimum_value_2(lst))
