"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def rec_1():
    symbol_1 = input()
    a = input()
    b = input()
    if int(symbol_1) == 0:
        print('do nothing')
    elif symbol_1 == '+' or symbol_1 == '-' or symbol_1 == '*' or symbol_1 == '/':
        if a.isdigit():
            a = int(a)
            if b.isdigit():
                b = int(b)
                if symbol_1 == '+':
                    print(a + b)
                elif symbol_1 == '-':
                    print(a - b)
                elif symbol_1 == '*':
                    print(a * b)
                elif symbol_1 == '/' and b != 0:
                    print(a / b)
                elif b == 0 and symbol_1 == '/':
                    print('Скажи нет делению на ноль')
                    rec_1()
            else:
                print('Ошибка b')
                rec_1()
        else:
            print('Ошибка a')
            rec_1()
    else:
        print('Ошибка символа')
        rec_1()

rec_1()