"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.
Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ
Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
# def func(num):
#     list_of_num = []
#     while len(str(num)) > 1:
#         if num != 0:
#             rem = num % 10
#             num = num // 10
#             list_of_num.append(str(rem))
#         else:
#             list_of_num.append(str(num))
#     if len(str(num)) == 1:
#         list_of_num.append(str(num))
#
#
#
#     str_nums = ''.join(list_of_num)
#     print(str_nums)
#
# func(554040)

list_of_num = []
def func(num):
    if len(str(num)) == 1:
        list_of_num.append(str(num))
    elif num != 0:
        rem = num % 10
        num = num // 10
        list_of_num.append(str(rem))
        func(num)


    str_nums = ''.join(list_of_num)
    print(str_nums)

func(12020)
# Не понял почему в выводе так много ответов)))
