"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Подсказка:
Базовый случай здесь - угадали число или закончились попытки
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint

attempts = -1
not_a = 0

def func():
    global attempts
    global not_a
    attempts += 1
    if attempts <= 10:
        a = randint(0, 100)
        if a == not_a:
            func()
        else:
            answer = input('Угадай число от 0 до 100 ')
            if int(answer) == a:
                print('АААААААААААААААААААААААА класс')
            else:
                not_a = a
                func()
    else:
        print('Проиграл!')

func()