"""
Задание 3.
Для этой задачи:
1) придумайте 2-3 решения (не менее двух) разной!! сложности
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
#1 Сложность = n
companies = {'HOME': 1000000, 'Dust': 200000, 'Google': 1000000000, 'Papa Jones': 2000000, 'Opera': 356000000, 'Houses': 100000}  # O(1)
max_num = 0  # O(1)
for i, j in companies.items():  # O(N)
    if max_num < j:  # O(1)
        max_num = j  # O(1)

#print(max_num)
#2 Сложность = n^2
companies_1 = [['HOME', 1000000], ['Dust', 200000], ['Google', 1000000000], ['Papa Jones', 2000000], ['Opera', 356000000], ['Houses', 100000]]  # O(1)
max_n = 0  # O(1)
for i in companies_1:  # O(N)
    for j in i:  # O(N)
        if j == i[1]:  # O(1)
            if max_n < j:  # O(1)
                max_n = j  # O(1)

print(max_n)

# Вывод, первый вариант менее затратный по времени и ресурсам, так как сложнсоть у первого ниже чем у второго




