"""
Задание 6.
Задание на закрепление навыков работы с очередью
Реализуйте структуру "доска задач".
Структура должна предусматривать наличие несольких очередей задач, например,
1) базовой, откуда задачи берутся, решаются и отправляются в список решенных
2) очередь на доработку, когда нерешенные задачи из первой очереди отправляются
на корректировку решения
После реализации структуры, проверьте ее работу на различных сценариях
Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока
Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.
Задание творческое. Здесь нет жестких требований к выполнению.
"""
to_do = ['Помыть пол', 'Поесть', 'Купить новые майки', 'Сесть делать дз']
not_done = []
all_done = []
while len(to_do) > 0:
    n = (input(f'Ты сделал: {to_do[0]} ?')).upper()
    if n == 'Y':
        all_done.append(to_do[0])
        to_do.pop(0)
    else:
        not_done.append((to_do[0]))
        to_do.pop(0)

m = input('Будешь переделовать?').upper()
if m == 'Y':
    n = (input(f'Ты сделал: {not_done[0]} ?')).upper()
    if n == 'Y':
        all_done.append(not_done[0])
        not_done.pop(0)


print(f"Сделано: {all_done}")
print(f'Не сделано: {not_done}')



