"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные по длине части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, Кучей...

Важно: стройте массив именно по формуле 2m+1
Потому что параметр m вам пригодится при поиске медианы, когда массив будет отсортирован.
Этот парамет m вам нужно запрашивать у пользователя.

[5, 3, 4, 3, 3, 3, 3]

[3, 3, 3, 3, 3, 4, 5]

my_lst
new_lts

arr[m]


from statistics import median

[3, 4, 3, 3, 5, 3, 3]

left = []
right = []

left == right and

for i in
    for
    left == right
    left.clear()
    right.clear()


"""
from random import randint


# функция для генерации массива с простейщей проверкой введеного значения
def massive_creation():
    num = int(input('Введите размер массива, это обязательно должно быть нечетное положительное число: '))
    if num % 2 == 1 and num > 0:
        new_lst = [randint(0, 100) for x in range(num)]
        return new_lst
    else:
        print("Вы ввели число, не подходящее под условие")
        return massive_creation()


# Функция ищет медиану
def median_searching(some_lst):
    temp_lst = some_lst.copy()
    m = int((len(temp_lst) - 1) / 2)
    for i in range(m):
        temp_lst.remove(max(temp_lst))
    return max(temp_lst)


generated_lst = massive_creation()
print(generated_lst)
print(median_searching(generated_lst))

"""
Как по мне разумнее спрашивать у пользователя размер массива, проверяя, чтобы он был нечетным, а не m из формулы 2m + 1.
Так как итоговая функция не даст создать массив из четного числа элементов, то уже m ищем исходя из размера итогового
массива, который 100% будет нечетным.
Также проверку на нечетность размера массива можно было включить в функцию поиска медианы, но с учетом генерации списка
функцией это излишне.
"""