"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные по длине части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, Кучей...

Важно: стройте массив именно по формуле 2m+1
Потому что параметр m вам пригодится при поиске медианы, когда массив будет отсортирован.
Этот парамет m вам нужно запрашивать у пользователя.

[5, 3, 4, 3, 3, 3, 3]

[3, 3, 3, 3, 3, 4, 5]

my_lst
new_lts

arr[m]


from statistics import median

[3, 4, 3, 3, 5, 3, 3]

left = []
right = []

left == right and

for i in
    for
    left == right
    left.clear()
    right.clear()


"""

import random


def median(lst):
    for i in range(0, len(lst)):
        left = 0
        right = 0
        for j in range(0, len(lst)):
            if lst[i] <= lst[j]:
                left += 1
            if lst[i] >= lst[j]:
                right += 1
        if left == right:
            print(f'Медиана = {str(lst[i])}')
            break
    return f'Получившийся массив: {lst}'


try:
    m = int(input('Введите число М:'))
    SIZE = 2 * m + 1
    need_list = [random.randint(-1000, 1000) for a in range(SIZE)]
    print(median(need_list))
except ValueError:
    print('Неккоректный ввод M')

"""
Пример отработки:
Введите число М:5
Медиана = -176
Получившийся массив: [-568, 674, -74, -578, -384, -618, 88, 382, 743, -176, -945]
"""
