"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные по длине части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, Кучей...

[5, 3, 4, 3, 3, 3, 3]

[3, 3, 3, 3, 3, 4, 5]

my_lst
new_lts

arr[m]


from statistics import median

[3, 4, 3, 3, 5, 3, 3]

left = []
right = []

left == right and

for i in
    for
    left == right
    left.clear()
    right.clear()


"""
import random
import numpy as np


m = int(input('Введите натуральное число: '))
orig_list = [random.randint(0, 20) for _ in range(2 * m + 1)]  # размер массива 2m + 1 вставил сюда

print(sorted(orig_list))
np.median(orig_list)  # маленькая встроенная функция

print(f'Медиана равна : {np.median(orig_list)}')

#  нашел встроенную функцию медиана в библиотеке numPy, вместе с sorted должно решать задание.
#  работает

