"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные по длине части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, Кучей...

Важно: стройте массив именно по формуле 2m+1
Потому что параметр m вам пригодится при поиске медианы, когда массив будет отсортирован.
Этот парамет m вам нужно запрашивать у пользователя.

[5, 3, 4, 3, 3, 3, 3]

[3, 3, 3, 3, 3, 4, 5]

my_lst
new_lts

arr[m]


from statistics import median

[3, 4, 3, 3, 5, 3, 3]

left = []
right = []

left == right and

for i in
    for
    left == right
    left.clear()
    right.clear()


"""

import timeit
from random import randint
from statistics import median


def gnome_sort(sort_list):
    i = 1
    while i < len(sort_list):
        if not i or sort_list[i - 1] <= sort_list[i]:
            i += 1
        else:
            sort_list[i], sort_list[i - 1] = sort_list[i - 1], sort_list[i]
            i -= 1
    return sort_list

m = int(input('Введите m: '))
orig_list = [randint(0, 100) for i in range(2 * m + 1)]
print(f'Исходный массив:\n{orig_list}')
print(f'Медиана (через встроенную функцию) - {median(orig_list)}')
print(f'Медиана (метод сортировки Гномья) - {gnome_sort(orig_list)[m]}')


print(f'Время (median): {timeit.timeit("median(orig_list[:])", globals=globals(), number=10000)}')

print(f'Время (gnome_median): {timeit.timeit("gnome_sort(orig_list[:])", globals=globals(), number=10000)}')


"""
Как и ожидалось если сравнивать метод сортировки Гномья и встроенную функцию, быстрее оказалось встроенная функция
нахождения медианы.
"""