"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Хотя в примерах к уроку уже есть вариант реализации слияния,
попробуйте предложить другой (придумать или найти)

И попытаться сделать замеры на массивах разной длины: 10, 100, 1000, ...

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""

import random
import timeit


def merge_sort(arr):
    if len(arr) > 1:
        middle = len(arr) // 2
        left = arr[:middle]
        right = arr[middle:]

        merge_sort(left)
        merge_sort(right)

        i = 0
        j = 0
        k = 0
        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                arr[k] = left[i]
                i += 1
            else:
                arr[k] = right[j]
                j += 1
            k += 1

        while i < len(left):
            arr[k] = left[i]
            i += 1
            k += 1

        while j < len(right):
            arr[k] = right[j]
            j += 1
            k += 1


n = int(input("Введите число элементов: "))
lst = [random.random()*50 for i in range(n)]

print(f"Исходный - {lst}")
merge_sort(lst)
print(f"Отсортированный - {lst}")
print(f"Время: {timeit.timeit('merge_sort(lst[:])', globals = globals(), number = 1000)}")


"""
Введите число элементов: 5
Исходный - [38.05895269835572, 5.249615952209391, 14.156847343049584, 18.151184255201898, 46.02143604891712]
Отсортированный - [5.249615952209391, 14.156847343049584, 18.151184255201898, 38.05895269835572, 46.02143604891712]
Время: 0.008079432000000164


Введите число элементов: 10
Исходный - [31.82442191284782, 32.31229237770361, 34.37822273010697, 45.85957478749517, 9.05396172011349...]
Отсортированный - [1.7000047988743383, 9.05396172011349, 11.22521706791737, 14.852748407724349...]
Время: 0.018417879000000248


Введите число элементов: 100
Исходный - [9.515055379333148, 0.9365523094175376, 11.170228259840592, 4.520551067674167, 7.756626212200956...]
Отсортированный - [0.9365523094175376, 1.7727291257701172, 2.0228278879874106, 2.548687975196912, 2.5811506089516154...]
Время: 0.20699890200000004


Введите число элементов: 1000
Исходный - [25.319570583092897, 40.95351693551129, 10.087458946822025, 21.795827984867838, 22.460389392701273...]
Отсортированный - [0.04271361409767804, 0.2061709304711168, 0.2976868180478043, 0.3048762995730592...]
Время: 2.8089776540000004
"""