"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные по длине части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, Кучей...

[5, 3, 4, 3, 3, 3, 3]

[3, 3, 3, 3, 3, 4, 5]

my_lst
new_lts

arr[m]


from statistics import median

[3, 4, 3, 3, 5, 3, 3]

left = []
right = []

left == right and

for i in
    for
    left == right
    left.clear()
    right.clear()


"""

from random import random

m = 10  # длина массива - 2m + 1


def find_median(my_list):
    for i in range(m): 			 # проходим кол-во раз, равных половине списка и последовательно удаляем
        my_list.remove(max(my_list)) 	 # максимальный элемент
    return max(my_list) 		 # оставшийся максимальный элемент будет медианой


my_list = [round(random() * 100, 2) for _ in range(2 * m + 1)]

print(my_list)  # выводим массив
print("Медиана: ", find_median(my_list))
